{
  "date": "2026-09-23",
  "url": "https://www.catholicgallery.org/mass-reading/230926/",
  "title": "Daily Mass Readings for Wednesday, 23 September 2026",
  "feast": "Pio of Pietrelcina, Priest Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Proverbs 30: 5-9",
      "reference": "Proverbs 30: 5-9",
      "verses": [
        "5 Every word of God is fire tried: he is a buckler to them that hope in him.",
        "6 Add not any thing to his words, lest thou be reproved, and found a liar:",
        "7 Two things I have asked of thee, deny them not to me before I die.",
        "8 Remove far from me vanity, and lying words. Give me neither beggary, nor riches: give me only the necessaries of life:",
        "9 Lest perhaps being filled, I should be tempted to deny, and say: Who is the Lord? or being compelled by poverty, I should steal, and forswear the name of my God."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 119: 29, 72, 89, 101, 104, 163",
      "reference": "Psalms 119: 29, 72, 89, 101, 104, 163",
      "verses": [
        "R. (105) Your word, O Lord, is a lamp for my feet.",
        "29 Remove from me the way of iniquity: and out of thy law have mercy on me.",
        "R. Your word, O Lord, is a lamp for my feet.",
        "72 The law of thy mouth is good to me, above thousands of gold and silver.",
        "R. Your word, O Lord, is a lamp for my feet.",
        "89 LAMED. For ever, O Lord, thy word standeth firm in heaven.",
        "R. Your word, O Lord, is a lamp for my feet.",
        "101 I have restrained my feet from every evil way: that I may keep thy words.",
        "R. Your word, O Lord, is a lamp for my feet.",
        "104 By thy commandments I have had understanding: therefore have I hated every way of iniquity.",
        "R. Your word, O Lord, is a lamp for my feet.",
        "163 I have hated and abhorred iniquity; but I have loved thy law.",
        "R. Your word, O Lord, is a lamp for my feet."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Mark 1: 15",
      "reference": "Mark 1: 15",
      "verses": [
        "R. Alleluia, alleluia.",
        "15 The Kingdom of God is at hand; repent and believe in the Gospel.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 9: 1-6",
      "reference": "Luke 9: 1-6",
      "verses": [
        "1 Then calling together the twelve apostles, he gave them power and authority over all devils, and to cure diseases.",
        "2 And he sent them to preach the kingdom of God, and to heal the sick.",
        "3 And he said to them: Take nothing for your journey; neither staff, nor scrip, nor bread, nor money; neither have two coats.",
        "4 And whatsoever house you shall enter into, abide there, and depart not from thence.",
        "5 And whosoever will not receive you, when ye go out of that city, shake off even the dust of your feet, for a testimony against them.",
        "6 And going out, they went about through the towns, preaching the gospel, and healing everywhere."
      ]
    }
  ]
}