{
  "date": "2026-09-12",
  "url": "https://www.catholicgallery.org/mass-reading/120926/",
  "title": "Daily Mass Readings for Saturday, 12 September 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary/ Holy Name of Mary",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Corinthians 10: 14-22",
      "reference": "First Corinthians 10: 14-22",
      "verses": [
        "14 Wherefore, my dearly beloved, fly from the service of idols.",
        "15 I speak as to wise men: judge ye yourselves what I say.",
        "16 The chalice of benediction, which we bless, is it not the communion of the blood of Christ? And the bread, which we break, is it not the partaking of the body of the Lord?",
        "17 For we, being many, are one bread, one body, all that partake of one bread.",
        "18 Behold Israel according to the flesh: are not they, that eat of the sacrifices, partakers of the altar?",
        "19 What then? Do I say, that what is offered in sacrifice to idols, is any thing? Or, that the idol is any thing?",
        "20 But the things which the heathens sacrifice, they sacrifice to devils, and not to God. And I would not that you should be made partakers with devils.",
        "21 You cannot drink the chalice of the Lord, and the chalice of devils: you cannot be partakers of the table of the Lord, and of the table of devils.",
        "22 Do we provoke the Lord to jealousy? Are we stronger than he? All things are lawful for me, but all things are not expedient."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 116: 12-13, 17-18",
      "reference": "Psalms 116: 12-13, 17-18",
      "verses": [
        "R. (17) To you, Lord, I will offer a sacrifice of praise.",
        "12 What shall I render to the Lord, for all the things he hath rendered unto me?",
        "13 I will take the chalice of salvation; and I will call upon the name of the Lord.",
        "R. To you, Lord, I will offer a sacrifice of praise.",
        "17 I will sacrifice to thee the sacrifice of praise, and I will call upon the name of the Lord.",
        "18 I will pay my vows to the Lord in the sight of all his people:",
        "R. To you, Lord, I will offer a sacrifice of praise."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 23",
      "reference": "John 14: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Whoever loves me will keep my word, and my Father will love him, and we will come to him.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 6: 43-49",
      "reference": "Luke 6: 43-49",
      "verses": [
        "43 For there is no good tree that bringeth forth evil fruit; nor an evil tree that bringeth forth good fruit.",
        "44 For every tree is known by its fruit. For men do not gather figs from thorns; nor from a bramble bush do they gather the grape.",
        "45 A good man out of the good treasure of his heart bringeth forth that which is good: and an evil man out of the evil treasure bringeth forth that which is evil. For out of the abundance of the heart the mouth speaketh.",
        "46 And why call you me, Lord, Lord; and do not the things which I say?",
        "47 Every one that cometh to me, and heareth my words, and doth them, I will shew you to whom he is like.",
        "48 He is like to a man building a house, who digged deep, and laid the foundation upon a rock. And when a flood came, the stream beat vehemently upon that house, and it could not shake it; for it was founded on a rock.",
        "49 But he that heareth, and doth not, is like to a man building his house upon the earth without a foundation: against which the stream beat vehemently, and immediately it fell, and the ruin of that house was great."
      ]
    }
  ]
}