{
  "date": "2026-09-08",
  "url": "https://www.catholicgallery.org/mass-reading/080926/",
  "title": "Daily Mass Readings for Tuesday, 8 September 2026",
  "feast": "Nativity of the Blessed Virgin Mary Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Micah 5: 1-4a or Romans 8: 28-30",
      "reference": "Micah 5: 1-4a or Romans 8: 28-30",
      "verses": [
        "1 Now shalt thou be laid waste, O daughter of the robber: they have laid siege against us, with a rod shall they strike the cheek of the judge of Israel.",
        "2 AND THOU, BETHLEHEM Ephrata, art a little one among the thousands of Juda: out of thee shall he come forth unto me that is to be the ruler in Israel: and his going forth is from the beginning, from the days of eternity.",
        "3 Therefore will he give them up even till the time wherein she that travaileth shall bring forth: and the remnant of his brethren shall be converted to the children of Israel.",
        "4 And he shall stand, and feed in the strength of the Lord, in the height of the name of the Lord his God: and they shall be converted, for now shall he be magnified even to the ends of the earth.",
        "Or",
        "28 And we know that to them that love God, all things work together unto good, to such as, according to his purpose, are called to be saints.",
        "29 For whom he foreknew, he also predestinated to be made conformable to the image of his Son; that he might be the firstborn amongst many brethren.",
        "30 And whom he predestinated, them he also called. And whom he called, them he also justified. And whom he justified, them he also glorified."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 13: 6ab, 6c",
      "reference": "Psalms 13: 6ab, 6c",
      "verses": [
        "R. (Isaiah 61:10) With delight I rejoice in the Lord.",
        "6ab But I have trusted in thy mercy. My heart shall rejoice in thy salvation.",
        "R. With delight I rejoice in the Lord.",
        "6c I will sing to the Lord, who giveth me good things.",
        "R. With delight I rejoice in the Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia",
      "reference": "",
      "verses": [
        "R. Alleluia, alleluia.",
        "Blessed are you, holy Virgin Mary, deserving of all praise; from you rose the sun of Justice, Christ our God.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 1: 1-16, 18-23",
      "reference": "Matthew 1: 1-16, 18-23",
      "verses": [
        "1 The book of the generation of Jesus Christ, the son of David, the son of Abraham:",
        "2 Abraham begot Isaac. And Isaac begot Jacob. And Jacob begot Judas and his brethren.",
        "3 And Judas begot Phares and Zara of Thamar. And Phares begot Esron. And Esron begot Aram.",
        "4 And Aram begot Aminadab. And Aminadab begot Naasson. And Naasson begot Salmon.",
        "5 And Salmon begot Booz of Rahab. And Booz begot Obed of Ruth. And Obed begot Jesse.",
        "6 And Jesse begot David the king. And David the king begot Solomon, of her that had been the wife of Urias.",
        "7 And Solomon begot Roboam. And Roboam begot Abia. And Abia begot Asa.",
        "8 And Asa begot Josaphat. And Josaphat begot Joram. And Joram begot Ozias.",
        "9 And Ozias begot Joatham. And Joatham begot Achaz. And Achaz begot Ezechias.",
        "10 And Ezechias begot Manasses. And Manasses begot Amon. And Amon begot Josias.",
        "11 And Josias begot Jechonias and his brethren in the transmigration of Babylon.",
        "12 And after the transmigration of Babylon, Jechonias begot Salathiel. And Salathiel begot Zorobabel.",
        "13 And Zorobabel begot Abiud. And Abiud begot Eliacim. And Eliacim begot Azor.",
        "14 And Azor begot Sadoc. And Sadoc begot Achim. And Achim begot Eliud.",
        "15 And Eliud begot Eleazar. And Eleazar begot Mathan. And Mathan begot Jacob.",
        "16 And Jacob begot Joseph the husband of Mary, of whom was born Jesus, who is called Christ.",
        "18 Now the generation of Christ was in this wise. When as his mother Mary was espoused to Joseph, before they came together, she was found with child, of the Holy Ghost.",
        "19 Whereupon Joseph her husband, being a just man, and not willing publicly to expose her, was minded to put her away privately.",
        "20 But while he thought on these things, behold the angel of the Lord appeared to him in his sleep, saying: Joseph, son of David, fear not to take unto thee Mary thy wife, for that which is conceived in her, is of the Holy Ghost.",
        "21 And she shall bring forth a son: and thou shalt call his name JESUS. For he shall save his people from their sins.",
        "22 Now all this was done that it might be fulfilled which the Lord spoke by the prophet, saying:",
        "23 Behold a virgin shall be with child, and bring forth a son, and they shall call his name Emmanuel, which being interpreted is, God with us."
      ]
    }
  ]
}