{
  "date": "2026-09-14",
  "url": "https://www.catholicgallery.org/mass-reading/140926/",
  "title": "Daily Mass Readings for Monday, 14 September 2026",
  "feast": "Exaltation of the Holy Cross Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Numbers 21: 4b-9",
      "reference": "Numbers 21: 4b-9",
      "verses": [
        "4b With the people began to be weary of their journey and labour:",
        "5 And speaking against God and Moses, they said: Why didst thou bring us out of Egypt, to die in the wilderness? There is no bread, nor have we any waters: our soul now loatheth this very light food.",
        "6 Wherefore the Lord sent among the people fiery serpents, which bit them and killed many of them.",
        "7 Upon which they came to Moses, and said: We have sinned, because we have spoken against the Lord and thee: pray that he may take away these serpents from us. And Moses prayed for the people.",
        "8 And the Lord said to him: Make brazen serpent, and set it up for a sign: whosoever being struck shall look on it, shall live.",
        "9 Moses therefore made a brazen serpent, and set it up for a sign: which when they that were bitten looked upon, they were healed."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 78: 1bc-2, 34-35, 36-37, 38",
      "reference": "Psalms 78: 1bc-2, 34-35, 36-37, 38",
      "verses": [
        "R. (7b) Do not forget the works of the Lord!",
        "1 Attend, O my people, to my law: incline your ears to the words of my mouth.",
        "2 I will open my mouth in parables: I will utter propositions from the beginning.",
        "R. Do not forget the works of the Lord!",
        "34 When he slew them, then they sought him: and they returned, and came to him early in the morning.",
        "35 And they remembered that God was their helper: and the most high God their redeemer.",
        "R. Do not forget the works of the Lord!",
        "36 And they loved him with their mouth: and with their tongue they lied unto him:",
        "37 But their heart was not right with him: nor were they counted faithful in his covenant.",
        "R. Do not forget the works of the Lord!",
        "38 But he is merciful, and will forgive their sins: and will not destroy them. And many a time did he turn away his anger: and did not kindle all his wrath.",
        "R. Do not forget the works of the Lord!"
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Philippians 2: 6-11",
      "reference": "Philippians 2: 6-11",
      "verses": [
        "6 Who being in the form of God, thought it not robbery to be equal with God:",
        "7 But emptied himself, taking the form of a servant, being made in the likeness of men, and in habit found as a man.",
        "8 He humbled himself, becoming obedient unto death, even to the death of the cross.",
        "9 For which cause God also hath exalted him, and hath given him a name which is above all names:",
        "10 That in the name of Jesus every knee should bow, of those that are in heaven, on earth, and under the earth:",
        "11 And that every tongue should confess that the Lord Jesus Christ is in the glory of God the Father."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia",
      "reference": "",
      "verses": [
        "R. Alleluia, alleluia.",
        "We adore you, O Christ, and we bless you, because by your Cross you have redeemed the world.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 3: 13-17",
      "reference": "John 3: 13-17",
      "verses": [
        "13 And no man hath ascended into heaven, but he that descended from heaven, the Son of man who is in heaven.",
        "14 And as Moses lifted up the serpent in the desert, so must the Son of man be lifted up:",
        "15 That whosoever believeth in him, may not perish; but may have life everlasting.",
        "16 For God so loved the world, as to give his only begotten Son; that whosoever believeth in him, may not perish, but may have life everlasting.",
        "17 For God sent not his Son into the world, to judge the world, but that the world may be saved by him."
      ]
    }
  ]
}