{
  "date": "2026-09-11",
  "url": "https://www.catholicgallery.org/mass-reading/110926/",
  "title": "Daily Mass Readings for Friday, 11 September 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Corinthians 9: 16-19, 22b-27",
      "reference": "First Corinthians 9: 16-19, 22b-27",
      "verses": [
        "16 For if I preach the gospel, it is no glory to me, for a necessity lieth upon me: for woe is unto me if I preach not the gospel.",
        "17 For if I do this thing willingly, I have a reward: but if against my will, a dispensation is committed to me:",
        "18 What is my reward then? That preaching the gospel, I may deliver the gospel without charge, that I abuse not my power in the gospel.",
        "19 For whereas I was free as to all, I made myself the servant of all, that I might gain the more.",
        "22 To the weak I became weak, that I might gain the weak. I became all things to all men, that I might save all.",
        "23 And I do all things for the gospel’s sake: that I may be made partaker thereof.",
        "24 Know you not that they that run in the race, all run indeed, but one receiveth the prize? So run that you may obtain.",
        "25 And every one that striveth for the mastery, refraineth himself from all things: and they indeed that they may receive a corruptible crown; but we an incorruptible one.",
        "26 I therefore so run, not as at an uncertainty: I so fight, not as one beating the air:",
        "27 But I chastise my body, and bring it into subjection: lest perhaps, when I have preached to others, I myself should become a castaway."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 84: 3, 4, 5-6, 12",
      "reference": "Psalms 84: 3, 4, 5-6, 12",
      "verses": [
        "R. (2) How lovely is your dwelling place, Lord, mighty God!",
        "3 My soul longeth and fainteth for the courts of the Lord. My heart and my flesh have rejoiced in the living God.",
        "R. How lovely is your dwelling place, Lord, mighty God!",
        "4 For the sparrow hath found herself a house, and the turtle a nest for herself where she may lay her young ones: Thy altars, O Lord of hosts, my king and my God.",
        "R. How lovely is your dwelling place, Lord, mighty God!",
        "5 Blessed are they that dwell in thy house, O Lord: they shall praise thee for ever and ever.",
        "6 Blessed is the man whose help is from thee: in his heart he hath disposed to ascend by steps,",
        "R. How lovely is your dwelling place, Lord, mighty God!",
        "12 For God loveth mercy and truth: the Lord will give grace and glory. He will not deprive of good things them that walk in innocence.",
        "R. How lovely is your dwelling place, Lord, mighty God!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 17: 17b, 17a",
      "reference": "John 17: 17b, 17a",
      "verses": [
        "R. Alleluia, alleluia.",
        "17b, 17a Your word, O Lord, is truth; consecrate us in the truth.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 6: 39-42",
      "reference": "Luke 6: 39-42",
      "verses": [
        "39 And he spoke also to them a similitude: Can the blind lead the blind? do they not both fall into the ditch?",
        "40 The disciple is not above his master: but every one shall be perfect, if he be as his master.",
        "41 And why seest thou the mote in thy brother’s eye: but the beam that is in thy own eye thou considerest not?",
        "42 Or how canst thou say to thy brother: Brother, let me pull the mote out of thy eye, when thou thyself seest not the beam in thy own eye? Hypocrite, cast first the beam out of thy own eye; and then shalt thou see clearly to take out the mote from thy brother’s eye."
      ]
    }
  ]
}