{
  "date": "2026-09-25",
  "url": "https://www.catholicgallery.org/mass-reading/250926/",
  "title": "Daily Mass Readings for Friday, 25 September 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ecclesiastes 3: 1-11",
      "reference": "Ecclesiastes 3: 1-11",
      "verses": [
        "1 All things have their season, and in their times all things pass under heaven.",
        "2 A time to be born and a time to die. A time to plant, and a time to pluck up that which is planted.",
        "3 A time to kill, and a time to heal. A time to destroy, and a time to build.",
        "4 A time to weep, and a time to laugh. A time to mourn, and a time to dance.",
        "5 A time to scatter stones, and a time to gather. A time to embrace, and a time to be far from embraces.",
        "6 A time to get, and a time to lose. A time to keep, and a time to cast away.",
        "7 A time to rend, and a time to sew. A time to keep silence, and a time to speak.",
        "8 A time of love, and a time of hatred. A time of war, and a time of peace.",
        "9 What hath man more of his labour?",
        "10 I have seen the trouble, which God hath given the sons of men to be exercised in it.",
        "11 He hath made all things good in their time, and hath delivered the world to their consideration, so that man cannot find out the work which God hath made from the beginning to the end."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 144: 1b and 2abc, 3-4",
      "reference": "Psalms 144: 1b and 2abc, 3-4",
      "verses": [
        "R. (1) Blessed be the Lord, my Rock!",
        "1b Blessed be the Lord my God,",
        "2abc My mercy, and my refuge: my support, and my deliverer: My protector, and I have hoped in him.",
        "R. Blessed be the Lord, my Rock!",
        "3 Lord, what is man, that thou art made known to him? or the son of man, that thou makest account of him?",
        "4 Man is like to vanity: his days pass away like a shadow.",
        "R. Blessed be the Lord, my Rock!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Mark 10: 45",
      "reference": "Mark 10: 45",
      "verses": [
        "R. Alleluia, alleluia.",
        "45 The Son of Man came to serve and to give his life as a ransom for many.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 9: 18-22",
      "reference": "Luke 9: 18-22",
      "verses": [
        "18 And it came to pass, as he was alone praying, his disciples also were with him: and he asked them, saying: Whom do the people say that I am?",
        "19 But they answered, and said: John the Baptist; but some say Elias; and others say that one of the former prophets is risen again.",
        "20 And he said to them: But whom do you say that I am? Simon Peter answering, said: The Christ of God.",
        "21 But he strictly charging them, commanded they should tell this to no man.",
        "22 Saying: The Son of man must suffer many things, and be rejected by the ancients and chief priests and scribes, and be killed, and the third day rise again."
      ]
    }
  ]
}