{
  "date": "2026-09-05",
  "url": "https://www.catholicgallery.org/mass-reading/050926/",
  "title": "Daily Mass Readings for Saturday, 5 September 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Corinthians 4: 6b-15",
      "reference": "First Corinthians 4: 6b-15",
      "verses": [
        "6 Brethren, I have in a figure transferred to myself and to Apollo, for your sakes; that in us you may learn, that one be not puffed up against the other for another, above that which is written.",
        "7 For who distinguisheth thee? Or what hast thou that thou hast not received? And if thou hast received, why dost thou glory, as if thou hadst not received it?",
        "8 You are now full; you are now become rich; you reign without us; and I would to God you did reign, that we also might reign with you.",
        "9 For I think that God hath set forth us apostles, the last, as it were men appointed to death: we are made a spectacle to the world, and to angels, and to men.",
        "10 We are fools for Christ’s sake, but you are wise in Christ; we are weak, but you are strong; you are honourable, but we without honour.",
        "11 Even unto this hour we both hunger and thirst, and are naked, and are buffeted, and have no fixed abode;",
        "12 And we labour, working with our own hands: we are reviled, and we bless; we are persecuted, and we suffer it.",
        "13 We are blasphemed, and we entreat; we are made as the refuse of this world, the offscouring of all even until now.",
        "14 I write not these things to confound you; but I admonish you as my dearest children.",
        "15 For if you have ten thousand instructors in Christ, yet not many fathers. For in Christ Jesus, by the gospel, I have begotten you."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 145: 17-18, 19-20, 21",
      "reference": "Psalms 145: 17-18, 19-20, 21",
      "verses": [
        "R. (18) The Lord is near to all who call upon him.",
        "17 The Lord is just in all his ways: and holy in all his works.",
        "18 The Lord is nigh unto all them that call upon him: to all that call upon him in truth.",
        "R. The Lord is near to all who call upon him.",
        "19 He will do the will of them that fear him: and he will hear their prayer, and save them.",
        "20 The Lord keepeth all them that love him; but all the wicked he will destroy.",
        "R. The Lord is near to all who call upon him.",
        "21 My mouth shall speak the praise of the Lord: and let all flesh bless thy holy name for ever; yea, for ever and ever.",
        "R. The Lord is near to all who call upon him."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 6",
      "reference": "John 14: 6",
      "verses": [
        "R. Alleluia, alleluia.",
        "6 I am the way and the truth and the life, says the Lord; no one comes to the Father except through me.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 6: 1-5",
      "reference": "Luke 6: 1-5",
      "verses": [
        "1 And it came to pass on the second first sabbath, that as he went through the corn fields, his disciples plucked the ears, and did eat, rubbing them in their hands.",
        "2 And some of the Pharisees said to them: Why do you that which is not lawful on the sabbath days?",
        "3 And Jesus answering them, said: Have you not read so much as this, what David did, when himself was hungry, and they that were with him:",
        "4 How he went into the house of God, and took and ate the bread of proposition, and gave to them that were with him, which is not lawful to eat but only for the priests?",
        "5 And he said to them: The Son of man is Lord also of the sabbath."
      ]
    }
  ]
}