{
  "date": "2026-09-04",
  "url": "https://www.catholicgallery.org/mass-reading/040926/",
  "title": "Daily Mass Readings for Friday, 4 September 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Corinthians 4: 1-5",
      "reference": "First Corinthians 4: 1-5",
      "verses": [
        "1 Let a man so account of us as of the ministers of Christ, and the dispensers of the mysteries of God.",
        "2 Here now it is required among the dispensers, that a man be found faithful.",
        "3 But to me it is a very small thing to be judged by you, or by man’s day; but neither do I judge my own self.",
        "4 For I am not conscious to myself of any thing, yet am I not hereby justified; but he that judgeth me, is the Lord.",
        "5 Therefore judge not before the time; until the Lord come, who both will bring to light the hidden things of darkness, and will make manifest the counsels of the hearts; and then shall every man have praise from God."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 37: 3-4, 5-6, 27-28, 39-40",
      "reference": "Psalms 37: 3-4, 5-6, 27-28, 39-40",
      "verses": [
        "R. (39a) The salvation of the just comes from the Lord.",
        "3 Trust in the Lord, and do good, and dwell in the land, and thou shalt be fed with its riches.",
        "4 Delight in the Lord, and he will give thee the requests of thy heart.",
        "R. The salvation of the just comes from the Lord.",
        "5 Commit thy way to the Lord, and trust in him, and he will do it.",
        "6 And he will bring forth thy justice as the light, and thy judgment as the noonday.",
        "R. The salvation of the just comes from the Lord.",
        "27 Decline from evil and do good, and dwell for ever and ever.",
        "28 For the Lord loveth judgment, and will not forsake his saints: they shall be preserved for ever. The unjust shall be punished, and the seed of the wicked shall perish.",
        "R. The salvation of the just comes from the Lord.",
        "39 But the salvation of the just is from the Lord, and he is their protector in the time of trouble.",
        "40 And the Lord will help them and deliver them: and he will rescue them from the wicked, and save them, because they have hoped in him.",
        "R. The salvation of the just comes from the Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 8: 12",
      "reference": "John 8: 12",
      "verses": [
        "R. Alleluia, alleluia.",
        "12 I am the light of the world, says the Lord; whoever follows me will have the light of life.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 5: 33-39",
      "reference": "Luke 5: 33-39",
      "verses": [
        "33 And they said to him: Why do the disciples of John fast often, and make prayers, and the disciples of the Pharisees in like manner; but thine eat and drink?",
        "34 To whom he said: Can you make the children of the bridegroom fast, whilst the bridegroom is with them?",
        "35 But the days will come, when the bridegroom shall be taken away from them, then shall they fast in those days.",
        "36 And he spoke also a similitude to them: That no man putteth a piece from a new garment upon an old garment; otherwise he both rendeth the new, and the piece taken from the new agreeth not with the old.",
        "37 And no man putteth new wine into old bottles: otherwise the new wine will break the bottles, and it will be spilled, and the bottles will be lost.",
        "38 But new wine must be put into new bottles; and both are preserved.",
        "39 And no man drinking old, hath presently a mind to new: for he saith, The old is better."
      ]
    }
  ]
}