{
  "date": "2026-09-15",
  "url": "https://www.catholicgallery.org/mass-reading/150926/",
  "title": "Daily Mass Readings for Tuesday, 15 September 2026",
  "feast": "Our Lady of Sorrows Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Corinthians 12: 12-14, 27-31a",
      "reference": "First Corinthians 12: 12-14, 27-31a",
      "verses": [
        "12 For as the body is one, and hath many members; and all the members of the body, whereas they are many, yet are one body, so also is Christ.",
        "13 For in one Spirit were we all baptized into one body, whether Jews or Gentiles, whether bond or free; and in one Spirit we have all been made to drink.",
        "14 For the body also is not one member, but many.",
        "27 Now you are the body of Christ, and members of member.",
        "28 And God indeed hath set some in the church; first apostles, secondly prophets, thirdly doctors; after that miracles; then the graces of healing, helps, governments, kinds of tongues, interpretations of speeches.",
        "29 Are all apostles? Are all prophets? Are all doctors?",
        "30 Are all workers of miracles? Have all the grace of healing? Do all speak with tongues? Do all interpret?",
        "31 But be zealous for the better gifts. And I shew unto you yet a more excellent way."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 100: 1b-2, 3, 4, 5",
      "reference": "Psalms 100: 1b-2, 3, 4, 5",
      "verses": [
        "R. (3) We are his people: the sheep of his flock.",
        "1b-2 Sing joyfully to God, all the earth: serve ye the Lord with gladness. Come in before his presence with exceeding great joy.",
        "R. We are his people: the sheep of his flock.",
        "3 Know ye that the Lord he is God: he made us, and not we ourselves. We are his people and the sheep of his pasture.",
        "R. We are his people: the sheep of his flock.",
        "4 Go ye into his gates with praise, into his courts with hymns: and give glory to him. Praise ye his name:",
        "R. We are his people: the sheep of his flock.",
        "5 For the Lord is sweet, his mercy endureth for ever, and his truth to generation and generation.",
        "R. We are his people: the sheep of his flock."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia",
      "reference": "",
      "verses": [
        "R. Alleluia, alleluia.",
        "Blessed are you, O Virgin Mary; without dying you won the Martyr’s crown beneath the Cross of the Lord.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 19: 25-27 or Luke 2: 33-35",
      "reference": "John 19: 25-27 or Luke 2: 33-35",
      "verses": [
        "25 Now there stood by the cross of Jesus, his mother, and his mother’s sister, Mary of Cleophas, and Mary Magdalen.",
        "26 When Jesus therefore had seen his mother and the disciple standing whom he loved, he saith to his mother: Woman, behold thy son.",
        "27 After that, he saith to the disciple: Behold thy mother. And from that hour, the disciple took her to his own.",
        "Or",
        "33 And his father and mother were wondering at those things which were spoken concerning him.",
        "34 And Simeon blessed them, and said to Mary his mother: Behold this child is set for the fall, and for the resurrection of many in Israel, and for a sign which shall be contradicted;",
        "35 And thy own soul a sword shall pierce, that, out of many hearts, thoughts may be revealed."
      ]
    }
  ]
}