{
  "date": "2026-01-20",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-tuesday-20th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन  १ शमुवेल १६:१-१३",
      "reference": "पहिले वाचन  १ शमुवेल १६:१-१३",
      "verses": [
        "वाचक :शमुवेलच्या पहिल्या पुस्तकातून घेतलेले वाचन",
        "“शमुवेलने त्याच्या भावांमध्ये दावीदला अभिषेक केला आणि परमेश्वराचा आत्मा त्याच्या ठायी जोराने संचरू लागला. \"",
        "परमेश्वराने शमुवेलला म्हटले, \"मी शौलला इस्राएलच्या राज्यपदावरून झुगारून दिले आहे, तर तू त्याच्यासाठी कोठवर शोक करीत राहणार ? शिंगात तेल भरून चल, मी तुला इशाय बेथलेहेमकर याच्याकडे पाठवतो. कारण मी त्याच्या एका पुत्रास माझ्याकरिता राजा निवडले आहे.\" शमुवेल म्हणाला, \"मी जाऊ कसा? शौलने हे ऐकले तर तो मला जिवे मारील.\" तेव्हा परमेश्वर म्हणाला, \"तू आपल्याबरोबर एक कालवड घेऊन जा आणि सांग, 'मी परमेश्वराप्रीत्यर्थ यज्ञ करावयास आलो आहे.' मग यज्ञास येण्याचे इशायला आमंत्रण कर, म्हणजे तुला काय करावयाचे ते मी सांगेन; मी तुला सांगेन त्याला तू माझ्यासाठी अभिषेक कर.\" परमेश्वराच्या सांगण्याप्रमाणे शमुवेलने केले आणि तो बेथलेहेमला गेला. तेव्हा या नगरातले वडीलजन थरथर कापत त्याला भेटायला आले आणि त्यांनी त्यांना विचारले, \"आपण स्नेहभावाने आला आहा काय ? तो म्हणाला, \"मी स्नेहभावाने आलो आहे. मी परमेश्वराप्रीत्यर्थ यज्ञ करण्यास आलो आहे. तुम्ही शुद्ध होऊन माझ्याबरोबर यज्ञास या.\" त्याने इशाय आणि त्याचे पुत्र यांना पवित्र होऊन यज्ञास येण्याचे आमंत्रण दिले.",
        "ते आले तेव्हा त्याने अलियाबला न्याहाळून पाहून म्हटले, “परमेश्वरासमोर आलेला हाच परमेश्वराचा अभिषिक्त होय.\" पण परमेश्वराने शमुवेलला म्हटले, \"तू त्याच्या स्वरूपावर अथवा त्याच्या शरीराच्या उंच काठीवर जाऊ नको, कारण मी त्याला नापंसत केले आहे. मानवासारखे परमेश्वराचे पाहणे नसते; मानव बाहेरचे स्वरूप पाहतो पण परमेश्वर हृदय पाहतो.\" मग इशायने अवीनादावला बोलावून शमुवेल पुढून चालवले. पण शमुवेल म्हणाला, \"परमेश्वराला हाही पसंत नाही.\" मग इशायने शम्मा यास त्याच्यापुढून चालवले. पण शमुवेल म्हणाला, \"परमेश्वराला हाही पसंत नाही.\" या प्रकारे इशायने आपले सात पुत्र शमुवेलपुडून चालवले. शमुवेलने इशायला म्हटले, \"यातला कोणीही परमेश्वराने पसंत केला नाही.\" शमुवेलने इशायला विचारले, \"तुझे सर्व पुत्र हजर आहेत काय?\" तो म्हणाला, “एक सर्वात धाकटा राहिला आहे; तो शेरडेमेंढरे राखीत आहे.\" तेव्हा शमुवेल इशायला म्हणाला, “त्याला बोलावणे पाठवून आण, तो येईपर्यंत आम्ही भोजनाला बसणार नाही.\" त्याने बोलावणे पाठवून त्याला आणले. त्याचा वर्ण तांबूस, डोळे सुदंर आणि स्वरूप मनोहर होते. तेव्हा परमेश्वराने त्याला म्हटले, \"ऊठ, त्याला अभिषेक कर; हाच तो आहे.\" मग शमुवेलने तेलाचे शिंग हाती घेऊन त्याच्या भावांमध्ये दावीदला अभिषेक केला • आणि त्या दिवसांपासून पुढे परमेश्वराचा आत्मा दावीदच्या ठायी जोराने संचरू लागला. नंतर शमुवेल उठून रामा येथे गेला."
      ],
      "acclamation": "हा प्रभूचा शब्द आहे",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद  स्तोत्र  ८९:२०-२२,२७-२८",
      "reference": "प्रतिसाद  स्तोत्र  ८९:२०-२२,२७-२८",
      "verses": [
        "प्रतिसाद : माझा सेवक दावीद मला मिळाला आहे.",
        "१) पूर्वी तू आपल्या भक्तांशी दृष्टान्ताने बोललास.",
        "तू म्हणालास: “मी एका वीराकडे सहाय्य करण्याचे सोपवले आहे.",
        "लोकांतून निवडलेल्या एकाला मी श्रेष्ठ पदास चढवले आहे.",
        "२) \"माझा सेवक दावीद मला मिळाला आहे,",
        "मी आपल्या पवित्र तेलाने त्याला अभिषेक केला आहे.",
        "त्याच्यावर माझा वरदहस्त सदैव राहील",
        "आणि माझ्या हाताने मी त्याला समर्थ करीन.",
        "३) \"तो मला म्हणेल, 'तू माझा पिता, माझा देव,",
        "माझा तारणकर्ता दुर्ग आहेस'",
        "मी तर त्याला ज्येष्ठ करीन,",
        "पृथ्वीवरील राजात त्याला सर्वश्रेष्ठ करीन.\""
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया!",
        "हे येरुशलेमे, प्रभूचे गुणगान गा, तो आपले आदेश पृथ्वीवर पाठवतो.",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान  मार्क २:२३-२८",
      "reference": "शुभवर्तमान  मार्क २:२३-२८",
      "verses": [
        "वाचक :   मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "“शब्बाथ मनुष्यासाठी केलेला आहे, मनुष्य शब्बाथसाठी केलेला नाही.\"",
        "येशू एके शब्बाथ दिवशी शेतांमधून जात असताना त्याचे शिष्य वाटेने कणसे मोडू लागले. तेव्हा परुशी त्याला म्हणाले, “पाहा, शब्बाथ दिवशी करू नये ते हे का करतात ?” तो त्यांना म्हणाला, “दावीदला गरज पडली, म्हणजे त्याला आणि त्याच्याबरोबर असलेल्यांना भूक लागली तेव्हा त्याने काय केले ? अब्याथार प्रमुख याजक असता तो देवाच्या मंदिरात कसा गेला आणि याजकांशिवाय कोणीही खाऊ नयेत त्या समर्पित भाकऱ्या त्याने कशा खाल्ल्या आणि आपल्याबरोबर असलेल्यांनाही कशा खावयास दिल्या हे तुम्ही कधी वाचले नाही काय?\" आणखी तो त्यांना म्हणाला, “शब्बाथ मनुष्यासाठी केलेला आहे, मनुष्य शब्बाथसाठी केलेला नाही. म्हणून मनुष्याचा पुत्र शब्बाथचाही प्रभू आहे.'"
      ],
      "acclamation": "प्रभूचे हे शुभवर्तमान",
      "response": "सर्व : हे ख्रिस्ता  तुझी स्तुती असो."
    }
  ]
}