{
  "date": "2026-01-18",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-ordinary-second.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन यशया  ४९:३,५-६",
      "reference": "पहिले वाचन यशया  ४९:३,५-६",
      "verses": [
        "वाचक :  यशया या पुस्तकातून घेतलेले वाचन",
        "“माझ्याकडून होणारे तारण तू दिगंतापर्यंत न्यावे म्हणून मी तुला राष्ट्रांचा प्रकाश असा नेमतो.\"",
        "परमेश्वर मला म्हणाला, “तू माझा सेवक आहेस, मला शोभा आणणारा तू इस्राएल आहेस.” परमेश्वराच्या दृष्टीने मला मान मिळाला आणि तो माझा देव, माझे सामर्थ्य झाला. तो परमेश्वर म्हणतो, “याकोबच्या वंशाचा उद्धार करावा, इस्राएलच्या रक्षिलेल्या लोकांना परत आणावे म्हणून तू माझा सेवक व्हावे यात काही विशेष नाही, तर माझ्याकडून होणारे तारण तू दिगंतापर्यंत न्यावे म्हणून मी तुला राष्ट्रांचा प्रकाश असा नेमतो.\""
      ],
      "acclamation": "प्रभूचा शब्द",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद स्तोत्र ४०:२,४,७-१०",
      "reference": "प्रतिसाद स्तोत्र ४०:२,४,७-१०",
      "verses": [
        "प्रतिसाद : हे परमेश्वरा, हा बघ मी आलोच ! मी तुझ्या इच्छेप्रमाणे करावयास आलो आहे.",
        "१ )मी धीर धरून परमेश्वराची वाट पाहिली ते",
        "व्हा त्याने माझ्याकडे वळून माझा धावा ऐकला.",
        "त्याने माझ्या मुखात नवे गीत, आमच्या देवाचे स्तोत्र घातले.",
        "२) यज्ञपशू आणि अन्नार्पण ह्यात तुला संतोष नाही,",
        "तू माझे कान उघडले आहेत. होम आणि",
        "पापांबद्दल तू अर्पण मागत नाहीस.",
        "ह्यावरून मी म्हणालो, \"पाहा, मी आलो आहे.\"",
        "३) ग्रंथपटात माझ्याविषयी लिहून ठेवले आहे की,",
        "हे माझ्या देवा, तुझ्या इच्छेप्रमाणे करण्यात मला आनंद आहे.",
        "तुझे शास्त्र माझ्या अंतर्यामी आहे.",
        "४) महामंडळात मी नीतिमत्त्वाचे सुवृत्त सांगितले.",
        "हे परमेश्वरा, मी आपले तोंड बंद ठेवले नाही हे तू जाणतोस.",
        "दुसरे वाचन :  १ करिंथ १:१-३",
        "वाचक :  पौलचे करिंथकरास पहिले पत्र यातून घेतलेले वाचन",
        "\"देव आपला पिता आणि प्रभू येशू ख्रिस्त ह्यांच्यापासून तुम्हांला कृपा आणि शांती असो.\"",
        "करिंथ येथील देवाच्या मंडळीस, ख्रिस्त येशूमध्ये पवित्र केलेल्या आणि पवित्र जन होण्यास बोलावलेल्या लोकांना आणि आपला प्रभू येशू ख्रिस्त म्हणजे त्यांचा आणि आपलाही प्रभू, ह्याचे नाव सर्व ठिकाणी घेणाऱ्या सर्वांना, देवाच्या इच्छेने ख्रिस्त येशूचा प्रेषित होण्याकरिता बोलावलेला मी पौल आणि आपला बंधू सोस्थनेस ह्यांच्याकडून देव आपला पिता आणि प्रभू येशू ख्रिस्त ह्यांच्यापासून तुम्हाला कृपा आणि शांती असो!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया!",
        "हे परमेश्वरा, बोल, तुझा दास ऐकत आहे.",
        "सार्वकालिक जीवनाची वचने आपणाजवळ आहेत.",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान योहान १:२९-३४",
      "reference": "शुभवर्तमान योहान १:२९-३४",
      "verses": [
        "वाचक : योहानलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "\"हे पाहा, जगाचे पाप हरण करणारे देवाचे कोकरू.\"",
        "येशूला आपणाकडे येताना पाहून योहान म्हणाला, “हे पाहा, जगाचे पाप हरण करणारे देवाचे कोकरू! 'माझ्यामागून एक पुरुष येत आहे तो माझ्यापुढे झाला आहे कारण तो माझ्यापूर्वी होता,' असे ज्याच्याविषयी मी म्हणालो, तो हाच आहे. मी त्याला ओळखत नव्हतो. तरी त्याने इस्राएलला प्रगट व्हावे म्हणून मी पाण्याने बाप्तिस्मा करीत आलो आहे. आत्मा कबुतरासारखा आकाशातून उतरत असताना आणि त्याच्यावर स्थिर राहिलेला मी पाहिला. मी तर त्याला ओळखत नव्हतो. तरी ज्याने मला पाण्याने बाप्तिस्मा करावयास पाठवले त्याने मला सांगितले होते 'ज्या कोणावर आत्मा उतरत असताना आणि स्थिर राहताना पाहशील तोचपवित्र आत्म्याने बाप्तिस्मा करणारा आहे.' मी स्वतः पाहिले आहे आणि साक्ष दिली आहे की, हा देवाचा पुत्र आहे.\""
      ],
      "acclamation": "वाचक : प्रभूचे हे शुभवर्तमान .",
      "response": "सर्व : हे प्रभू येशू ख्रिस्ता,  तुझी स्तुती असो."
    }
  ]
}