{
  "date": "2026-01-12",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-monday-12th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन शमुवेल १:१-८",
      "reference": "पहिले वाचन शमुवेल १:१-८",
      "verses": [
        "वाचक :शमुवेलच्या पहिल्या पुस्तकातून घेतलेले वाचन",
        "“परमेश्वराने तिला मूलबाळ दिले नव्हते म्हणून हन्नाची सवत तिला टोचून बोलत असे.\"",
        "एफ्राईमच्या डोंगराळ प्रदेशात रामाथाईम सोफीम या गावात कोणी एक मनुष्य राहात होता. त्याचे नाव एलकाना असे होते. तो एफ्राइम वंशातला असून त्याच्या वडिलांचे नाव यरोहाम, आजोबांचे नाव एलीहू, पणजोबांचे नाव तोहू, आणि खापरपणजोबांचे नाव सूफ असे होते. एलकानाला दोन बायका होत्या. एकीचे नाव हन्ना आणि दुसरीचे नाव पनिन्ना असे होते. पनिन्नेला मुलेबाळे होती, पण हन्नेला मूल नव्हते.",
        "हा मनुष्य सेनाधीश परमेश्वराची उपासना करायला आणि यज्ञ करायला आपल्या नगराहून निघून शिलो इथे दरवर्षी जात असे. एलीचे दोन मुलगे हफनी आणि फिनहास हे परमेश्वराचे याजक तेथे असत. एलकाना यज्ञ करी त्या दिवशी तो आपली बायको पनिन्ना हिला आणि तिच्या सर्व मुलांमुलींना हिस्से देत असे. हन्नेला मात्र तो एकच हिस्सा देई. जरी ती त्याची आवडती होती तरी परमेश्वराने तिला मूलबाळ दिले नव्हते. म्हणून तिची सवत तिला मनस्वी चिडवी आणि तिची मानहानी करी. असे वर्षानुवर्षे चालले होते. परमेश्वराच्या मंदिरात हन्ना जात असे • तेव्हा प्रत्येक वेळी पनिन्ना तिला छळत असे. मग हन्ना रडे आणि जेवत नसे. तिचा पती एलकाना तिला म्हणाला, \"हन्ना, तू का रडतेस ? तू का जेवत नाहीस? तू मनाला का लावून घेतेस ? मी तुला दहा मुलांपेक्षा अधिक नाही काय?",
        "प्रभूचा शब्द",
        "सर्व : देवाला धन्यवाद."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद  ११६: १२-१९",
      "reference": "प्रतिसाद  ११६: १२-१९",
      "verses": [
        "प्रतिसाद :   प्रभो, मी तुला आभारप्रदर्शक यज्ञ अर्पण करीन.",
        "१) प्रभूच्या अनंत उपकारांबद्दल",
        "मी त्याचा कसा उतराई होऊ ?",
        "माझ्या उद्धाराचे पेयार्पण घेऊन",
        "मी येईन आणि प्रभूच्या नामाचा धावा करीन.",
        "२) प्रभूला केलेले नवस मी त्याच्या",
        "साऱ्या प्रजेसमक्ष फेडीन. प्रभूच्या भक्तांचे",
        "मरण त्यांच्या दृष्टीने अमोल आहे.",
        "३ मी तर तुझा दास आहे ना प्रभू ?",
        "मी तुझ्या सेविकेचा पुत्र आहे.",
        "तू माझी बंधने सोडली आहेत.",
        "मी तुला आभारप्रदर्शक यज्ञ अर्पण करीन.",
        "प्रभूच्या नामाचा धावा करीन.",
        "४ प्रभूला केलेले नवस, मी त्याच्या",
        "साऱ्या प्रजेसमक्ष, प्रभूच्या मंदिरातल्या चौकात,",
        "येरुशलेम नगरात फेडीन."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया !",
        "हे प्रभो, तुझे शब्द हृदयाला आनंदित करतात, ते नेत्रांना प्रकाश देतात.",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान मार्क   १:१४-२०",
      "reference": "शुभवर्तमान मार्क   १:१४-२०",
      "verses": [
        "वाचक :  मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "“पश्चाताप करा आणि शुभवर्तमानावर विश्वास ठेवा.\"",
        "योहानला अटक झाल्यानंतर येशू देवाचे शुभवर्तमान प्रकट करीत गालिलात आला आणि म्हणाला, \"काळाची पूर्णता झाली आहे आणि देवाचे राज्य जवळ आले आहे. पश्चाताप करा आणि शुभवर्तमानावर विश्वास ठेवा.\"",
        "नंतर गालिल समुद्राजवळून जात असताना त्याला शिमोन आणि त्याचा भाऊ आंद्रेया हे समुद्रात जाळे टाकताना दिसले, कारण ते मासे धरणारे होते आणि येशू त्यांना म्हणाला, \"माझ्यामागे या म्हणजे तुम्ही माणसे धरणारे व्हाल, असे मी करीन.” मग ते लागलेच जाळी सोडून त्याला अनुसरले. तेथून काहीसे पुढे गेल्यावर त्याला जब्दीचा मुलगा याकोब आणि त्याचा भाऊ योहान हे तारवात जाळी नीट करताना दिसले आणि त्याने त्यांना लागलेच बोलावले. मग ते आपला बाप जब्दी ह्याला भाडोत्री चाकरांबरोबर तारवात सोडून त्याच्यामागे गेले.",
        "वाचक : प्रभूचे हे शुभवर्तमान .",
        "सर्व : हे प्रभू येशू ख्रिस्ता,  तुझी स्तुती असो.",
        "चिंतन:",
        "पहिल्या शिष्यांच्या पाचारणाबद्दलच्या या शुभवर्तमान उताऱ्यातून आपल्याला ख्रिस्ती म्हणून आपल्या स्वतःच्या पाचारणावर विचार करण्यासाठी तीन गोष्टी मिळतातः पहिली गोष्ट म्हणजे, येशू आपल्याला सध्याच्या काळातील आपल्या सामान्य कामांमध्ये बोलावतो. येशूने 'शिमोन आणि त्याचा भाऊ आंद्रिया यांना समुद्रात जाळे टाकताना पाहिले; ते मच्छीमार होते.' ते काम करत आहेत आणि त्यांचे दैनंदिन काम पूर्ण करत आहेत आणि ख्रिस्त त्यांच्या जीवनात आश्चर्यकारकपणे प्रवेश करतो आणि त्यांना त्याचे प्रेषित होण्यासाठी बोलावतो. ते 'हो' असे उत्तर देतात दुसरे म्हणजे, येशूचे आवाहन तातडीचे आहे. तो म्हणतोः ही पूर्णतेची वेळ आहे. देवाचे राज्य जवळ आले आहे. पश्चात्ताप करा आणि सुवार्तेवर विश्वास ठेवा. येशूचे शब्द निकडीची भावना आणि त्याचे अनुसरण करण्याची मागणी व्यक्त करतात. सायमन आणि आंद्रिया या क्षणाचे महत्त्व जाणतात आणि प्राप्त परिस्थिती व व्यावहारिक विचार न करता येशूचे अनुकरण करतात. तिसरे, येशूचे अनुसरण करणे म्हणजे आपल्या जीवनातील काही पैलू बदलणे. तो आपल्याला त्याच्या वचनावर पूर्णपणे विश्वास ठेवण्यासाठी आणि त्यानुसार जगण्यासाठी आपल्या जुन्या सवयी, विचारसरणी आणि जगण्याच्या पद्धतींपासून बदल करण्यास सांगतो.",
        "प्रार्थना:हे प्रभू येशू, तुला अनुसरण्यास व देवराज्याची सुवार्ता पसरविण्यास  आम्हाला प्रेरणा व कृपा दे, आमेन."
      ]
    }
  ]
}