{
  "date": "2026-01-14",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-wednesday-14th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन शमुवेल ३:१-१०,१९-२०",
      "reference": "पहिले वाचन शमुवेल ३:१-१०,१९-२०",
      "verses": [
        "वाचक :शमुवेलच्या पहिल्या पुस्तकातून घेतलेले वाचन",
        "\"हे परमेश्वरा, बोल, तुझा दास ऐकत आहे.\"",
        "छोटा शमुवेल एलीच्या हाताखाली परमेश्वराची सेवा करीत होता. त्या काळी परमेश्वराची वाणी क्वचित ऐकू यायची, त्याचे दृष्टान्तही सहसा होत नसत. एलीची दृष्टी मंद होत चालली होती आणि त्याला दिसत नव्हते. एकदा असे झाले की, तो आपल्या जागेवर झोपला होता. शमुवेल हा मंदिरात देवाचा कोश होता तेथे झोपला होता. देवाचा दीप मालवला जाण्यापूर्वी परमेश्वराने शमुवेलला हाक मारली, \"शमुवेल! शमुवेल!\" तेव्हा तो म्हणाला, \"मी इकडे आहे!\" मग तो एलीकडे धावत गेला आणि म्हणाला, \"मी येथे आहे. आपण मला बोलावलेत ?\" पण तो म्हणाला, \"मी नाही बोलावले, परत जा आणि झोप.\" मग तो गेला आणि जाऊन झोपला. परमेश्वराने पुन्हा हाक मारली, \"शमुवेल!\" शमुवेल उठला आणि एलीकडे जाऊन म्हणाला, \"हा मी आलो, आपण मला बोलावलेत ?\" पण तो म्हणाला, \"मी नाही बोलावले, बाळ, परत जा आणि झोप.\" शमुवेलला परमेश्वराची ओळख अद्याप झाली नव्हती. परमेश्वर त्याच्याशी अजून बोलला नव्हता. पुन्हा तिसऱ्या वेळेस परमेश्वराने शमुवेलला हाक मारली, तेव्हा तो उठला आणि एलीकडे जाऊन म्हणाला \"मी इथेच आहे. आपण मला बोलावलेत ?\" ह्या मुलाला परमेश्वरच बोलावत आहे हे एलीने ओळखले. तो शमुवेलला म्हणाला, “जाऊन झोप. पुन्हा तुला हाक ऐकू आली तर म्हण, 'हे परमेश्वरा, बोल, तुझा दास ऐकत आहे. \"मग शमुवेल आपल्या जागी जाऊन झोपला.",
        "परमेश्वर पुन्हा येऊन उभा राहिला आणि \"शमुवेल ! शमुवेल!\" अशी त्याने पूर्वीप्रमाणे हाक मारली. तेव्हा शमुवेल म्हणाला, \"बोल, तुझा दास ऐकत आहे.\"",
        "शमुवेल वाढत गेला आणि परमेश्वर त्याच्याबरोबर होता, त्याचा एकही शब्द त्याने खाली पडू दिला नाही. दानापासून ते बैर-शेवापर्यंतच्या सर्व इस्राएल लोकांना कळून चुकले की, शमुवेल परमेश्वराचा संदेष्टा म्हणून नियोजित झाला आहे."
      ],
      "acclamation": "प्रभूचा शब्द",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद  स्तोत्र  ४०:२,-५, ७-१०",
      "reference": "प्रतिसाद  स्तोत्र  ४०:२,-५, ७-१०",
      "verses": [
        "प्रतिसाद :   हे परमेश्वरा, तुझ्या इच्छेप्रमाणे करण्यास मी आलो आहे.",
        "१) मी अधीरतेने प्रभूची वाट पहात होतो",
        "आणि त्याने माझ्याकडे लक्ष दिले,",
        "त्याने माझा धावा ऐकला. प्रभूवर भाव ठेवणारा",
        "आणि खोट्या दैवतांची पूजा करणाऱ्या बंडखोर",
        "लोकांच्या नादी न लागणारा माणूस सुखी.",
        "२ )यज्ञ आणि अर्पणे ही तुला नकोत,",
        "पण ऐकायला तू माझे कान उघडे ठेवले आहेत.",
        "होमवली आणि पापवली तुला नकोत.",
        "ह्यावरून मी म्हणालो की, हा बघ, मी आलोच!",
        "३) ग्रंथपटात माझ्याविषयी लिहून ठेवले आहे की,",
        "तुझ्या इच्छेप्रमाणे मी वागावे.",
        "हे देवा, तुझ्या इच्छेप्रमाणे करण्यात मला आनंद वाटतो,",
        "तुझे वचन माझ्या अंतर्यामी आहे.",
        "४) हे प्रभो, महासभेत मी तुझ्या नीतिमत्त्वाचा",
        "पुरस्कार केला. मी आपले तोंड बंद ठेवले नाही,",
        "हे तुला माहीत आहे."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया!",
        "हे परमेश्वरा, तुझा मार्ग मला दाखव. मला सरळ मार्गाने ने",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान  मार्क १:२९-३९",
      "reference": "शुभवर्तमान  मार्क १:२९-३९",
      "verses": [
        "वाचक :   मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "\"येशूने नाना प्रकारच्या रोगांनी पीडलेल्या पुष्कळ माणसांना बरे केले. \" येशू सभास्थानातून निघाल्यावर तो लगेच याकोब आणि योहान ह्यांच्याबरोबर शिमोन आणि आंद्रेया ह्यांच्या घरी गेला. शिमोनची सासू तापाने आजारी पडली होती, तिच्याविषयी लागलेच त्यांनी त्याला सांगितले. तेव्हा त्याने जवळ जाऊन तिच्या हाताला धरून तिला उठवले आणि तिचा ताप निघाला आणि ती त्यांची सेवा करू लागली.त्या सायंकाळी, सूर्यास्त झाल्यावर लोकांनी सर्व आजाऱ्यांस आणि भूतग्रस्तांस त्याच्याकडे आणले आणि सबंध शहर दाराशी लोटले. तेव्हा नाना प्रकारच्या रोगांनी पीडलेल्या पुष्कळ माणसांना त्याने बरे केले आणि अनेक भुते काढली. त्या भुतांनी त्याला ओळखले म्हणून त्याने त्यांस बोलू दिले नाही.",
        "मग तो सकाळी मोठ्या पहाटेस उठून बाहेर गेला आणि रानात जाऊन तेथे त्याने प्रार्थना केली. तेव्हा शिमोन आणि त्याचे सोबती त्याचा शोध करीत गेले आणि तो सापडल्यावर ते त्याला म्हणाले, “सर्व लोक आपला शोध करीत आहेत.\" तेव्हा तो त्यांना म्हणाला, “मला आसपासच्या गावात उपदेश करता यावा म्हणून आपण दुसरीकडे जाऊ, कारण ह्याच उद्देशाने मी निघालो आहे.\" मग तो सबंध गालिलात त्यांच्या सभास्थानातून उपदेश करीत आणि भुते काढीत फिरला."
      ],
      "acclamation": null,
      "response": null
    }
  ]
}