{
  "date": "2026-01-17",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-saturday-17th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन  १ शमुवेल ९:१-४,१७-१९,१०:१",
      "reference": "पहिले वाचन  १ शमुवेल ९:१-४,१७-१९,१०:१",
      "verses": [
        "वाचक :शमुवेलच्या पहिल्या पुस्तकातून घेतलेले वाचन",
        "“परमेश्वर शमुवेलाला म्हणाला, ज्या पुरुषाविषयी मी तुला सांगितले होते तो हा शौल माझ्या लोकांवर सत्ता चालवील.'",
        "एक बन्यामिनी मनुष्य होता, त्याचे नाव कीश असे होते. तो मोठा धनवान मनुष्य होता. तो अबिएलचा पुत्र होता, त्याच्या आजोबांचे नाव सरोर होते. त्याच्या पणजोबांचे नाव बखोरथ होते आणि त्याच्या खापरपणजोबांचे नाव अफिया असे होते. हा बन्यामिनी मनुष्याचा पुत्र असून मोठा पराक्रमी पुरुष होता. त्याचा शौल नामक एक मुलगा होता, तो तरुण आणि देखणा होता. इस्राएल लोकांत त्याच्याइतका देखणा कोणी नव्हता. तो एवढा उंच होता की, सर्व लोक त्याच्या केवळ खांद्याला लागत.",
        "एकदा शौलचा बाप कीश याची गाढवे हरवली. तेव्हा कीश आपला पुत्र शौल यास म्हणाला, \"आपल्या बरोबर एक गडी घेऊन जा आणि गाढवांचा शोध लाव.\" त्याने एफ्राइमचा डोंगरी प्रदेश आणि शलिशा प्रांत पायांखाली घातला तरी ती त्याला सापडली नाहीत. मग ते शालिम प्रांतात गेले तेथेही ती नव्हती. नंतर ते बन्यामिन्यांच्या प्रांतात गेले तेथेही त्यांचा पत्ता लागला नाही.शौल शमुवेलच्या दृष्टीस पडला तेव्हा परमेश्वर त्याला म्हणाला, \"ज्या पुरुषाविषयी मी तुला सांगितले होते तो हा ! हाच माझ्या लोकांवर सत्ता चालवील.\" मग शौल वेशीजवळ शमुवेलकडे जाऊन म्हणाला, “द्रष्ट्याचे घर कोठे आहे ते मला सांग.\" शमुवेल शौलला म्हणाला, “द्रष्टा मीच आहे, माझ्यापुढे उच्च स्थानी चल. आज तू माझ्याबरोबर भोजन करावे, आणि सकाळी तुझी रवानगी करतेवेळी तुझ्या मनात जे काही आहे त्याविषयी मी तुला सांगेन.\"",
        "मग शमुवेलने तेलाची कुपी घेऊन शौलच्या मस्तकावर ओतली आणि त्याचे चुबंन घेऊन म्हटले, त्याच्या वतनाचा अधिपती व्हावे म्हणूनच “परमेश्वराने तुला हा अभिषेक केला आहे. तू परमेश्वराच्या प्रजाजनांवर राज्य करशील आणि त्यांच्या भोवतालच्या शत्रूंच्या हातातून तू त्यांची मुक्तता करशील.\""
      ],
      "acclamation": "प्रभूचा शब्द",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद  स्तोत्र  २१:२-७",
      "reference": "प्रतिसाद  स्तोत्र  २१:२-७",
      "verses": [
        "प्रतिसाद : हे परमेश्वरा, तुझ्या सामर्थ्यामुळे राजा हर्ष करतो.",
        "१) हे परमेश्वरा, तुझ्या सामर्थ्यामुळे राजा हर्ष करतो;",
        "तू सिद्ध केलेल्या तारणामुळे त्याला केवढा उल्हास होतो !",
        "त्याच्या तोंडचे मागणे तू अमान्य केले नाही.",
        "त्याचा मनोरथ तू पूर्ण केला आहे,",
        "२) कल्याणदायी वरदाने घेऊन तू त्याला सामोरा येतोस,",
        "तू त्याच्या मस्तकी शुद्ध सुवर्णाचा मुकूट घालतोस.",
        "त्याने तुझ्याजवळ जीवन मागितले,",
        "तू त्याला युगानुयुगाचे दीर्घ आयुष्य दिले.",
        "३) तू सिद्ध केलेल्या तारणाने त्याचा मोठा गौरव होतो.",
        "तू त्याला प्रताप आणि महिमा ह्यांनी भूषित करतोस,",
        "तू त्याला सर्वकाळ आशीर्वाद दिला आहेस",
        "तू त्याला आपल्या सान्निध्याने अत्यानंदित केले आहेस."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया!",
        "तुझे वचन माझ्या पावलांकरिता दिव्यासारखे आणि माझ्या मार्गावर प्रकाशासारखे आहे.",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान  मार्क २:१३-१७",
      "reference": "शुभवर्तमान  मार्क २:१३-१७",
      "verses": [
        "वाचक :   मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "“मी नीतिमानांस नव्हे तर पापी जनांस बोलवावयास आलो आहे.\"",
        "येशू तेथून निघून समुद्रकिनाऱ्यावर गेला आणि सगळा लोकसमुदाय त्याच्याजवळ आला, तेव्हा त्याने त्यांना शिक्षण दिले. तेथून जात असताना त्याला अल्फीचा मुलगा लेवी जकातीच्या नाक्यावर बसलेला दिसला तेव्हा त्याने त्यालाम्हटले, “माझ्यामागे ये,\" तेव्हा तो उठून त्याच्यामागे गेला.",
        "नंतर तो त्याच्या घरी जेवावयास बसला. तेथे बरेच जकातदार आणि पापी लोकही येशू आणि त्याचे शिष्य ह्यांच्या पंक्तीत बसले. तेव्हा त्याला जकातदार आणि पापी लोक ह्यांच्याबरोबर जेवताना पाहून परुश्यांतील शास्त्री ह्यांनी त्याच्या शिष्यांना म्हटले, “हा जकातदार आणि पापी लोक ह्यांच्याबरोबर का जेवतो?\" हे ऐकून येशू त्यांना म्हणाला, “निरोग्यांना वैद्याची गरज नसते, तर रोग्यांना असते; मी नीतिमानांना नव्हे तर पाप्यांना बोलवावयास आलो आहे.”"
      ],
      "acclamation": "प्रभूचे हे शुभवर्तमान",
      "response": "सर्व : हे ख्रिस्ता  तुझी स्तुती असो."
    }
  ]
}