{
  "date": "2026-01-28",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-wednesday-28th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन २ शमुवेल ७:४-१७",
      "reference": "पहिले वाचन २ शमुवेल ७:४-१७",
      "verses": [
        "वाचक :शमुवेलच्या दुसऱ्या  पुस्तकातून घेतलेले वाचन",
        "\"तुझे घराणे आणि तुझे राज्य माझ्यापुढे अढळ राहील.\"",
        "परमेश्वराचे वचन नाथानला प्राप्त झाले ते असे: “जा माझा सेवक दावीद ह्यास सांग, 'परमेश्वर म्हणतो, तू माझ्या निवासासाठी मंदिर बांधणार काय ? मी इस्राएल लोकांना इजिप्त देशातून बाहेर काढले त्या दिवसापासून आजपर्यंत माझा निवास कधी मंदिरात झाला नाही. डेऱ्यातून आणि मंडपातून मी भ्रमण करीत आहे. मी इस्राएल लोकांसह जिकडेतिकडे ज्या कोणा इस्राएल वंशाला इस्स्राएल लोकांची जोपासना करण्याविषयी मी आज्ञा करीत असे त्यांना, 'तुम्ही माझ्यासाठी गंधसरूचे मंदिर का बांधले नाही' असा एक शब्द तरी मी कधी बोललो आहे काय ?\" तर आता माझा सेवक दावीद यास सांग, 'सेनाधीश परमेश्वर म्हणतो, तू माझ्या प्रजेचा, इस्राएलचा अधिपती व्हावे म्हणून मी तुला मेंढवाड्यातून मेंढरांच्या मागे फिरत असता आणले, जिकडे तू गेलास तिकडे मी तुझ्याबरोबर राहिलो आणि तुझ्या सर्व शत्रूचा तुझ्यापुढून उच्छेद केला; पृथ्वीवर जे पुरुष आजपर्यंत झाले आहेत त्यांच्या नावाप्रमाणे तुझे नाव मी थोर करीन. मी आपल्या इस्राएल लोकांसाठी एक स्थान नेमून देईन, मी तेथे त्यांना रुजवीन म्हणजे ते आपल्या स्थानी वस्ती करून राहतील आणि ते तेथून पुढे कधी ढळणार नाहीत. इस्राएल लोकांवर मी शास्ते नेमले होते त्याच्या काळापासून जसे दुर्जन त्यांना त्रस्त करीत होते तसे ते ह्यापुढे करणार नाहीत. तुला मी शत्रूपासून विसावा दिला आहे. परमेश्वर तुला म्हणत आहे की, मी तुझे घराणे कायमचे स्थापीन. तुझे दिवस पुरे झाले आणि तू जाऊन आपल्या पितरांबरोबर निजलास म्हणजे तुझ्या पोटच्या पुत्राला तुझ्यामागून मी राजासनावर बसवीन आणि त्याचे राज्य बळकट करीन. तो माझ्या नावाप्रीत्यर्थ मंदिर बांधील, मी त्याचे राजासन कायमचे स्थापीन. मी त्याचा पिता होईन आणि तो माझा पुत्र होईल. त्याने अधर्म केल्यास, मनुष्य जशी दंडाने आणि मानवपुत्र जशी फटक्यांनी शिक्षा करतात तशी मी त्याला शिक्षा करीन; पण तुझ्यापुढून घालवून दिलेल्या शौलवरची कृपादृष्टी मी दूर केली तशी त्याच्यावरची माझी कृपादृष्टी दूर होणार नाही. तुझे घराणे आणि तुझे राज्य माझ्यापुढे अढळ राहील, तुझी गादी कायमची स्थापित होईल.\" ही सर्व वचने आणि दर्शने यथार्थपणे नाथानने दावीदला कळवली."
      ],
      "acclamation": "हा प्रभूचा शब्द आहे.",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद  स्तोत्र ८८:४-५,२७-२८.२९-३०",
      "reference": "प्रतिसाद  स्तोत्र ८८:४-५,२७-२८.२९-३०",
      "verses": [
        "प्रतिसाद :   मी आपली दया त्याच्यावर सर्वकाळ कायम राखीन.",
        "१ \"मी आपल्या निवडलेल्या पुरुषाशी करार केला आहे.",
        "मी आपला सेवक दावीद ह्याच्याशी शपथ वाहिली आहे.मी तुझ्या संततीची परंपरा सर्वकाळ चालवीन, तुझे राजासन सर्व पिढ्यांसाठी प्रस्थापित करीन.",
        "२तो मला म्हणेल, 'तू माझा पिता, माझा देव, माझा तारणारा दुर्ग आहेस.' मी तर त्याला माझा ज्येष्ठ पुत्र करीन, पृथ्वीवरील राजांत त्याला सर्वश्रेष्ठ करीन.",
        "३मी आपली दया त्याच्यावर सर्वकाळ कायम राखीन, त्याच्याशी केलेला माझा करार अढळ राहील. त्याचे राजघराणे सर्वकाळ राहील, त्याचे राजासन स्वर्गाप्रमाणे अक्षय ठेवीन."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया!",
        "तुम्ही जीवनाचे वचन पुढे करून दाखवताना ज्योतीसारखे जगात दिसता.",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान  मार्क  ४:१-२०",
      "reference": "शुभवर्तमान  मार्क  ४:१-२०",
      "verses": [
        "वाचक :   मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "\"एक पेरणारा पेरणी करावयास निघाला.\"",
        "येशू समुद्रकिनाऱ्यावर शिक्षण देऊ लागला. तेव्हा त्याच्याजवळ फार मोठा समुदाय जमला, म्हणून तो समुद्रातील एका मचव्यात जाऊन बसला. सर्व लोक समुद्रकिनारी जमिनीवर होते. नंतर तो त्यांस दाखले देऊन पुष्कळ गोष्टी शिकवू लागला आणि शिकवता शिकवता तो त्यांना म्हणाला : \"ऐका! एक पेरणारा पेरणी करावयास निघाला आणि तो पेरीत असताना असे झाले की, काही बी वाटेवर पडले, ते पाखरांनी येऊन खाऊन टाकले. काही बी खडकाळ जमिनीत पडले, तेथे त्यास फारशी माती नव्हती; माती खोल नसल्यामुळे ते लागलेच उगवले आणि सूर्य वर आल्यावर ते उन्हाने करपले आणि मूळ नसल्याकारणाने ते वाळून गेले. काही बी काटेरी झुडपांमध्ये पडले आणि काटेरी झुडपांनीच वाढून त्याची वाढ खुंटवली, म्हणून त्याला काही पीक आले नाही. काही बी चांगल्या जमिनीत पडले, ते उगवले, मोठे झाले आणि त्याला पीक आले आणित्याचे तीसपट, साठपट, शंभरपट असे उत्पन्न आले.\" मग तो म्हणाला, \"ज्याला ऐकावयास कान आहेत तो ऐको.\"तो एकान्ती असता त्याच्याबरोबर बारा जणांसह जे होते त्यांनी त्याला दाखल्याविषयी विचारले. तो त्यांना म्हणाला, \"देवाच्या राज्याचे रहस्यदान तुम्हांलाच दिले आहे, परंतु बाहेरच्यांना सर्व काही दाखल्यांनी सांगण्यात येते ह्यासाठी की, त्यांनी पाहून घ्यावे पण त्यांना दिसू नये, ऐकून घ्यावे पण त्यांना कळू नये, त्यांच्या मनाचा पालट होऊ नये आणि त्यांना क्षमा मिळू नये.\" तो त्यांना म्हणाला, \"हा दाखला तुम्हांला समजला नाही काय ?\" तर मग सर्व दाखले कसे समजतील ? पेरणारा वचन पेरतो. वाटेवर वचन पेरले जाते तेथील लोकांनी ऐकल्याबरोबर सैतान येऊन त्यांच्यातले पेरलेले वचन हिरावून घेतो. तसेच खडकाळ जमिनीत पेरलेले बी म्हणजे वचन ऐकताच लोक ते आनंदाने ग्रहण करतात, तथापि त्यांच्याकडे मूळ नसल्याकारणाने ते अल्पकाळ टिकाव धरतात; मग वचनामुळे संकट आले किंवा छळ झाला म्हणजे ते लागलेच अडखळतात. काटेरी झुडपांमध्ये पेरलेले बी म्हणजे लोक ते वचन ऐकून घेतात आणि नंतर प्रपंचाची चिंता, द्रव्याचा मोह आणि इतर गोष्टींचा लोभ ही त्यांच्यामध्ये शिरून वचनांची वाढ खुंटवतात आणि ते निष्फळ होते. चांगल्या जमिनीत पेरलेले बी म्हणजे वचन ऐकून लोक ते स्वीकारतात; मग कोणी ते तीसपट, कोणी साठपट, कोणी शंभरपट असे पीक देतात.\""
      ],
      "acclamation": "प्रभूचे हे शुभवर्तमान",
      "response": "सर्व : हे ख्रिस्ता  तुझी स्तुती असो."
    }
  ]
}