{
  "date": "2026-01-26",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-monday-26th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन पहिले वाचन २ तीमथ्य १:१-८",
      "reference": "पहिले वाचन पहिले वाचन २ तीमथ्य १:१-८",
      "verses": [
        "वाचक :२ तीमथ्य  पुस्तकातून घेतलेले वाचन",
        "प्रिय मुलगा तीमथ्य ह्याला, रिव्रस्त येशू मधील जीवनविषयक वचनानुसार देवाच्या इच्छेने रिव्रस्त येशूचा प्रेषित पौल ह्याच्याकडून देवपिता व रिव्रस्त येशू आपला प्रभु ह्यांच्या पासून कृपा, दया व शांति असो.",
        "मी आपल्या प्रार्थनांत रात्रंदिवस तुझे स्मरण अखंड करितों आणि तुझे अश्रु मनांत आणून तुझ्या भेटीने मी आनंदभरित व्हावे म्हणून तुला भेटण्याची फार उत्कंठा बाळगितों, तुझ्यामध्ये असलेल्या निष्कपट विश्वासाची मला आठवण होऊन, ज्या देवाची माझ्या पूर्वजांपासून चालत आलेली सेवा मी शुद्ध विवेकभावानें करितों, त्याचे मी आभार  मानितों.  तो विश्वास पहिल्याने तुझी आजी लोईस हिच्या ठायी होता, तुझी आई यूनीके हिच्या ठायी होता; आणि तोच तुझ्याहि ठायी आहे असा मला भरवसा आहे.",
        "ह्या कारणास्तव मी तुला आठवण देतो की, देवाचे जे कृपादान माझे हात तुझ्यावर ठेविल्यामुळे तुझ्या ठायी आहे. ते प्रज्वलित कर  कारण देवाने आपल्याला भित्रेपणाचा नव्हे, तर सामर्थ्याचा प्रीतीचा व संयमनाचा आत्मा दिला आहे म्हणून आपल्या प्रभू विषयीच्या साक्षीची आणि मी जो त्याचा बंदिवान् त्या माझी तूं लाज धरू नये, तर देवाच्या सामर्थ्याच्या परिमाणाने सुवार्तेसाठी माझ्याबरोबर दुःख सोसावें."
      ],
      "acclamation": "प्रभूचा शब्द",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद  स्तोत्र  ९६:१-३,७-१०",
      "reference": "प्रतिसाद  स्तोत्र  ९६:१-३,७-१०",
      "verses": [
        "प्रतिसाद :   सर्व लोकांमध्ये त्याची अद्भुतकृत्यें जाहीर करा.",
        "१) परमेश्वराचे  गुणगान नवे गीत गाऊन करा.",
        "हे सर्व पृथ्वी, परमेश्वराचें गुणगान कर.",
        "परमेश्वराचे गुणगान करा, त्याच्या नांवाचा धन्यवाद करा ;",
        "त्याने केलेल्या तारणाची घोषणा प्रति दिवशी करा.",
        "२) राष्ट्रामध्ये त्याचें गौरव, सर्व लोकांमध्ये",
        "त्याची अद्भुतकृत्यें जाहीर करा.",
        "अहो मानवकुलांनो, परमेश्वराचें गौरव करा :",
        "परमेश्वराचें गौरव करा व त्याचे सामर्थ्य वाखाणा.",
        "३)परमेश्वराच्या नांवाची थोरवी गा;",
        "अर्पण घेऊन त्याच्या अंगणांत या;",
        "पवित्रतेच्या शोभेनें परमेश्वराची उपासना करा ;",
        "हे सर्व पृथ्वी त्याच्यापुढें कंपायमान हो.",
        "४) राष्ट्रांमधील लोकांना विदित करा की,",
        "परमेश्वर राज्य करितो. जग स्थिर स्थापिलेले आहे,",
        "तें डळमळणार नाहीं.",
        "तो सरळपणें लोकांचा न्याय करील."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया !",
        "प्रभू म्हणतो,",
        "मी तुम्हांला निवडले व तुम्हांला नेमले आहे, ह्यात हेतू हा की, तुम्ही जाऊन फळ द्यावे आणि तुमचे फळ टिकावे.",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान लूक  १० : १-९",
      "reference": "शुभवर्तमान लूक  १० : १-९",
      "verses": [
        "वाचक :  लूक लिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "पिशवी, झोळी किंवा पायतण बरोबर घेऊं नका, वाटेनें कोणाला मुजरा करूं नका.",
        "ह्यानंतर प्रभूनें आणखी बहात्तर जणांस नेमून ज्या ज्या नगरांत व ज्या ज्या ठिकाणीं तो स्वतः जाणार होता तेथे दोघे दोघे असे त्यांना आपणापुढे पाठविलें.  तेव्हां त्यानें त्यांना म्हटले, पीक फार आहे परंतु कामकरी थोडे आहेत; म्हणून पिकाच्या धन्याने आपल्या पिकासाठी कामकरी पाठवावे म्हणून त्याची प्रार्थना करा.  जा; लांडग्यांमध्ये कोंकरें तसें तुम्हांस मी पाठवीत आहे, पाहा.पिशवी, झोळी किंवा पायतण बरोबर घेऊं नका, वाटेनें कोणाला मुजरा करूं नका. ज्या कोणत्या घरांत जाल तेथें, ह्या घरास शांति असो, असें प्रथम म्हणा.  तेथें कोणी शांतिप्रिय माणूस असला तर तुमची शांति त्याच्यावर राहील; नसला तर तुम्हांकडे ती परत येईल.  त्याच घरांत वस्ती करून ते जें देतील तें खातपीत राहा, कारण कामकरी आपल्या मजुरीला योग्य आहे. घरें बदलू नका.  कोणत्याहि नगरांत तुम्ही गेला आणि त्यांनी तुमचें स्वागत केलें तर ते जें तुम्हांस वाढतील तें खा.  त्यांत जे दुखणाईत असतील त्यांना बरें करा व त्यांना सांगा की, देवाचें राज्य तुमच्याजवळ आले आहे."
      ],
      "acclamation": "प्रभूचे हे शुभवर्तमान",
      "response": "सर्व : हे ख्रिस्ता  तुझी स्तुती असो."
    }
  ]
}