{
  "date": "2026-01-13",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-tuesday-13th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन शमुवेल १:९-२०",
      "reference": "पहिले वाचन शमुवेल १:९-२०",
      "verses": [
        "वाचक :शमुवेलच्या पहिल्या पुस्तकातून घेतलेले वाचन",
        "“परमेश्वराला हन्नाची आठवण होती आणि तिने शमुवेलला जन्म दिला. \"",
        "शिलो येथे जेवण आटोपल्यावर हन्ना तेथून उठून गेली. त्या वेळेस एली याजक परमेश्वराच्या मंदिराच्या दारात आपल्या आसनावर बसला होता. तिने अत्यंत दुःखित अंतःकरणाने परमेश्वराची करुणा भाकली आणि ती ढसाढसा रडली. तिने नवस केला आणि म्हणाली, \"हे सेनाधीश परमेश्वरा, तुझ्या ह्या दासीला न विसरता पुत्रसंतान देण्याची कृपा करशील तर मी तो परमेश्वराला कायमचा वाहीन, त्याच्या डोक्याला वस्तरा लागणार नाही.\"",
        "ह्याप्रमाणे बराच वेळ तिची प्रार्थना चालली असताना एलीचे तिच्या मुखाकडे लक्ष होते. हन्ना मनातल्या मनात बोलत होती. तिच्या ओठांची हालचाल होत होती पण तिचे शब्द मात्र ऐकू येत नव्हते, त्यामुळे ती नशेत असावी असा एलीचा समज झाला. एली तिला म्हणाला, “कोठवर या नशेत राहणार तू ? हा दारूचा अंमल उतरू दे.\" \"नाही महाराज,” तिने उत्तर दिले. \"मी एक भग्नहृदयी स्त्री आहे. मी काही द्राक्षरस किंवा दारू प्याले नाही. परमेश्वरासमोर मी माझे मन मोकळे करीत होते. आपल्या दासीला कुचकामी स्त्री समजू नका. चिंता अनावर झाल्यामुळे आणि शोकावेगाने मी इतका वेळ बोलत होते.\" तेव्हा एली तिला म्हणाला, \"तू शांतीने जा. इस्राएलच्या देवाकडे तू केलेली याचना तो पुरी शांतीने जा. इस्राएलच्या देवाकडे तू केलेली याचना तो पुरी करो.\" ती त्याला म्हणाली, “ह्या दासीवर आपली कृपादृष्टी असू द्या.\" मग ती तेथून निघून गेली आणि जेवली. त्यानंतर तिचा चेहरा उदास राहिला नाही.",
        "दुसऱ्या दिवशी पहाटेस सर्वजण उठले आणि परमेश्वराची उपासना करून रामा येथील आपल्या घरी गेले. एलकाना आणि त्याची बायको हन्ना ह्यांची परमेश्वराला आठवण होती. नंतर हन्नाला दिवस गेले आणि यथासमयी तिला मुलगा झाला, \"तो परमेश्वराकडून मागून घेतलेला होता.\" म्हणून तिने त्याचे नाव शमुवेल असे ठेवले."
      ],
      "acclamation": "प्रभूचा शब्द",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद  स्तोत्र  १शमुवेल २:१,४-५, ६-७,८",
      "reference": "प्रतिसाद  स्तोत्र  १शमुवेल २:१,४-५, ६-७,८",
      "verses": [
        "प्रतिसाद :  प्रभूठायी माझे मन उल्हासले आहे.",
        "१ )प्रभूठायी माझे मन उल्हासले आहे,",
        "प्रभूठायी मला सामर्थ्य प्राप्त झाले आहे.",
        "माझे मुख माझ्या शत्रूंचा धिक्कार करीत आहे,",
        "कारण तू केलेल्या उद्धाराने मला आनंद होत आहे.",
        "२) \"शूर वीरांची धनुष्ये भंगून गेली आहेत,",
        "पण दुर्बळांना नवीन सामर्थ्य देण्यात आले आहे.",
        "जे पोटभर खात होते ते भाकरीच्या तुकड्यासाठी",
        "मोलमजुरी करीत आहेत, पण जे भुकेले होते",
        "ते तृप्त झाले आहेत. वंध्येने सातांना जन्म दिला आहे,",
        "पण बहुपुत्रवती झुरणीस लागली आहे.\"",
        "३) “परमेश्वर प्राणहरण करतो आणि जीवदानही देतो,",
        "तो अधोलोकी पाठवतो आणि ऊर्ध्वलोकीही आणतो.",
        "परमेश्वर निर्धन करतो तसाच सधनही करतो,",
        "तो खाली ओढतो तसाच वरही उचलतो.\"",
        "४) \"तो कंगालांना धुळीतून उठवतो,",
        "तो दरिद्र्यांना उकिरड्यावरून उचलून उभे करतो,",
        "मग ते सरदारांच्या शेजारी बसतात",
        "आणि वैभवी सिंहासन त्यांना प्राप्त होते.\""
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया!",
        "हे परमेश्वरा, तुझा मार्ग मला दाखव. मला सरळ मार्गाने ने",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान  मार्क १:२१-२८",
      "reference": "शुभवर्तमान  मार्क १:२१-२८",
      "verses": [
        "वाचक :   मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "“येशूने अधिकारयुक्त वाणीने त्यांना शिकवले.\"",
        "येशू आणि त्याचे शिष्य कफर्णहूमास गेले आणि लागलेच त्याने शब्बाथ दिवशी सभास्थानात जाऊन शिक्षण दिले. त्याच्या शिकवणीवरून लोक थक्क झाले, कारण तो त्यांना शास्त्री लोकांसारखा नव्हे तर अधिकार असल्यासारखा शिकवीत होता. त्याचवेळी त्यांच्या सभास्थानात अशुद्ध आत्मा लागलेला एक मनुष्य होता, तो ओरडून म्हणाला “हे येशू नाझरेथकरा तू आमच्यामध्ये का पडतोस? आमचा नाश करावयास आलास काय ? तू कोण आहेस हे मला ठाऊक आहे, देवाचा पवित्र तो तूच.” परंतु येशूने त्याला धमकावून म्हटले, “गप्प राहा आणि ह्याच्यातून नीघ. तेव्हा अशुद्ध आत्मा त्याला पिळून मोठ्याने ओरडला आणि त्याच्यातून निघून गेला. तेव्हा ते सर्व इतके थक्क झाले की ते एकमेकांस विचारू लागले, “हे आहे तरी काय? काय ही अधिकारयुक्त नवीन शिकवण! हा अशुद्ध आत्म्यांनाही आज्ञा करतो आणि ते त्याचे ऐकतात.\" ही त्याची कीर्ती लागलीच गालिलाच्या चहूकडल्या सर्व प्रांतात पसरली."
      ],
      "acclamation": "प्रभूचे हे शुभवर्तमान",
      "response": "सर्व : हे ख्रिस्ता  तुझी स्तुती असो."
    }
  ]
}