{
  "date": "2026-01-21",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-wednesday-21st.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन  १ शमुवेल १७:३२-३३,३७,४०-५१",
      "reference": "पहिले वाचन  १ शमुवेल १७:३२-३३,३७,४०-५१",
      "verses": [
        "वाचक :शमुवेलच्या पहिल्या पुस्तकातून घेतलेले वाचन",
        "“दावीदने गोफणगुंडा घेऊन त्या पलिष्ट्यावर सरशी केली. \" दावीद शौलला म्हणाला, \"त्या पलिष्ट्यामुळे कोणीही माणसाने मन कचरू नये, आपला हा दास जाऊन त्याच्याशी लढेल.\" शौल दावीदला म्हणाला, \"ह्या पलिष्ट्याशी लढण्यास तू समर्थ नाहीस, कारण तू केवळ तरुण आहेस आणि तो बाळपणापासून कसलेला योद्धा आहे.\" दावीद आणखी म्हणाला, “ज्या परमेश्वराने मला सिंहाच्या आणि अस्वलाच्या पंजांतून सोडवले तोच मला ह्या पलिष्ट्याच्या हातातून सोडवील.\" तेव्हा शौल दावीदला म्हणाला, “जा, परमेश्वर तुझ्याबरोबर असो!\" मग त्याने आपली काठी हाती घेतली, ओहोळातून पाच गुळगुळीत गोटे वेचून आपल्या थैलीत म्हणजे धनगरी बटव्यात ठेवले आणि आपली गोफण हाती घेऊन तो त्या पलिष्ट्याकडे गेला.",
        "तिकडे तो पलिष्टीही दावीदच्या जवळ आला. त्याचा शस्त्रवाहक त्याच्यापुढे चालत होता. त्या पलिष्ट्याने दावीदला न्याहाळून पाहिले तेव्हा तो त्याला तुच्छ वाटला, तो केवळ अल्पवयी असून तांबूस रंगाचा आणि सुकुमार होता. तो पलिष्टी दावीदला म्हणाला, “मी काय कुत्रा आहे म्हणून तू काठी घेऊन माझ्यापुढे आला आहेस?\" त्या पलिष्ट्याने आपल्या देवांची नावे घेऊन दावीदला शिव्याशाप दिले. तो दावीदला म्हणाला, “असा जवळ ये म्हणजे तुझे मांस आकाशातील पक्ष्यांस आणि वनपशूंस देतो.\" तेव्हा दावीद त्या पलिष्ट्याला म्हणाला, “तू तरवार, भाला आणि बरची घेऊन माझ्यावर चालून आला आहेस; पण इस्राएली सैन्यांच्या देवाला तू तुच्छ लेखले आहेस, त्या सेनाधीश परमेश्वराच्या नामाने मी तुझ्याकडे आलो आहे. आज परमेश्वर तुला माझ्या हाती देईल, मी तुझा वध करीन आणि तुझे शीर धडापासून वेगळे करीन. मी आज पलिष्टी सैनिकांची प्रेते आकाशातील पक्ष्यांस आणि वनपशूंस देईन; तेव्हा इस्राएलमध्ये देव आहे असे अखिल पृथ्वीला विदित होईल आणि या सगळ्या समुदायाला कळून येईल की, परमेश्वर तरवारीने आणि भाल्याने विजयी होतो असे नाही; कारण हे युद्ध परमेश्वराचे आहे, तो तुम्हांला आमच्या हाती देईल.\"",
        "मग तो पलिष्टी उठून दावीदशी सामना करण्यासाठी जवळ आला, तेव्हा दावीद त्या पलिष्ट्याशी सामना करण्यासाठी सैन्य होते त्या दिशेकडे त्वरेने धावला. दावीदने आपल्या बटव्यात हात घालून त्यातून एक गोटा घेऊन गोफणीत घातला आणि ती गरगर फिरवून पलिष्ट्याच्या मस्तकावर असा मारला की, तो त्याच्या कपाळात घुसून तो जमिनीवर पालथा पडला. या प्रकारे दावीदने गोफणगुंडा घेऊन त्या पलिष्ट्यावर सरशी केली आणि त्याचा वध केला; दावीदच्या हाती तरवार नव्हती. दावीदने धावत जाऊन त्या पलिष्ट्याच्या छातीवर पाय दिला आणि त्याचीच तरवार म्यानांतून काढून त्याला ठार करून त्याचे शीर छेदले. आपला महावीर गतप्राण झाला हे पाहून पलिष्टी पळून गेले."
      ],
      "acclamation": "प्रभूचा शब्द",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद  स्तोत्र   १४४:१-२,९-१०",
      "reference": "प्रतिसाद  स्तोत्र   १४४:१-२,९-१०",
      "verses": [
        "प्रतिसाद :  परमेश्वर जो माझा दुर्ग त्याला माझा धन्यवाद असो.",
        "१) परमेश्वर जो माझा दुर्ग त्याला माझा धन्यवाद असो;",
        "तो माझ्या बाहूंना युद्ध करावयास शिकवतो,",
        "माझ्या हातांना लढावयास शिकवतो.",
        "२) तो माझा दयानिधी, माझा दुर्ग, माझा गड,",
        "माझा मुक्तिदाता, माझी ढाल आहे;",
        "मी त्याचा आश्रय धरतो.",
        "तो माझ्या प्रजाजनांना माझे अंकित करतो.",
        "३) हे देवा, मी तुला नवे गीत गाईन,",
        "दशतंतू वीणेवर मी तुझे स्तोत्र गाईन.",
        "तूच राजांना विजय देणारा आहेस,",
        "तूच आपला सेवक दावीद ह्याला मुक्त करणारा आहेस.."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया!",
        "हे येरुशलेमे, प्रभूचे गुणगान गा, तो आपले आदेश पृथ्वीवर पाठवतो.",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान  मार्क३:१-६",
      "reference": "शुभवर्तमान  मार्क३:१-६",
      "verses": [
        "वाचक :   मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "\"शब्बाथ दिवशी जीव वाचवणे सशास्त्र आहे काय ?\"",
        "येशू सभास्थानात गेला. तेथे वाळलेल्या हाताचा एक माणूस होता आणि त्याच्यावर दोष ठेवावा म्हणून शब्बाथ दिवशी तो त्याला बरे करतो की काय हे पाहावयास ते टपून बसले होते. तेव्हा त्याने हात वाळलेल्या माणसाला म्हटले, “असा पुढे ये.\" मग तो त्यांना म्हणाला, “शब्बाथ दिवशी बरे करणे किंवा वाईट करणे, जीव वाचवणे किंवा जीव घेणे, ह्यातून कोणते सशास्त्र आहे ?\" पण ते उगेच राहिले. मग त्याने त्यांच्या अंतःकरणाच्या कठीणपणामुळे खिन्न होऊन त्या सर्वांकडे रागाने पाहिले आणि त्या माणसाला म्हटले, “हात लांब कर.\" त्याने हात लांब केला आणि तो बरा झाला. मग परुशी बाहेर जाऊन येशूचा घात कसा करावा ह्याविषयी लागलीच हेरोदियांबरोबर त्याच्याविरुद्ध मसलत करीत बसले."
      ],
      "acclamation": "प्रभूचे हे शुभवर्तमान",
      "response": "सर्व : हे ख्रिस्ता  तुझी स्तुती असो."
    }
  ]
}