{
  "date": "2026-01-29",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-thursday-29th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन २ शमुवेलच्या  ७:१८-१९,२४-२९",
      "reference": "पहिले वाचन २ शमुवेलच्या  ७:१८-१९,२४-२९",
      "verses": [
        "वाचक :शमुवेलच्या दुसऱ्या पुस्तकातून घेतलेले वाचन",
        "\"हे प्रभो देवा, मी कोण आणि माझे घराणे ते काय ?\"",
        "दावीद राजा आत जाऊन परमेश्वरासमोर बसून म्हणाला, \"हे प्रभो देवा, मी कोण आहे आणि माझे घराणे ते काय की तू मला येथवर आणावे ? हे प्रभो परमेश्वरा, तुझ्या दृष्टीने ही केवळ शुल्लक गोष्ट आहे, तू आपल्या सेवकाच्या घराण्यासंबंधाने पुढील बऱ्याच काळाचे सांगून ठेवले आहे, प्रभो परमेश्वरा, तू हे सर्व मानवी व्यवहारासारखे केले आहे.",
        "इस्राएल लोकांनी तुझी निरंतरची प्रजा व्हावे म्हणून तू त्यांची स्थापना केली. हे परमेश्वरा, तू त्यांचा देव झालास, तर आता हे प्रभो परमेश्वरा, आपला सेवक आणि त्याचे घराणे ह्याविषयी जे वचन तू दिले ते कायमचे सिद्धीस ने आणि आपल्या म्हणण्याप्रमाणे कर. 'सेनाधीश परमेश्वर इस्राएलवर सत्ताधीश आहे' असे म्हणून लोकांनी तुझ्या नावाचा निरंतर महिमा वाढवावा आणि तुझा सेवक दावीद ह्याचे घराणे तुझ्यासमोर स्थापित व्हावे. कारण, हे सेनाधीश परमेश्वरा, हे इस्राएलच्या देवा, तू माझे कान उघडून सांगितले, 'मी तुझे घराणे स्थापीन.' म्हणून ही विनंती करावयाची हिंमत तुझ्या सेवकाला झाली. आता हे प्रभो परमेश्वरा, तूच देव आहेस आणि तुझी वचने सत्य आहेत आणि तू आपल्या सेवकाचे अशा प्रकारे बरे करण्याविषयी वचन दिले आहेस. तर आता प्रसन्न होऊन आपल्या सेवकाच्या घराण्याला असा आशीर्वाद दे की, ते तुझ्या दृष्टीसमोर निरंतर कायम राहील. कारण हे प्रभो परमेश्वरा, तू हे म्हटले आहे; तुझ्या सेवकाच्या घराण्याचे तुझ्या आशीर्वादाने सदा अभीष्ट होवो."
      ],
      "acclamation": "हा प्रभूचा शब्द आहे.",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद स्तोत्र १३२:१-५,११-१४",
      "reference": "प्रतिसाद स्तोत्र १३२:१-५,११-१४",
      "verses": [
        "प्रतिसाद :  प्रभू देव त्याला त्याचा पूर्वज दावीद ह्याचे राजासन देईल. लूक १:३२",
        "१) हे परमेश्वरा, दावीदचे आणि",
        "त्याच्या सर्व कष्टांचे स्मरण कर.",
        "त्याने परमेश्वराजवळ शपथ वाहिली,",
        "याकोबच्या समर्थ देवाला नवस केला.",
        "२) “मी आपल्या राहण्याच्या तंबूत जाणार नाही,",
        "आपल्या अंथरुणावर पडणार नाही.",
        "मी आपल्या डोळ्यांवर झोप,",
        "आणि आपल्या पापण्यांवर सुस्ती येऊ देणार नाही;",
        "परमेश्वरासाठी स्थान, आणि",
        "याकोबच्या समर्थ देवासाठी",
        "निवासमंडप मिळवीपर्यंत मी असेच करीन.\"",
        "३) परमेश्वराने दावीदजवळ शपथ वाहिली आहे,",
        "तो माघार घेणार नाही. ती शपथ अशी.",
        "“तुझ्या पोटचे फळ, तुझा पुत्र ह्याला",
        "मी तुझ्या राजासनावर बसवीन.\"",
        "४)“जर तुझी मुले माझा करार आणि",
        "मी त्यांना शिकवलेले नियम सत्याने पाळतील,",
        "तर त्यांचीही मुले पिढ्यानुपिढ्या",
        "तुझ्या राजासनावर सदैव बसतील.\"",
        "५) परमेश्वराने सियोनची निवड केली आहे,",
        "आपल्या निवासासाठी त्याला",
        "सियोन आवडले आहे:",
        "\"हे सर्वकाळ माझे विश्रामस्थान आहे,",
        "येथे मी राहण्याचे निवडले आहे.\""
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया !",
        "देवाचे वचन स्वीकारा, ते माणसांचे म्हणून नव्हे तर देवाचे म्हणून स्वीकारा आणि वास्तविक ते असेच आहे.",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान  मार्क  ४:२१-२५",
      "reference": "शुभवर्तमान  मार्क  ४:२१-२५",
      "verses": [
        "वाचक :   मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "“दिवा दिवठणीवर ठेवावा म्हणून आणतात. ज्या मापाने तुम्ही मापून द्याल त्याच मापाने तुम्हांला मापून देण्यात येईल. \"",
        "येशू आपल्या शिष्यांना म्हणाला, “दिवा मापाखाली किंवा पलंगाखाली ठेवण्यासाठी आणतात काय? दिवठणीवर ठेवावा म्हणून आणतात ना? कारण उघडकीस येऊ नये अशा हेतूने काहीही झाकलेले नसते आणि प्रसिद्धीस येऊ नये अशा हेतूने काहीही गुप्त राखलेले नसते. कोणाला ऐकावयास कान आहेत तर तो ऐको.\" पुन्हा तो त्यांना म्हणाला, \"तुम्ही जे काही ऐकता त्याविषयी सावध राहा. ज्यामापाने तुम्ही मापून द्याल त्याच मापाने तुम्हाला मापून देण्यात येईल. किंबहुना तुम्हाला जास्तही देण्यात येईल. ज्याला आहे त्याला दिले जाईल आणि ज्याला नाही त्याचे असेल नसेल तेही त्याच्यापासून काढून घेतले जाईल.\""
      ],
      "acclamation": "प्रभूचे हे शुभवर्तमान",
      "response": "सर्व : हे ख्रिस्ता  तुझी स्तुती असो."
    }
  ]
}