{
  "date": "2026-01-24",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-saturday-24th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन  २ शमुवेल १:१-४,११-१२,,१७,१९,२३-२७",
      "reference": "पहिले वाचन  २ शमुवेल १:१-४,११-१२,,१७,१९,२३-२७",
      "verses": [
        "वाचक :शमुवेलच्या दुसऱ्या  पुस्तकातून घेतलेले वाचन",
        "\"रणभूमीवर बलाढ्य कसे पतन पावले आहेत ते पाहा.\"",
        "शौलच्या मृत्यूनंतर आणि दावीद अमालेक्यांचा संहार करून परत येऊन सिक्लाग येथे दोन दिवस राहिल्यावर, तिसऱ्या दिवशी शौल होता त्या छावणीतून एक माणूस आला; त्याने आपले कपडे फाडले होते आणि डोक्यात धूळ घातली होती. तो दावीदपाशी येऊन पोहचल्यावर त्याने त्यांस साष्टांग दंडवत घातले. दावीदने त्याला विचारले, \"तू कोठून आलास?\" तो त्यांस म्हणाला, \"मी इस्राएलच्या छावणीतून निसटून आलो आहे.\" दावीदने त्यास विचारले, \"कसे काय वर्तमान आहे ? मला सांग बरे.\" तो म्हणाला, “लोक रणभूमीवरून पळाले, पुष्कळ लोक पडले आणि प्राणास मुकले शौल आणि त्यांचा पुत्र योनाथान हेही प्राणांस मुकले.",
        "हे ऐकून दावीदने आपली वस्त्रे धरून फाडली आणि जितके लोक त्याच्याबरोबर होते त्यांनीही तसेच केले. शौल, त्याचा पुत्र योनाथान, परमेश्वराचे लोक आणि इस्राएलचे घराणे ही तरवारीने पडली म्हणून त्यांच्याबद्दल त्यांनी शोक केला, विलाप केला आणि संध्याकाळपर्यंत ते उपाशी राहिले. मग दावीदने शौल आणि त्याचा पुत्र योनाथान यांच्यासंबंधाने पुढील विलापगीत गाईले:",
        "\"हे इस्राएल, तुझ्या शिरोमणीचा उच्च स्थानी वध केला आहे! बलाढ्य पाहा कसे पतन पावले आहेत ! शौल आणि योनाथान प्रेमळ आणि मनमिळाऊ असत! जीवनात आणि मरणात त्यांचा वियोग झाला नाही; ते गरुडांहून वेगवान आणि सिंहांहून बलवान होते. इस्राएली कन्यांनो, शौलसाठी रुदन करा, तो तुम्हांला किरमिजी वस्त्रे लेववून शृंगारीत असे,",
        "तो तुमच्या वस्त्रांवर सोन्याचे अंलकार घालीत असे. \"पाहा, रणभूमीवर बलाढ्य कसे पतन पावले आहेत!\" “योनाथान, तुझा उच्च स्थानी वध केला गेला आहे.\" “माझा बंधू, योनाथान, मी तुझ्याकरिता विव्हळ होत आहे; तू माझ्यावर फार माया करत होतास. तुझे माझ्यावर विलक्षण प्रेम होते, स्त्रियांच्या प्रेमाहूनही ते अधिक होते.\" \"पाहा बलाढ्य कसे पतन पावले आहेत, युद्धाची शस्त्रे कशी नाश पावली आहेत!\""
      ],
      "acclamation": "प्रभूचा शब्द",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद  स्तोत्र  ८०:२-३,५-७",
      "reference": "प्रतिसाद  स्तोत्र  ८०:२-३,५-७",
      "verses": [
        "प्रतिसाद :  हे देवा, आपला मुखप्रकाश आमच्यावर पाड म्हणजे आमचे तारण होईल.",
        "१) हे इस्राएलच्या मेंढपाळा, योसेफचा कळप चालवणाऱ्या,",
        "माझी वाणी ऐक. जो तू करुबारूढ आहेस",
        "तो तू आपले तेज एफ्राईम,",
        "बन्यामीन आणि मनश्शे ह्यांच्यासमक्ष प्रकट कर.",
        "हे प्रभो, तू आपला पराक्रम दाखव,",
        "हे प्रभो, आमच्या सहाय्याला ये.",
        "२) हे परमेश्वरा, सेनाधीश देवा,",
        "तुझे लोक प्रार्थना करीत असता",
        "तू कोठवर कोपायमान राहणार ?",
        "तू त्यांना अश्रुरुप अन्न खावयास दिले आहे,",
        "आणि त्यांना माप पुरे भरून आसवे",
        "प्यावयास दिली आहेत. तू आम्हांला आमच्या शेजाऱ्यांच्या",
        "चेष्टेला कारण करतोस,",
        "आमचे वैरी आमचा यथेच्छ उपहास करतात."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया!",
        "ज्याची माझ्यावर प्रीती असेल तो माझे वचन पाळील, माझा पिता त्याच्यावर प्रीती करील आणि आम्ही त्याच्याकडे येऊ.",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान  मार्क ३:२०-२१",
      "reference": "शुभवर्तमान  मार्क ३:२०-२१",
      "verses": [
        "वाचक :   मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "“त्याला वेड लागले आहे, असे येशूच्या आप्तांचे म्हणणे होते. \"",
        "येशू घरी आला. तेव्हा पुन्हा इतके लोक जमले की, त्यांना जेवायलाही सवड होईना. हे पाहून त्याचे आप्त त्याला धरायला निघाले, कारण \"त्याला वेड लागले आहे \"असे त्याचे म्हणणे होते."
      ],
      "acclamation": "प्रभूचे हे शुभवर्तमान",
      "response": "सर्व : हे ख्रिस्ता  तुझी स्तुती असो."
    }
  ]
}