{
  "date": "2026-01-19",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-monday-19th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन  १ शमुवेल १५:१६-२३",
      "reference": "पहिले वाचन  १ शमुवेल १५:१६-२३",
      "verses": [
        "वाचक :शमुवेलच्या पहिल्या पुस्तकातून घेतलेले वाचन",
        "\"पाहा, यज्ञापेक्षा आज्ञा पाळणे बरे. परमेश्वराने तुला राज्यपदावरून झुगारून दिले आहे.\"",
        "शमुवेल शौलला म्हणाला, \"पुरे कर! परमेश्वर मला रात्री काय म्हणाला ते मी तुला सांगतो.\" तो म्हणाला, \"सांगा.\" शमुवेल म्हणाला, \"तू आपल्या दृष्टीने क्षुद्र होतास तरी तुला इस्राएल कुळांचा नायक केले ना? आणि तू इस्राएलचा राजा व्हावे म्हणून परमेश्वराने तुला अभिषेक केला ना? मग परमेश्वराने तुला मोहिमेवर पाठवून सांगितले, 'जा, त्या पापिष्ठ अमालेक्यांचा सर्वस्वी नाश कर आणि त्यांचा संहार होईपर्यंत त्यांच्याशी युद्ध कर.' असे असता तू परमेश्वराचा शब्द का ऐकला नाही? तू लुटीवर झडप घालून परमेश्वराच्या दृष्टीने जे वाईट ते का केलेस ?\" शौल शमुवेलला म्हणाला, “मी तर परमेश्वराचा शब्द पाळला आहे, परमेश्वराने मला पाठवले त्या मार्गाने मी गेलो आणि अमालेक्यांचा अगदी संहार करून त्यांचा राजा अगाग यास घेऊन आलो आहे. मात्र ज्या लुटीचा नाश करावयाचा होता तीतून लोकांनी उत्तम उत्तम वस्तू म्हणजे मेंढरे आणि गुरे ही तुझा देव परमेश्वर यास गिलगाल येथे यज्ञ करण्यासाठी राखून ठेवली आहेत.\"",
        "तेव्हा शमुवेल म्हणाला, \"परमेश्वराचा शब्द पाळल्याने जसा त्याला संतोष होतो तसा होमांनी आणि यज्ञांनी होतो काय? पाहा, यज्ञापेक्षा आज्ञा पाळणे बरे, एडक्यांच्या चरबीपेक्षा देवाचे वचन ऐकणे बरे. अवज्ञा जादुगिरीच्या पातकासमान आहे आणि हट्ट हा मूर्तिपूजा आणि कुलदेवतार्चन यांसारखा आहे. तू परमेश्वराचा शब्द मोडला आहे म्हणून त्याने तुला राज्यपदावरून झुगारून दिले आहे.\""
      ],
      "acclamation": "हा प्रभूचा शब्द आहे",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद  स्तोत्र  ५०:८-९,१६-१७,२१,२३",
      "reference": "प्रतिसाद  स्तोत्र  ५०:८-९,१६-१७,२१,२३",
      "verses": [
        "प्रतिसाद :जो सरळ मार्गाने चालतो त्याला मी तारण प्राप्त करून देईन.",
        "१) तुझ्या यज्ञासंबधांने तर मी तुला बोल लावीत नाही,",
        "तुझे होमबली माझ्यापुढे नित्य आहेतच.",
        "तुझ्या घरचे गोऱ्हे किंवा तुझ्या मेंढवाड्यातले",
        "बोकड मी घेणार नाही.",
        "२) माझे नियम विदित करणारा तू कोण ?",
        "माझा करार आपल्या मुखाने उच्चारणारा तू कोण ?",
        "तू तर शिस्तीचा द्वेष करतोस,",
        "माझी वचने मागे झुगारून देतोस.",
        "३) असे तू केले तरी मी उगा राहू काय ?",
        "मी तुझ्यासारखाच आहे असे तुला वाटते काय ?",
        "जो आभाररूपी यज्ञ करतो तो माझा गौरव करतो",
        "आणि जो सरळ मार्गाने चालतो त्याला",
        "मी देवाने सिद्ध केलेले तारण प्राप्त करून देईन."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया!",
        "माझा जीव परमेश्वराची अपेक्षा करतो, मी त्याच्या वचनाची आशा धरतो",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान  मार्क २:१८-२२",
      "reference": "शुभवर्तमान  मार्क २:१८-२२",
      "verses": [
        "वाचक :   मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "\"वऱ्हाड्यांबरोबर वर आहे.\"",
        "एके दिवशी योहानचे शिष्य आणि परुशी उपास करीत होते, तेव्हा लोक येऊन येशूला म्हणाले, “योहानचे शिष्य आणि परुश्यांचे शिष्य उपास करतात पण आपले शिष्य उपास करत नाहीत, ह्यांचे कारण काय ?\" येशू त्यांना म्हणाला, “वहऱ्हाड्यांबरोबर वर आहे तोपर्यंत उपास करणे त्यांना शक्य आहे काय ? त्यांच्याबरोबर वर आहे तोपर्यंत त्यांना उपास करणे शक्य नाही. तरी असे दिवस येतील की, त्यांच्यापासून वर काढून घेतला जाईल, तेव्हा त्या दिवसांत ते उपास करतील. कोणी कोऱ्या कपडाचे ठिगळ जुन्या वस्त्राला लावत नाही, लावले तर धड करण्याकरिता लावलेले ठिगळ त्याला म्हणजे जुन्याला फाडते आणि छिद्र मोठे होते. कोणी नवा द्राक्षारस जुन्या बुधल्यात घालत नाही; घातला तर नव्या द्राक्षारसाने बुधले फुटतात, द्राक्षारस सांडतो आणि बुधलेही निकामी होतात; म्हणून नवा द्राक्षारस नव्याच बुधल्यात घालतात.\""
      ],
      "acclamation": "प्रभूचे हे शुभवर्तमान",
      "response": "सर्व : हे ख्रिस्ता  तुझी स्तुती असो."
    }
  ]
}