{
  "date": "2026-01-27",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-tuesday-27th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन २ शमुवेल ६:१२ब-१५.१७-१९",
      "reference": "पहिले वाचन २ शमुवेल ६:१२ब-१५.१७-१९",
      "verses": [
        "वाचक :शमुवेलच्या दुसऱ्या  पुस्तकातून घेतलेले वाचन",
        "\"दावीदने आणि इस्त्राएलच्या सर्व लोकांनी परमेश्वराचा कोश मोठ्या आनंदाने आणला.\"",
        "दावीदने जाऊन देवाचा कोश ओबेद-अदोमाच्या घरून दावीदपुरास मोठ्या आनंदाने आणला. परमेश्वराचा कोश उचलणारे सहा पावले चालून गेले तेव्हा दावीदने एक बैल आणि एक पुष्ट गोहा ह्यांचा यज्ञ केला. दावीद सणाचे एफोद कमरेस वेष्टून परमेश्वरासमोर आवेशाने नृत्य करीत चालला. दावीदने आणि सर्व इस्राएल लोकांनी परमेश्वराचा कोश जयजयकार करीत आणि शिंगे फुंकीत वर आणला.",
        "लोक परमेश्वराचा कोश नगरात घेऊन आले आणि त्याच्या स्थानी म्हणजे जो तंबू दावीदने त्याच्यासाठी उभा केला होता त्यात त्यांनी तो ठेवला; तेव्हा दावीदने परमेश्वराला होमबली आणि शांतिदानार्पणे अर्पिली. होमबली आणि शांतिदानार्पणे केल्यावर दावीदने सेनाधीश परमेश्वर याच्या नावाने लोकांना आशीर्वाद दिला. मग त्याने सर्व प्रजेस म्हणजे इस्राएलच्या समुदायातील प्रत्येक स्त्रीपुरुषास एकएक भाकर, मांसाचा एकएक तुकडा, खिसमिसाची एकएक ढेप अशी वाटून दिली. मग सर्व लोक आपआपल्या घरी गेले."
      ],
      "acclamation": "हा प्रभूचा शब्द आहे.",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद  स्तोत्र २४:७,८,९,१०",
      "reference": "प्रतिसाद  स्तोत्र २४:७,८,९,१०",
      "verses": [
        "प्रतिसाद :   हा प्रतापशाली राजा कोण ? हा, परमेश्वर, हाच प्रतापशाली राजा होय.",
        "१ अहो वेशींनो, आपल्या कमानी उंच करा; पुरातन दारांनो, उंच व्हा.",
        "प्रतापशाली राजाला आत येऊ द्या!",
        "२हा प्रतापशाली राजा कोण ?",
        "बलवान आणि पराक्रमी परमेश्वर, युद्धात पराक्रमी परमेश्वर तोच.",
        "३अहो वेशींनो, आपल्या कमानी उंच करा;",
        "पुरातन दारांनो, उंच व्हा. प्रतापशाली राजाला आत येऊ द्या !",
        "४ हा प्रतापशाली राजा कोण ?",
        "हा सेनाधीश परमेश्वर, हाच प्रतापशाली राजा होय."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया!",
        "देव ख्रिस्तामध्ये स्वतःबरोबर जगाचा समेट करीत होता आणि त्याने आपल्याकडे समेटाचे वचन सोपवून दिले.",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान  मार्क  ३:३१-३५",
      "reference": "शुभवर्तमान  मार्क  ३:३१-३५",
      "verses": [
        "वाचक :   मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "\"जो कोणी देवाच्या इच्छेप्रमाणे वागतो तोच माझा भाऊ, तीच माझी बहीण आणि तीच माझी आई आहे.\"",
        "येशूची आई आणि त्याचे भाऊ आले आणि बाहेर उभे राहून त्यांनी निरोप पाठवून त्याला बोलावले. त्याच्याभोवती पुष्कळ लोक बसले होते. ते त्याला म्हणाले, \"पाहा, बाहेर आपली आई आणि आपले भाऊ आपले शोध करीत आहेत.\" त्याने त्यांना उत्तर दिले \"कोण माझी आई आणि माझे भाऊ ?\" मग जे त्याच्याभोवती बसले होते त्यांच्याकडे पाहून तो म्हणाला, \"पाहा, ही माझी आई आणि हे माझे भाऊ ! जो कोणी देवाच्या इच्छेप्रमाणे वागतो तोच माझा भाऊ, तीच माझी बहीण आणि तीच माझी आई.\""
      ],
      "acclamation": "प्रभूचे हे शुभवर्तमान",
      "response": "सर्व : हे ख्रिस्ता  तुझी स्तुती असो."
    }
  ]
}