{
  "date": "2026-01-30",
  "url": "https://marathibiblereading.blogspot.com/2026/01/marathi-bible-reading-friday-30th.html",
  "title": "Marathi Bible Reading",
  "feast": "",
  "readings": [
    {
      "type": "First Reading",
      "heading": "पहिले वाचन २ शमुवेलच्या  ११:१-१०,१३-१७",
      "reference": "पहिले वाचन २ शमुवेलच्या  ११:१-१०,१३-१७",
      "verses": [
        "वाचक :शमुवेलच्या दुसऱ्या पुस्तकातून घेतलेले वाचन",
        "“तू मला तुच्छ मानून उरिया ह्यांची पत्नी आपली बायको म्हणून घरात आणली आहेस.\"",
        "राजे लोक युद्धाच्या मोहिमेस जातात त्या समयी म्हणजे वर्षारंभी दावीदने यवाबास आणि त्याच्याबरोबर त्याचे नोकरचाकर आणि सर्व इस्राएल लोक यांना पाठवले; त्यांनी अम्मोन्यांचा संहार करुन राब्बा नगरास वेढा घातला, पण दावीद येरुशलेम येथेच राहिला.",
        "संध्याकाळच्या समयी दावीद पलंगावरून उठून राजमंदिराच्या गच्चीवर जाऊन फिरू लागला. तेव्हा एक स्त्री स्नान करताना त्याने तेथून पाहिली. ती स्त्री दिसावयाला फार सुंदर होती. मग दावीदने चाकर पाठवून त्या स्त्रीविषयी विचारपूस केली. तेव्हा कोणी म्हटले, “ती अलियमची कन्या आणि उरिया हित्ती याची बायको बथशेबा आहे.\" तेव्हा दावीदने जासूद पाठवून तिला बोलावून आणले. ती दावीदकडे आली. दावीदने तिच्याशी अतिप्रसंग केला. (ती आपल्या मासिक अशुद्धतेपासून शुद्ध झाली होती.) मग ती आपल्या घरी गेली. त्या स्त्रीला गर्भ राहिला. तेव्हा तिने दावीदला निरोप पाठवला की, \"मी गरोदर आहे.\"",
        "दावीदने यवाबला निरोप पाठवला, “उरिया हित्ती याला माझ्याकडे पाठवून द्या.\" तेव्हा त्याने त्यास दावीदकडे पाठवले. उरिया दावीदकडे आला तेव्हा त्याने त्याला यवाब आणि त्याचे लोक कसे काय आहेत आणि युद्ध कसे चालले आहे हे विचारले. मग दावीद उरियास म्हणाला, “आपल्या घरी जा आणि हातपाय धू.\" उरिया राजमंदिरातून निघाला आणि त्याच्या पाठोपाठ राजाने त्याला काही इनाम पाठवले. उरिया आपल्या स्वामीच्या इतर सर्व चाकरांबरोबर राजवाड्याच्या दारीच निजून राहिला, आपल्या घरी गेला नाही. “उरिया आपल्या घरी गेला नाही, हे दावीदने ऐकले तेव्हा दावीदने त्याला बोलाविले. त्याने येऊन त्याच्यासमोर खाणेपिणे केले आणि त्याला त्याने दारू पाजून मस्त केले. संध्याकाळ झाली तेव्हा तो आपल्या स्वामीच्या सेवकांबरोबर आपल्या पलंगावर निजायला गेला, पण घरी गेला नाही.",
        "सकाळी दावीदने यवाबच्या नावे पत्र लिहून ते उरियाच्या हाती पाठवले. त्या पत्रात लिहिले होते, “तुंबळ युद्धाच्या तोंडी उरियाला ठेवा आणि त्यास तेथेच सोडून मागे हटा. म्हणजे त्याला मार लागून तो मरेल. मग यवाबने नगराची चांगली टेहळणी करून जेथे शत्रूचे शूर योद्धे असल्याचे त्याला माहीत होते तेथे उरियाला नेमले. मग नगरातील सैनिकांनी बाहेर पडून यवाबशी युद्ध केले. तेव्हा दावीदच्या सेवकांपैकी काही मारले गेले, उरिया हित्ती हाही"
      ],
      "acclamation": "प्रभूचा शब्द",
      "response": "सर्व : देवाला धन्यवाद."
    },
    {
      "type": "Responsorial Psalm",
      "heading": "प्रतिसाद स्तोत्र ५१:३-७,१०-११",
      "reference": "प्रतिसाद स्तोत्र ५१:३-७,१०-११",
      "verses": [
        "प्रतिसाद :  कारण आम्ही पाप केले आहे.",
        "१) हे देवा, तू आपल्या वात्सल्याला अनुसरून माझ्यावर दया कर.",
        "तू आपल्या विपुल करुणेला अनुसरून माझे अपराध पुसून टाक.",
        "मला अधिकाधिक धुऊन माझा दोष काढून टाक,",
        "माझे पाप दूर करून मला निर्मळ कर.",
        "२) मी आपले अपराध जाणून आहे,",
        "माझे पाप माझ्यापुढे नित्य आहे.",
        "तुझ्याविरूद्ध, तुझ्याविरुद्धच मी पाप केले आहे,",
        "तुझ्या दृष्टीने जे वाईट ते मी केले आहे.",
        "३) म्हणून तू बोलशील तेव्हा न्यायी ठरशील",
        "आणि निवाडा करशील तेव्हा नि:स्पृह ठरशील.",
        "पाहा, मी जन्माचाच पापी आहे,",
        "माझ्या आईच्या गर्भधारणेपासून मी पापी आहे.",
        "४ )आनंदाचे आणि हर्षाचे शब्द माझ्या कानी पडू दे,",
        "म्हणजे तू मोडलेली माझी हाडे कंपायमान होतील.",
        "माझ्या पापांपासून तू आपले तोंड फिरव,",
        "माझे सर्व अपराध काढून टाक."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "जयघोष",
      "reference": "",
      "verses": [
        "आलेलुया, आलेलुया !",
        "आपला तारणारा ख्रिस्त येशू ह्याने मरण नाहीसे केले आणि सुवार्तेच्या द्वारे जीवन आणले.",
        "आलेलुया!"
      ]
    },
    {
      "type": "Gospel",
      "heading": "शुभवर्तमान  मार्क  ४:२६-३४",
      "reference": "शुभवर्तमान  मार्क  ४:२६-३४",
      "verses": [
        "वाचक :   मार्कलिखित पवित्र शुभवर्तमानातून घेतलेले वाचन",
        "\"माणूस जमिनीत बी टाकतो. तो झोपी गेला असता ते बी वाढते, पण हे कसे होते हे त्याला कळत नाही.\"",
        "येशू आपल्या शिष्यांना म्हणाला, “एखादा माणूस जमिनीत बी टाकतो, रात्री झोपी जातो, दिवसा उठतो आणि ते बी रुजते आणि वाढते पण हे कसे होते हे त्याला कळत नाही. जमीन आपोआप पीक देते. पहिल्याने अंकुर, मग कणीस, मग कणसात भरलेला दाणा. पीक तयार झाल्यावर तो लागलीच विळा घालतो, कारण कापणीची वेळ आली आहे. परमेश्वराचे राज्य असे आहे.”आणखी तो म्हणाला, “आपण देवाच्या राज्याला कशाची उपमा द्यावी अथवा कोणत्या दाखल्यात ते मांडावे ? ते मोहरीच्या दाण्यासारखे आहे. तो जमिनीत पेरतेवेळी पृथ्वीवरील सर्व दाण्यांमध्ये जरी बारीक असला तरी पेरल्यावर उगवून सर्व झाडाझुडपांमध्ये मोठा होतो आणि त्याला अशा मोठमोठ्या फांद्या फुटतात की आकाशातील पाखरांना त्याच्या सावलीत वस्ती करता येते.” असले पुष्कळ दाखले देऊन, त्याच्या ग्रहणशक्तीप्रमाणे तो त्यांना संदेश देत असे आणि दाखल्यावाचून तो त्यांच्यासमोर  बोलत नसे, तथापि एकान्ती तो आपल्या शिष्यांना सर्व काही समजावून सांगत असे."
      ],
      "acclamation": "प्रभूचे हे शुभवर्तमान",
      "response": "सर्व : हे ख्रिस्ता  तुझी स्तुती असो."
    }
  ]
}