{
  "date": "2026-06-21",
  "url": "https://www.catholicgallery.org/mass-reading/210626/",
  "title": "Daily Mass Readings for Sunday, 21 June 2026",
  "feast": "Twelfth Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Jeremiah 20: 10-13",
      "reference": "Jeremiah 20: 10-13",
      "verses": [
        "10 For I heard the reproaches of many, and terror on every side: Persecute him, and let us persecute him: from all the men that were my familiars, and continued at my side: if by any means he may be deceived, and we may prevail against him, and be revenged on him.",
        "11 But the Lord is with me as a strong warrior: therefore they that persecute me shall fall, and shall be weak: they shall be greatly confounded, because they have not understood the everlasting reproach, which never shall be effaced.",
        "12 And thou, O Lord of hosts, prover of the just, who seest the reins and the heart: let me see, I beseech thee, thy vengeance on them: for to thee I have laid open my cause.",
        "13 Sing ye to the Lord, praise the Lord: because he hath delivered the soul of the poor out of the hand of the wicked."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 69: 8-10, 14, 17, 33-35",
      "reference": "Psalms 69: 8-10, 14, 17, 33-35",
      "verses": [
        "R. (14c) Lord, in your great love, answer me.",
        "8 Because for thy sake I have borne reproach; shame hath covered my face.",
        "9 I am become a stranger to my brethren, and an alien to the sons of my mother.",
        "10 For the zeal of thy house hath eaten me up: and the reproaches of them that reproached thee are fallen upon me.",
        "R. Lord, in your great love, answer me.",
        "14 But as for me, my prayer is to thee, O Lord; for the time of thy good pleasure, O God. In the multitude of thy mercy hear me, in the truth of thy salvation.",
        "17 Hear me, O Lord, for thy mercy is kind; look upon me according to the multitude of thy tender mercies.",
        "R. Lord, in your great love, answer me.",
        "33 Let the poor see and rejoice: seek ye God, and your soul shall live.",
        "34 For the Lord hath heard the poor: and hath not despised his prisoners.",
        "35 Let the heavens and the earth praise him; the sea, and every thing that creepeth therein.",
        "R. Lord, in your great love, answer me."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Romans 5: 12-15",
      "reference": "Romans 5: 12-15",
      "verses": [
        "12 Wherefore as by one man sin entered into this world, and by sin death; and so death passed upon all men, in whom all have sinned.",
        "13 For until the law sin was in the world; but sin was not imputed, when the law was not.",
        "14 But death reigned from Adam unto Moses, even over them also who have not sinned after the similitude of the transgression of Adam, who is a figure of him who was to come.",
        "15 But not as the offence, so also the gift. For if by the offence of one, many died; much more the grace of God, and the gift, by the grace of one man, Jesus Christ, hath abounded unto many."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 15: 26b, 27a",
      "reference": "John 15: 26b, 27a",
      "verses": [
        "R. Alleluia, alleluia.",
        "26b, 27a The Spirit of truth will testify to me, says the Lord; and you also will identify.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 10: 26-33",
      "reference": "Matthew 10: 26-33",
      "verses": [
        "26 Therefore fear them not. For nothing is covered that shall not be revealed: nor hid, that shall not be known.",
        "27 That which I tell you in the dark, speak ye in the light: and that which you hear in the ear, preach ye upon the housetops.",
        "28 And fear ye not them that kill the body, and are not able to kill the soul: but rather fear him that can destroy both soul and body in hell.",
        "29 Are not two sparrows sold for a farthing? and not one of them shall fall on the ground without your Father.",
        "30 But the very hairs of your head are all numbered.",
        "31 Fear not therefore: better are you than many sparrows.",
        "32 Every one therefore that shall confess me before men, I will also confess him before my Father who is in heaven.",
        "33 But he that shall deny me before men, I will also deny him before my Father who is in heaven."
      ]
    }
  ]
}