{
  "date": "2026-06-04",
  "url": "https://www.catholicgallery.org/mass-reading/040626/",
  "title": "Daily Mass Readings for Thursday, 4 June 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Timothy 2: 8-15",
      "reference": "Second Timothy 2: 8-15",
      "verses": [
        "8 Be mindful that the Lord Jesus Christ is risen again from the dead, of the seed of David, according to my gospel.",
        "9 Wherein I labour even unto bands, as an evildoer; but the word of God is not bound.",
        "10 Therefore I endure all things for the sake of the elect, that they also may obtain the salvation, which is in Christ Jesus, with heavenly glory.",
        "11 A faithful saying: for if we be dead with him, we shall live also with him.",
        "12 If we suffer, we shall also reign with him. If we deny him, he will also deny us.",
        "13 If we believe not, he continueth faithful, he can not deny himself.",
        "14 Of these things put them in mind, charging them before the Lord. Contend not in words, for it is to no profit, but to the subverting of the hearers.",
        "15 Carefully study to present thyself approved unto God, a workman that needeth not to be ashamed, rightly handling the word of truth."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 25: 4-5ab, 8-9, 10 and 14",
      "reference": "Psalms 25: 4-5ab, 8-9, 10 and 14",
      "verses": [
        "R. (4) Teach me your ways, O Lord.",
        "4 Let all them be confounded that act unjust things without cause. shew, O Lord, thy ways to me, and teach me thy paths.",
        "5ab Direct me in thy truth, and teach me; for thou art God my Saviour.",
        "R. Teach me your ways, O Lord.",
        "8 The Lord is sweet and righteous: therefore he will give a law to sinners in the way.",
        "9 He will guide the mild in judgment: he will teach the meek his ways.",
        "R. Teach me your ways, O Lord.",
        "10 All the ways of the Lord are mercy and truth, to them that seek after his covenant and his testimonies.",
        "14 The Lord is a firmament to them that fear him: and his covenant shall be made manifest to them.",
        "R. Teach me your ways, O Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Second Timothy 1: 10",
      "reference": "Second Timothy 1: 10",
      "verses": [
        "R. Alleluia, alleluia.",
        "10 Our Savior Jesus Christ has destroyed death and brought life to light through the Gospel.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 12: 28-34",
      "reference": "Mark 12: 28-34",
      "verses": [
        "28 And there came one of the scribes that had heard them reasoning together, and seeing that he had answered them well, asked him which was the first commandment of all.",
        "29 And Jesus answered him: The first commandment of all is, Hear, O Israel: the Lord thy God is one God.",
        "30 And thou shalt love the Lord thy God, with thy whole heart, and with thy whole soul, and with thy whole mind, and with thy whole strength. This is the first commandment.",
        "31 And the second is like to it: Thou shalt love thy neighbour as thyself. There is no other commandment greater than these.",
        "32 And the scribe said to him: Well, Master, thou hast said in truth, that there is one God, and there is no other besides him.",
        "33 And that he should be loved with the whole heart, and with the whole understanding, and with the whole soul, and with the whole strength; and to love one’s neighbour as one’s self, is a greater thing than all holocausts and sacrifices.",
        "34 And Jesus seeing that he had answered wisely, said to him: Thou art not far from the kingdom of God. And no man after that durst ask him any question."
      ]
    }
  ]
}