{
  "date": "2026-06-19",
  "url": "https://www.catholicgallery.org/mass-reading/190626/",
  "title": "Daily Mass Readings for Friday, 19 June 2026",
  "feast": "Ordinary Weekday/ Romuald, Abbot",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Kings 11: 1-4, 9-18, 20",
      "reference": "Second Kings 11: 1-4, 9-18, 20",
      "verses": [
        "1 And Athalia the mother of Ochozias seeing that her son was dead, arose, and slew all the royal seed.",
        "2 But Josaba the daughter of king Joram, sister of Ochozias, took Joas the son of Ochozias, and stole him from among the king’s sons that were slain, out of the bedchamber with his nurse: and hid him from the face of Athalia, so that he was not slain.",
        "3 And he was with her six years hid in the house of the Lord. And Athalia reigned over the land.",
        "4 And in the seventh year Joiada seat, and taking the centurions and the soldiers, brought them in to him into the temple of the Lord, and made a covenant with them: and taking an oath of them in the house of the Lord, shewed them the king’s son:",
        "9 And the centurions did according to all things that Joiada the priest had commanded them: and taking every one their men, that went in on the sabbath, with them that went out on the sabbath, came to Joiada the priest.",
        "10 And he gave them the spears, and the arms of king David, which were in the house of the Lord.",
        "11 And they stood having every one their weapons in their hands, from the right side of the temple, unto the left side of the altar, and of the temple, about the king.",
        "12 And he brought forth the king’s son, and put the diadem upon him, and the testimony: and they made him king, and anointed him: and clapping their hands. they said, God save the king.",
        "13 And Athalia heard the noise of the people running: and going in to the people into the temple of the Lord,",
        "14 She saw the king standing upon a tribunal, as the manner was, and the singers, and the trumpets near him, and all the people of the land rejoicing, and sounding the trumpets: and she rent her garments, and cried: A conspiracy, a conspiracy.",
        "15 But Joiada commended the centurions that were over the army, and said to them: Have her forth without the precinct of the temple, and whosoever shall follow her, let him be slain with the sword. For the priest had said: Let her not be slain in the temple of the Lord.",
        "16 And they laid hands on her: and thrust her out by the way by which the horses go in, by the palace, and she was slain there.",
        "17 And Joiada made a covenant between the Lord, and the king, and the people, that they should be the people of the Lord, and between the king and the people.",
        "18 And all the people of the land went into the temple of Baal, and broke down his altars, and his images they broke in pieces thoroughly: they slew also Mathan the priest of Baal before the altar. And the priest set guards in the house of the Lord.",
        "20 And all the people of the land rejoiced, and the city was quiet: but Athalia was slain with the sword in the king’s house."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 132: 11, 12, 13-14, 17-18",
      "reference": "Psalms 132: 11, 12, 13-14, 17-18",
      "verses": [
        "R. (13) The Lord has chosen Zion for his dwelling.",
        "11 The Lord hath sworn truth to David, and he will not make it void: of the fruit of thy womb I will set upon thy throne.",
        "R. The Lord has chosen Zion for his dwelling.",
        "12 If thy children will keep thy covenant, and these my testimonies which I shall teach them: Their children also for evermore shall sit upon thy throne.",
        "R. The Lord has chosen Zion for his dwelling.",
        "13 For the Lord hath chosen Sion: he hath chosen it for his dwelling.",
        "14 This is my rest for ever and ever: here will I dwell, for I have chosen it.",
        "R. The Lord has chosen Zion for his dwelling.",
        "17 There will I bring forth a horn to David: I have prepared a lamp for my anointed.",
        "18 His enemies I will clothe with confusion: but upon him will my sanctification flourish.",
        "R. The Lord has chosen Zion for his dwelling."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 5: 3",
      "reference": "Matthew 5: 3",
      "verses": [
        "R. Alleluia, alleluia.",
        "3 Blessed are the poor in spirit; for theirs is the Kingdom of heaven.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 6: 19-23",
      "reference": "Matthew 6: 19-23",
      "verses": [
        "19 Lay not up to yourselves treasures on earth: where the rust, and moth consume, and where thieves break through and steal.",
        "20 But lay up to yourselves treasures in heaven: where neither the rust nor moth doth consume, and where thieves do not break through, nor steal.",
        "21 For where thy treasure is, there is thy heart also.",
        "22 The light of thy body is thy eye. If thy eye be single, thy whole body shall be lightsome.",
        "23 But if thy eye be evil thy whole body shall be darksome. If then the light that is in thee, be darkness: the darkness itself how great shall it be!"
      ]
    }
  ]
}