{
  "date": "2026-06-13",
  "url": "https://www.catholicgallery.org/mass-reading/130626/",
  "title": "Daily Mass Readings for Saturday, 13 June 2026",
  "feast": "Immaculate Heart of the Blessed Virgin Mary Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Kings 19: 19-21",
      "reference": "First Kings 19: 19-21",
      "verses": [
        "19 And Elias departing from thence, found Eliseus the son of Saphat, ploughing with twelve yoke of oxen: and he was one of them that were ploughing with twelve yoke of oxen: and when Elias came up to him, he cast his mantle upon him.",
        "20 And he forthwith left the oxen and ran after Elias, and said: Let me, I pray thee, kiss my father and my mother, and then I will follow thee. And he said to him: Go, and return back: for that which was my part, I have done to thee.",
        "21 And returning back from him, he took a yoke of oxen, and killed them, and boiled the flesh with the plough of the oxen, and gave to the people, and they ate: and rising up he went away, and followed Elias, and ministered to him."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 16: 1b-2a and 5, 7-8, 9-10",
      "reference": "Psalms 16: 1b-2a and 5, 7-8, 9-10",
      "verses": [
        "R. (5a) You are my inheritance, O Lord.",
        "1b Preserve me, O Lord, for I have put trust in thee.",
        "2a I have said to the Lord, thou art my God.",
        "5 The Lord is the portion of my inheritance and of my cup: it is thou that wilt restore my inheritance to me.",
        "R. You are my inheritance, O Lord.",
        "7 I will bless the Lord, who hath given me understanding: moreover my reins also have corrected me even till night.",
        "8 I set the Lord always in my sight: for he is at my right hand, that I be not moved.",
        "R. You are my inheritance, O Lord.",
        "9 Therefore my heart hath been glad, and my tongue hath rejoiced: moreover my flesh also shall rest in hope.",
        "10 Because thou wilt not leave my soul in hell; nor wilt then give thy holy one to see corruption.",
        "R. You are my inheritance, O Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 2: 19",
      "reference": "Luke 2: 19",
      "verses": [
        "R. Alleluia, alleluia.",
        "19 Blessed is the Virgin Mary who kept the word of God and pondered it in her heart.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 2: 41-51",
      "reference": "Luke 2: 41-51",
      "verses": [
        "41 And his parents went every year to Jerusalem, at the solemn day of the pasch,",
        "42 And when he was twelve years old, they going up into Jerusalem, according to the custom of the feast,",
        "43 And having fulfilled the days, when they returned, the child Jesus remained in Jerusalem; and his parents knew it not.",
        "44 And thinking that he was in the company, they came a day’s journey, and sought him among their kinsfolks and acquaintance.",
        "45 And not finding him, they returned into Jerusalem, seeking him.",
        "46 And it came to pass, that, after three days, they found him in the temple, sitting in the midst of the doctors, hearing them, and asking them questions.",
        "47 And all that heard him were astonished at his wisdom and his answers.",
        "48 And seeing him, they wondered. And his mother said to him: Son, why hast thou done so to us? behold thy father and I have sought thee sorrowing.",
        "49 And he said to them: How is it that you sought me? did you not know, that I must be about my father’s business?",
        "50 And they understood not the word that he spoke unto them.",
        "51 And he went down with them, and came to Nazareth, and was subject to them. And his mother kept all these words in her heart."
      ]
    }
  ]
}