{
  "date": "2026-06-01",
  "url": "https://www.catholicgallery.org/mass-reading/010626/",
  "title": "Daily Mass Readings for Monday, 1 June 2026",
  "feast": "Justin, Martyr Obligatory Memorial (Ninth Week in Ordinary Time)",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Peter 1: 2-7",
      "reference": "Second Peter 1: 2-7",
      "verses": [
        "2 Grace to you and peace be accomplished in the knowledge of God and of Christ Jesus our Lord:",
        "3 As all things of his divine power which appertain to life and godliness, are given us, through the knowledge of him who hath called us by his own proper glory and virtue.",
        "4 By whom he hath given us most great and precious promises: that by these you may be made partakers of the divine nature: flying the corruption of that concupiscence which is in the world.",
        "5 And you, employing all care, minister in your faith, virtue; and in virtue, knowledge;",
        "6 And in knowledge, abstinence; and in abstinence, patience; and in patience, godliness;",
        "7 And in godliness, love of brotherhood; and in love of brotherhood, charity."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 91: 1-2, 14-15b, 15c-16",
      "reference": "Psalms 91: 1-2, 14-15b, 15c-16",
      "verses": [
        "R. (2b) In you, my God, I place my trust.",
        "1 The praise of a canticle for David. He that dwelleth in the aid of the most High, shall abide under the protection of the God of Jacob.",
        "2 He shall say to the Lord: Thou art my protector, and my refuge: my God, in him will I trust.",
        "R. In you, my God, I place my trust.",
        "14 Because he hoped in me I will deliver him: I will protect him because he hath known my name.",
        "15ab He shall cry to me, and I will hear him: I am with him in tribulation.",
        "R. In you, my God, I place my trust.",
        "15c I will deliver him, and I will glorify him.",
        "16 I will fill him with length of days; and I will shew him my salvation.",
        "R. In you, my God, I place my trust."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Revelation 1: 5ab",
      "reference": "Revelation 1: 5ab",
      "verses": [
        "R. Alleluia, alleluia.",
        "5ab Jesus Christ, you are the faithful witness, the firstborn of the dead; you have loved us and freed us from our sins by your Blood.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 12: 1-12",
      "reference": "Mark 12: 1-12",
      "verses": [
        "1 And he began to speak to them in parables: A certain man planted a vineyard and made a hedge about it, and dug a place for the winefat, and built a tower, and let it to husbandmen; and went into a far country.",
        "2 And at the season he sent to the husbandmen a servant to receive of the husbandmen of the fruit of the vineyard.",
        "3 Who having laid hands on him, beat him, and sent him away empty.",
        "4 And again he sent to them another servant; and him they wounded in the head, and used him reproachfully.",
        "5 And again he sent another, and him they killed: and many others, of whom some they beat, and others they killed.",
        "6 Therefore having yet one son, most dear to him; he also sent him unto them last of all, saying: They will reverence my son.",
        "7 But the husbandmen said one to another: This is the heir; come let us kill him; and the inheritance shall be ours.",
        "8 And laying hold on him, they killed him, and cast him out of the vineyard.",
        "9 What therefore will the lord of the vineyard do? He will come and destroy those husbandmen; and will give the vineyard to others.",
        "10 And have you not read this scripture, The stone which the builders rejected, the same is made the head of the corner:",
        "11 By the Lord has this been done, and it is wonderful in our eyes.",
        "12 And they sought to lay hands on him, but they feared the people. For they knew that he spoke this parable to them. And leaving him, they went their way."
      ]
    }
  ]
}