{
  "date": "2026-06-05",
  "url": "https://www.catholicgallery.org/mass-reading/050626/",
  "title": "Daily Mass Readings for Friday, 5 June 2026",
  "feast": "Boniface, Bishop, Martyr Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Timothy 3: 10-17",
      "reference": "Second Timothy 3: 10-17",
      "verses": [
        "10 But thou hast fully known my doctrine, manner of life, purpose, faith, longsuffering, love, patience,",
        "11 Persecutions, afflictions: such as came upon me at Antioch, at Iconium, and at Lystra: what persecutions I endured, and out of them all the Lord delivered me.",
        "12 And all that will live godly in Christ Jesus, shall suffer persecution.",
        "13 But evil men and seducers shall grow worse and worse: erring, and driving into error.",
        "14 But continue thou in those things which thou hast learned, and which have been committed to thee: knowing of whom thou hast learned them;",
        "15 And because from thy infancy thou hast known the holy scriptures, which can instruct thee to salvation, by the faith which is in Christ Jesus.",
        "16 All scripture, inspired of God, is profitable to teach, to reprove, to correct, to instruct in justice,",
        "17 That the man of God may be perfect, furnished to every good work."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 119: 157, 160, 161, 165, 166, 168",
      "reference": "Psalms 119: 157, 160, 161, 165, 166, 168",
      "verses": [
        "R. (165a) O Lord, great peace have they who love your law.",
        "157 Many are they that persecute me, and afflict me; but I have not declined from thy testimonies.",
        "R. O Lord, great peace have they who love your law.",
        "160 The beginning of thy words is truth: all the judgments of thy justice are for ever.",
        "R. O Lord, great peace have they who love your law.",
        "161 SIN. Princes have persecuted me without cause: and my heart hath been in awe of thy words.",
        "R. O Lord, great peace have they who love your law.",
        "165 Much peace have they that love thy law, and to them there is no stumbling block.",
        "R. O Lord, great peace have they who love your law.",
        "166 I looked to thy salvation, O Lord: and I loved thy commandments.",
        "R. O Lord, great peace have they who love your law.",
        "168 I have kept thy commandments and thy testimonies: because all my ways are in thy sight.",
        "R. O Lord, great peace have they who love your law."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 23",
      "reference": "John 14: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Whoever loves me will keep my word, and my Father will love him and we will come to him.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 12: 35-37",
      "reference": "Mark 12: 35-37",
      "verses": [
        "35 And Jesus answering, said, teaching in the temple: How do the scribes say, that Christ is the son of David?",
        "36 For David himself saith by the Holy Ghost: The Lord said to my Lord, Sit on my right hand, until I make thy enemies thy footstool.",
        "37 David therefore himself calleth him Lord, and whence is he then his son? And a great multitude heard him gladly."
      ]
    }
  ]
}