{
  "date": "2026-06-06",
  "url": "https://www.catholicgallery.org/mass-reading/060626/",
  "title": "Daily Mass Readings for Saturday, 6 June 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary/ Norbert, Bishop, Religious Founder",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Timothy 4: 1-8",
      "reference": "Second Timothy 4: 1-8",
      "verses": [
        "1 I charge thee, before God and Jesus Christ, who shall judge the living and the dead, by his coming, and his kingdom:",
        "2 Preach the word: be instant in season, out of season: reprove, entreat, rebuke in all patience and doctrine.",
        "3 For there shall be a time, when they will not endure sound doctrine; but, according to their own desires, they will heap to themselves teachers, having itching ears:",
        "4 And will indeed turn away their hearing from the truth, but will be turned unto fables.",
        "5 But be thou vigilant, labour in all things, do the work of an evangelist, fulfill thy ministry. Be sober.",
        "6 For I am even now ready to be sacrificed: and the time of my dissolution is at hand.",
        "7 I have fought a good fight, I have finished my course, I have kept the faith.",
        "8 As to the rest, there is laid up for me a crown of justice, which the Lord the just judge will render to me in that day: and not only to me, but to them also that love his coming. Make haste to come to me quickly."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 71: 8-9, 14-15ab, 16-17, 22",
      "reference": "Psalms 71: 8-9, 14-15ab, 16-17, 22",
      "verses": [
        "R. (15ab) I will sing of your salvation.",
        "8 Let my mouth be filled with praise, that I may sing thy glory; thy greatness all the day long.",
        "9 Cast me not off in the time of old age: when my strength shall fail, do not thou forsake me.",
        "R. I will sing of your salvation.",
        "14 But I will always hope; and will add to all thy praise.",
        "15ab My mouth shall shew forth thy justice; thy salvation all the day long.",
        "R. I will sing of your salvation.",
        "16 I will enter into the powers of the Lord: O Lord, I will be mindful of thy justice alone.",
        "17 Thou hast taught me, O God, from my youth: and till now I will declare thy wonderful works.",
        "R. I will sing of your salvation.",
        "22 For I will also confess to thee thy truth with the instruments of psaltery: O God, I will sing to thee with the harp, thou holy one of Israel.",
        "R. I will sing of your salvation."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 5: 3",
      "reference": "Matthew 5: 3",
      "verses": [
        "R. Alleluia, alleluia.",
        "3 Blessed are the poor in spirit: for theirs is the Kingdom of heaven.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 12: 38-44",
      "reference": "Mark 12: 38-44",
      "verses": [
        "38 And he said to them in his doctrine: Beware of the scribes, who love to walk in long robes, and to be saluted in the marketplace,",
        "39 And to sit in the first chairs, in the synagogues, and to have the highest places at suppers:",
        "40 Who devour the houses of widows under the pretence of long prayer: these shall receive greater judgment.",
        "41 And Jesus sitting over against the treasury, beheld how the people cast money into the treasury, and many that were rich cast in much.",
        "42 And there came a certain poor widow, and she cast in two mites, which make a farthing.",
        "43 And calling his disciples together, he saith to them: Amen I say to you, this poor widow hath cast in more than all they who have cast into the treasury.",
        "44 For all they did cast in of their abundance; but she of her want cast in all she had, even her whole living."
      ]
    }
  ]
}