{
  "date": "2026-06-25",
  "url": "https://www.catholicgallery.org/mass-reading/250626/",
  "title": "Daily Mass Readings for Thursday, 25 June 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Kings 24: 8-17",
      "reference": "Second Kings 24: 8-17",
      "verses": [
        "8 Joachin was eighteen years old when he began to reign, a and he reigned three months in Jerusalem: the name of his mother was Nohesta the daughter of Elnathan of Jerusalem.",
        "9 And he did evil before the Lord, according to all that his father had done.",
        "10 At that time the servants of Nabuchodonosor king of Babylon came up against Jerusalem, and the city was surrounded with their forts.",
        "11 And Nabuchodonosor king of Babylon came to the city with his servants to assault it.",
        "12 And Joachin king of Juda went out to the king of Babylon, he and his mother, and his servants, and his nobles, and his eunuchs: and the king of Babylon received him in the eighth year of his reign.",
        "13 And he brought out from thence all the treasures of the house of the Lord, and the treasures of the king’s house: and he cut in pieces all the vessels of gold which Solomon king of Israel had made in the temple of the Lord, according to the word of the Lord.",
        "14 And he carried away all Jerusalem, and all the princes, and all the valiant men of the army, to the number of ten thousand into captivity: and every artificer and smith: and none were left, but the poor sort of the people of the land.",
        "15 And he carried away Joachin into Babylon, and the king’s mother, and the king’s wives, and his eunuchs: and the judges of the land he carried into captivity from Jerusalem into Babylon.",
        "16 And all the strong men, seven thousand, and the artificers, and the smiths a thousand, all that were valiant men and fit for war: and the king of Babylon led them captives into Babylon.",
        "17 And he appointed Matthanias his uncle in his stead: and called his name Sedecias."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 79: 1b-2, 3-5, 8, 9",
      "reference": "Psalms 79: 1b-2, 3-5, 8, 9",
      "verses": [
        "R. (9) For the glory of your name, O Lord, deliver us.",
        "1b O God, the heathens are come into thy inheritance, they have defiled thy holy temple: they have made Jerusalem as a place to keep fruit.",
        "2 They have given the dead bodies of thy servants to be meat for the fowls of the air: the flesh of thy saints for the beasts of the earth.",
        "R. For the glory of your name, O Lord, deliver us.",
        "3 They have poured out their blood as water, round about Jerusalem and there was none to bury them.",
        "4 We are become a reproach to our neighbours: a scorn and derision to them that are round about us.",
        "5 How long, O Lord, wilt thou be angry for ever: shall thy zeal be kindled like a fire?",
        "R. For the glory of your name, O Lord, deliver us.",
        "8 Remember not our former iniquities: let thy mercies speedily prevent us, for we are become exceeding poor.",
        "R. For the glory of your name, O Lord, deliver us.",
        "9 Help us, O God, our saviour: and for the glory of thy name, O Lord, deliver us: and forgive us our sins for thy name’s sake:",
        "R. For the glory of your name, O Lord, deliver us."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 23",
      "reference": "John 14: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Whoever loves me will keep my word, and my Father will love him and we will come to him.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 7: 21-29",
      "reference": "Matthew 7: 21-29",
      "verses": [
        "21 Not every one that saith to me, Lord, Lord, shall enter into the kingdom of heaven: but he that doth the will of my Father who is in heaven, he shall enter into the kingdom of heaven.",
        "22 Many will say to me in that day: Lord, Lord, have not we prophesied in thy name, and cast out devils in thy name, and done many miracles in thy name?",
        "23 And then will I profess unto them, I never knew you: depart from me, you that work iniquity.",
        "24 Every one therefore that heareth these my words, and doth them, shall be likened to a wise man that built his house upon a rock,",
        "25 And the rain fell, and the floods came, and the winds blew, and they beat upon that house, and it fell not, for it was founded on a rock.",
        "26 And every one that heareth these my words, and doth them not, shall be like a foolish man that built his house upon the sand,",
        "27 And the rain fell, and the floods came, and the winds blew, and they beat upon that house, and it fell, and great was the fall thereof.",
        "28 And it came to pass when Jesus had fully ended these words, the people were in admiration at his doctrine.",
        "29 For he was teaching them as one having power, and not as the scribes and Pharisees."
      ]
    }
  ]
}