{
  "date": "2026-06-12",
  "url": "https://www.catholicgallery.org/mass-reading/120626/",
  "title": "Daily Mass Readings for Friday, 12 June 2026",
  "feast": "Sacred Heart of Jesus Solemnity",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Deuteronomy 7: 6-11",
      "reference": "Deuteronomy 7: 6-11",
      "verses": [
        "6 Because thou art a holy people to the Lord thy God. The Lord thy God hath chosen thee, to be his peculiar people of all peoples that are upon the earth.",
        "7 Not because you surpass all nations in number, is the Lord joined unto you, and hath chosen you, for you are the fewest of any people:",
        "8 But because the Lord hath loved you, and hath kept his oath, which he swore to your fathers: and hath brought you out with a strong hand, and redeemed you from the house of bondage, out of the hand of Pharao the king of Egypt.",
        "9 And thou shalt know that the Lord thy God, he is a strong and faithful God, keeping his covenant and mercy to them that love him, and to them that keep his commandments, unto a thousand generations:",
        "10 And repaying forthwith them that hate him, so as to destroy them, without further delay immediately rendering to them what they deserve.",
        "11 Keep therefore the precepts and ceremonies and judgments, which I command thee this day to do."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 103: 1-2, 3-4, 6-7, 8, 10",
      "reference": "Psalms 103: 1-2, 3-4, 6-7, 8, 10",
      "verses": [
        "R. (17) The Lord’s kindness is everlasting to those who fear him.",
        "1 Bless the Lord, O my soul: and let all that is within me bless his holy name.",
        "2 Bless the Lord, O my soul, and never forget all he hath done for thee.",
        "R. The Lord’s kindness is everlasting to those who fear him.",
        "3 Who forgiveth all thy iniquities: who healeth all thy diseases.",
        "4 Who redeemeth thy life from destruction: who crowneth thee with mercy and compassion.",
        "R. The Lord’s kindness is everlasting to those who fear him.",
        "6 The Lord doth mercies, and judgment for all that suffer wrong.",
        "7 He hath made his ways known to Moses: his wills to the children of Israel.",
        "R. The Lord’s kindness is everlasting to those who fear him.",
        "8 The Lord is compassionate and merciful: longsuffering and plenteous in mercy.",
        "10 He hath not dealt with us according to our sins: nor rewarded us according to our iniquities.",
        "R. The Lord’s kindness is everlasting to those who fear him."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First John 4: 7-16",
      "reference": "First John 4: 7-16",
      "verses": [
        "7 Dearly beloved, let us love one another, for charity is of God. And every one that loveth, is born of God, and knoweth God.",
        "8 He that loveth not, knoweth not God: for God is charity.",
        "9 By this hath the charity of God appeared towards us, because God hath sent his only begotten Son into the world, that we may live by him.",
        "10 In this is charity: not as though we had loved God, but because he hath first loved us, and sent his Son to be a propitiation for our sins.",
        "11 My dearest, if God hath so loved us; we also ought to love one another.",
        "12 No man hath seen God at any time. If we love one another, God abideth in us, and his charity is perfected in us.",
        "13 In this we know that we abide in him, and he in us: because he hath given us of his spirit.",
        "14 And we have seen, and do testify, that the Father hath sent his Son to be the Saviour of the world.",
        "15 Whosoever shall confess that Jesus is the Son of God, God abideth in him, and he in God.",
        "16 And we have known, and have believed the charity, which God hath to us. God is charity: and he that abideth in charity, abideth in God, and God in him."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 11: 29a",
      "reference": "Matthew 11: 29a",
      "verses": [
        "R. Alleluia, alleluia.",
        "29a Take my yoke upon you, says the Lord; and learn from me, for I am meek and humble of heart.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 11: 25-30",
      "reference": "Matthew 11: 25-30",
      "verses": [
        "25 At that time Jesus answered and said: I confess to thee, O Father, Lord of heaven and earth, because thou hast hid these things from the wise and prudent, and hast revealed them to the little ones.",
        "26 Yea, Father; for so hath it seemed good in thy sight.",
        "27 All things are delivered to me by my Father. And no one knoweth the Son, but the Father: neither doth any one know the Father, but the Son, and he to whom it shall please the Son to reveal him.",
        "28 Come to me, all you that labour, and are burdened, and I will refresh you.",
        "29 Take up my yoke upon you, and learn of me, because I am meek, and humble of heart: and you shall find rest to your souls.",
        "30 For my yoke is sweet and my burden light."
      ]
    }
  ]
}