{
  "date": "2026-06-28",
  "url": "https://www.catholicgallery.org/mass-reading/280626/",
  "title": "Daily Mass Readings for Sunday, 28 June 2026",
  "feast": "Thirteenth Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Kings 4: 8-11, 14-16a",
      "reference": "Second Kings 4: 8-11, 14-16a",
      "verses": [
        "8 And there was a day when Eliseus passed by Sunam: now there was a great woman there, who detained him to eat bread; and as he passed often that way, he turned into her house to eat bread.",
        "9 And she said to her husband: I perceive that this is a holy man of God, who often passeth by us.",
        "10 Let us therefore make him a little chamber, and put a little bed in it for him, and a table, and a stool, and a candlestick, that when he cometh to us, he may abide there.",
        "11 Now there was a certain day when he came and turned in to the chamber, and rested there.",
        "14 And he said: What will she then that I do for her? And Giezi said: Do not ask, for she hath no son, and her husband is old.",
        "15 Then he bid him call her: And when she was called, and stood before the door.",
        "16a He said to her: At this time, and this same hour, if life accompany, thou shalt have a son in thy womb."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 89: 2-3, 16-17, 18-19",
      "reference": "Psalms 89: 2-3, 16-17, 18-19",
      "verses": [
        "R. (2a) Forever I will sing the goodness of the Lord.",
        "2 The mercies of the Lord I will sing for ever. I will shew forth thy truth with my mouth to generation and generation.",
        "3 For thou hast said: Mercy shall be built up for ever in the heavens: thy truth shall be prepared in them.",
        "R. Forever I will sing the goodness of the Lord.",
        "16 Blessed is the people that knoweth jubilation. They shall walk, O Lord, in the light of thy countenance:",
        "17 And in thy name they shall rejoice all the day, and in thy justice they shall be exalted.",
        "R. Forever I will sing the goodness of the Lord.",
        "18 For thou art the glory of their strength: and in thy good pleasure shall our horn be exalted.",
        "19 For our protection is of the Lord, and of our king the holy one of Israel.",
        "R. Forever I will sing the goodness of the Lord."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Romans 6: 3-4, 8-11",
      "reference": "Romans 6: 3-4, 8-11",
      "verses": [
        "3 Know you not that all we, who are baptized in Christ Jesus, are baptized in his death?",
        "4 For we are buried together with him by baptism into death; that as Christ is risen from the dead by the glory of the Father, so we also may walk in newness of life.",
        "8 Now if we be dead with Christ, we believe that we shall live also together with Christ:",
        "9 Knowing that Christ rising again from the dead, dieth now no more, death shall no more have dominion over him.",
        "10 For in that he died to sin, he died once; but in that he liveth, he liveth unto God:",
        "11 So do you also reckon, that you are dead to sin, but alive unto God, in Christ Jesus our Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: First Peter 2: 9",
      "reference": "First Peter 2: 9",
      "verses": [
        "R. Alleluia, alleluia.",
        "9 You are a chosen race, a royal priesthood, a holy nation; announce the praises of him who called you out of darkness into his wonderful light.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 10: 37-42",
      "reference": "Matthew 10: 37-42",
      "verses": [
        "37 He that loveth father or mother more than me, is not worthy of me; and he that loveth son or daughter more than me, is not worthy of me.",
        "38 And he that taketh not up his cross, and followeth me, is not worthy of me.",
        "39 He that findeth his life, shall lose it: and he that shall lose his life for me, shall find it.",
        "40 He that receiveth you, receiveth me: and he that receiveth me, receiveth him that sent me.",
        "41 He that receiveth a prophet in the name of a prophet, shall receive the reward of a prophet: and he that receiveth a just man in the name of a just man, shall receive the reward of a just man.",
        "42 And whosoever shall give to drink to one of these little ones a cup of cold water only in the name of a disciple, amen I say to you, he shall not lose his reward."
      ]
    }
  ]
}