{
  "date": "2026-06-07",
  "url": "https://www.catholicgallery.org/mass-reading/070626/",
  "title": "Daily Mass Readings for Sunday, 7 June 2026",
  "feast": "The Body and Blood of Christ Solemnity",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Deuteronomy 8: 2-3, 14b-16a",
      "reference": "Deuteronomy 8: 2-3, 14b-16a",
      "verses": [
        "2 And thou shalt remember all the way through which the Lord thy God hath brought thee for forty years through the desert, to afflict thee and to prove thee, and that the things that were in thy heart might be made known, whether thou wouldst keep his commandments or no.",
        "3 He afflicted thee with want, and gave thee manna for thy food, which neither thou nor thy fathers knew: to shew that not in bread alone doth man live, but in every word that proceedeth from the mouth of God.",
        "14b Thou remember not the Lord thy God, who brought thee out of the land of Egypt, out of the house of bondage:",
        "15 And was thy leader in the great and terrible wilderness, wherein there was the serpent burning with his breath, and the scorpion and the dipsas, and no waters at all: who brought forth streams out of the hardest rock,",
        "16a And fed thee in the wilderness with manna which thy fathers knew not."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 147: 12-13, 14-15, 19-20",
      "reference": "Psalms 147: 12-13, 14-15, 19-20",
      "verses": [
        "R. (12) Praise the Lord, Jerusalem.",
        "or",
        "R. Alleluia.",
        "12 Praise the Lord, O Jerusalem: praise thy God, O Sion.",
        "13 Because he hath strengthened the bolts of thy gates, he hath blessed thy children within thee.",
        "R. Praise the Lord, Jerusalem.",
        "or",
        "R. Alleluia.",
        "14 Who hath placed peace in thy borders: and filleth thee with the fat of corn.",
        "15 Who sendeth forth his speech to the earth: his word runneth swiftly.",
        "R. Praise the Lord, Jerusalem.",
        "or",
        "R. Alleluia.",
        "19 Who declareth his word to Jacob: his justices and his judgments to Israel.",
        "20 He hath not done in like manner to every nation: and his judgments he hath not made manifest to them. Alleluia.",
        "R. Praise the Lord, Jerusalem.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First Corinthians 10: 16-17",
      "reference": "First Corinthians 10: 16-17",
      "verses": [
        "16 The chalice of benediction, which we bless, is it not the communion of the blood of Christ? And the bread, which we break, is it not the partaking of the body of the Lord?",
        "17 For we, being many, are one bread, one body, all that partake of one bread."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 6: 51",
      "reference": "John 6: 51",
      "verses": [
        "R. Alleluia, alleluia.",
        "51 I am the living bread that came down from heaven, says the Lord; whoever eats this bread will live forever.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 6: 51-58",
      "reference": "John 6: 51-58",
      "verses": [
        "51 I am the living bread which came down from heaven.If any man eat of this bread, he shall live for ever; and the bread that I will give, is my flesh, for the life of the world.",
        "52The Jews therefore strove among themselves, saying: How can this man give us his flesh to eat?",
        "53Then Jesus said to them: Amen, amen I say unto you: Except you eat the flesh of the Son of man, and drink his blood, you shall not have life in you.",
        "54He that eateth my flesh, and drinketh my blood, hath everlasting life: and I will raise him up in the last day.",
        "55For my flesh is meat indeed: and my blood is drink indeed.",
        "56He that eateth my flesh, and drinketh my blood, abideth in me, and I in him.",
        "57As the living Father hath sent me, and I live by the Father; so he that eateth me, the same also shall live by me.",
        "58This is the bread that came down from heaven. Not as your fathers did eat manna, and are dead. He that eateth this bread, shall live for ever."
      ]
    }
  ]
}