{
  "date": "2026-06-14",
  "url": "https://www.catholicgallery.org/mass-reading/140626/",
  "title": "Daily Mass Readings for Sunday, 14 June 2026",
  "feast": "Eleventh Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Exodus 19: 2-6a",
      "reference": "Exodus 19: 2-6a",
      "verses": [
        "2 For departing out of Raphidim, and coming to the desert of Sinai, they camped in the same place, and there Israel pitched their tents over against the mountain.",
        "3 And Moses went up to God: and the Lord called unto him from the mountain, and said: Thus shalt thou say to the house of Jacob, and tell the children of Israel:",
        "4 You have seen what I have done to the Egyptians, how I have carried you upon the wings of eagles, and have taken you to myself.",
        "5 If therefore you will hear my voice, and keep my covenant, you shall be my peculiar possession above all people: for all the earth is mine.",
        "6a And you shall be to me a priestly kingdom, and a holy nation."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 100: 1-2, 3, 5",
      "reference": "Psalms 100: 1-2, 3, 5",
      "verses": [
        "R. We are His people, the sheep of His flock.",
        "1-2 Sing joyfully to God, all the earth: serve ye the Lord with gladness. Come in before his presence with exceeding great joy.",
        "R. We are His people, the sheep of His flock.",
        "3 Know ye that the Lord he is God: he made us, and not we ourselves. We are his people and the sheep of his pasture.",
        "R. We are His people, the sheep of His flock.",
        "5 For the Lord is sweet, his mercy endureth for ever, and his truth to generation and generation.",
        "R. We are His people, the sheep of His flock."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Romans 5: 6-11",
      "reference": "Romans 5: 6-11",
      "verses": [
        "6 For why did Christ, when as yet we were weak, according to the time, die for the ungodly?",
        "7 For scarce for a just man will one die; yet perhaps for a good man some one would dare to die.",
        "8 But God commendeth his charity towards us; because when as yet we were sinners, according to the time,",
        "9 Christ died for us; much more therefore, being now justified by his blood, shall we be saved from wrath through him.",
        "10 For if, when we were enemies, we were reconciled to God by the death of his Son; much more, being reconciled, shall we be saved by his life.",
        "11 And not only so; but also we glory in God, through our Lord Jesus Christ, by whom we have now received reconciliation."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Mark 1: 15",
      "reference": "Mark 1: 15",
      "verses": [
        "R. Alleluia, alleluia.",
        "15 The Kingdom of God is at Hand; repent and believe in the Gospel.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 9: 36 – 10: 8",
      "reference": "Matthew 9: 36 – 10: 8",
      "verses": [
        "36 And seeing the multitudes, he had compassion on them: because they were distressed, and lying like sheep that have no shepherd.",
        "37 Then he saith to his disciples, The harvest indeed is great, but the labourers are few.",
        "38 Pray ye therefore the Lord of the harvest, that he send forth labourers into his harvest.",
        "10:1 And having called his twelve disciples together, he gave them power over unclean spirits, to cast them out, and to heal all manner of diseases, and all manner of infirmities.",
        "2 And the names of the twelve apostles are these: The first, Simon who is called Peter, and Andrew his brother,",
        "3 James the son of Zebedee, and John his brother, Philip and Bartholomew, Thomas and Matthew the publican, and James the son of Alpheus, and Thaddeus,",
        "4 Simon the Cananean, and Judas Iscariot, who also betrayed him.",
        "5 These twelve Jesus sent: commanding them, saying: Go ye not into the way of the Gentiles, and into the city of the Samaritans enter ye not.",
        "6 But go ye rather to the lost sheep of the house of Israel.",
        "7 And going, preach, saying: The kingdom of heaven is at hand.",
        "8 Heal the sick, raise the dead, cleanse the lepers, cast out devils: freely have you received, freely give."
      ]
    }
  ]
}