{
  "date": "2026-06-02",
  "url": "https://www.catholicgallery.org/mass-reading/020626/",
  "title": "Daily Mass Readings for Tuesday, 2 June 2026",
  "feast": "Ordinary Weekday/ Marcellinus and Peter, Martyrs",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Peter 3: 12-15a, 17-18",
      "reference": "Second Peter 3: 12-15a, 17-18",
      "verses": [
        "12 Looking for and hasting unto the coming of the day of the Lord, by which the heavens being on fire shall be dissolved, and the elements shall melt with the burning heat?",
        "13 But we look for new heavens and a new earth according to his promises, in which justice dwelleth.",
        "14 Wherefore, dearly beloved, waiting for these things, be diligent that you may be found before him unspotted and blameless in peace.",
        "15a And account the longsuffering of our Lord, salvation.",
        "17 You therefore, brethren, knowing these things before, take heed, lest being led aside by the error of the unwise, you fall from your own steadfastness.",
        "18 But grow in grace, and in the knowledge of our Lord and Saviour Jesus Christ. To him be glory both now and unto the day of eternity. Amen."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 90: 2, 3-4, 10, 14 and 16",
      "reference": "Psalms 90: 2, 3-4, 10, 14 and 16",
      "verses": [
        "R. (1) In every age, O Lord, you have been our refuge.",
        "2 Before the mountains were made, or the earth and the world was formed; from eternity and to eternity thou art God.",
        "R. In every age, O Lord, you have been our refuge.",
        "3 Turn not man away to be brought low: and thou hast said: Be converted, O ye sons of men.",
        "4 For a thousand years in thy sight are as yesterday, which is past. And as a watch in the night,",
        "R. In every age, O Lord, you have been our refuge.",
        "10 The days of our years in them are threescore and ten years. But if in the strong they be fourscore years: and what is more of them is labour and sorrow. For mildness is come upon us: and we shall be corrected.",
        "R. In every age, O Lord, you have been our refuge.",
        "14 We are filled in the morning with thy mercy: and we have rejoiced, and are delighted all our days.",
        "16 Look upon thy servants and upon their works: and direct their children.",
        "R. In every age, O Lord, you have been our refuge."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Ephesians 1: 17-18",
      "reference": "Ephesians 1: 17-18",
      "verses": [
        "R. Alleluia, alleluia.",
        "17-18 May the Father of our Lord Jesus Christ enlighten the eyes of our hearts, that we may know what is the hope that belongs to his call.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 12: 13-17",
      "reference": "Mark 12: 13-17",
      "verses": [
        "13 And they sent to him some of the Pharisees and of the Herodians; that they should catch him in his words.",
        "14 Who coming, say to him: Master, we know that thou art a true speaker, and carest not for any man; for thou regardest not the person of men, but teachest the way of God in truth. Is it lawful to give tribute to Caesar; or shall we not give it?",
        "15 Who knowing their wiliness, saith to them: Why tempt you me? bring me a penny that I may see it.",
        "16 And they brought it him. And he saith to them: Whose is this image and inscription? They say to him, Caesar’s.",
        "17 And Jesus answering, said to them: Render therefore to Caesar the things that are Caesar’s, and to God the things that are God’s. And they marvelled at him."
      ]
    }
  ]
}