{
  "date": "2026-06-18",
  "url": "https://www.catholicgallery.org/mass-reading/180626/",
  "title": "Daily Mass Readings for Thursday, 18 June 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Sirach 48: 1-14",
      "reference": "Sirach 48: 1-14",
      "verses": [
        "1 And Elias the prophet stood up, as a fire, and his word burnt like a torch.",
        "2 He brought a famine upon them, and they that provoked him in their envy, were reduced to a small number, for they could not endure the commandments of the Lord.",
        "3 By the word of the Lord he shut up the heaven, and he brought down fire from heaven thrice.",
        "4 Thus was Elias magnified in his wondrous works. And who can glory like to thee?",
        "5 Who raisedst up a dead man from below, from the lot of death, by the word of the Lord God.",
        "6 Who broughtest down kings to destruction, and brokest easily their power in pieces, and the glorious from their bed.",
        "7 Who heardest judgment in Sina, and in Horeb the judgments of vengeance.",
        "8 Who anointedst kings to penance, and madest prophets successors after thee.",
        "9 Who wast taken up in a whirlwind of fire, in a chariot of fiery horses.",
        "10 Who art registered in the judgments of times to appease the wrath of the Lord, to reconcile the heart of the father to the son, and to restore the tribes of Jacob.",
        "11 Blessed are they that saw thee, and were honoured with thy friendship.",
        "12 For we live only in our life, but after death our name shall not be such. Elias was indeed covered with the whirlwind, and his spirit was filled up in Eliseus: in his days he feared not the prince, and no man was more powerful than he.",
        "13 No word could overcome him, and after death his body prophesied.",
        "14 In his life he did great wonders, and is death he wrought miracles."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 97: 1-2, 3-4, 5-6, 7",
      "reference": "Psalms 97: 1-2, 3-4, 5-6, 7",
      "verses": [
        "R. (12a) Rejoice in the Lord, you just!",
        "1 The Lord hath reigned, let the earth rejoice: let many islands be glad.",
        "2 Clouds and darkness are round about him: justice and judgment are the establishment of his throne.",
        "R. Rejoice in the Lord, you just!",
        "3 A fire shall go before him, and shall burn his enemies round about.",
        "4 His lightnings have shone forth to the world: the earth saw and trembled.",
        "R. Rejoice in the Lord, you just!",
        "5 The mountains melted like wax, at the presence of the Lord: at the presence of the Lord of all the earth.",
        "6 The heavens declared his justice: and all people saw his glory.",
        "R. Rejoice in the Lord, you just!",
        "7 Let them be all confounded that adore graven things, and that glory in their idols. Adore him, all you his angels:",
        "R. Rejoice in the Lord, you just!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Romans 8: 15bc",
      "reference": "Romans 8: 15bc",
      "verses": [
        "R. Alleluia, alleluia.",
        "15bc You have received a spirit of adoption as sons through which we cry: Abba! Father!",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 6: 7-15",
      "reference": "Matthew 6: 7-15",
      "verses": [
        "7 And when you are praying, speak not much, as the heathens. For they think that in their much speaking they may be heard.",
        "8 Be not you therefore like to them, for your Father knoweth what is needful for you, before you ask him.",
        "9 Thus therefore shall you pray: Our Father who art in heaven, hallowed be thy name.",
        "10 Thy kingdom come. Thy will be done on earth as it is in heaven.",
        "11 Give us this day our supersubstantial bread.",
        "12 And forgive us our debts, as we also forgive our debtors.",
        "13 And lead us not into temptation. But deliver us from evil. Amen.",
        "14 For if you will forgive men their offences, your heavenly Father will forgive you also your offences.",
        "15 But if you will not forgive men, neither will your Father forgive you your offences."
      ]
    }
  ]
}