{
  "date": "2026-06-30",
  "url": "https://www.catholicgallery.org/mass-reading/300626/",
  "title": "Daily Mass Readings for Tuesday, 30 June 2026",
  "feast": "Ordinary Weekday/ First Martyrs of the Church of Rome",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Amos 3: 1-8; 4: 11-12",
      "reference": "Amos 3: 1-8; 4: 11-12",
      "verses": [
        "1 Hear the word that the Lord hath spoken concerning you, O ye children of Israel: concerning the whole family that I brought up out of the land of Egypt, saying:",
        "2 You only have I known of all the families of the earth: therefore will I visit upon you all your iniquities.",
        "3 Shall two walk together except they be agreed?",
        "4 Will a lion roar in the forest, if he have no prey? will the lion’s whelp cry out of his den, if he have taken nothing?",
        "5 Will the bird fall into the snare upon the earth, if there be no fowler? Shall the snare be taken up from the earth, before it hath taken somewhat?",
        "6 Shall the trumpet sound in a city, and the people not be afraid? Shall there be evil in a city, which the Lord hath not done?",
        "7 For the Lord God doth nothing without revealing his secret to his servants the prophets.",
        "8 The lion shall roar, who will not fear? The Lord God hath spoken, who shall not prophesy?",
        "4:11 I destroyed some of you, as God destroyed Sodom and Gomorrha, and you were as a firebrand plucked out of the burning: yet you returned not to me, saith the Lord.",
        "12 Therefore I will do these things to thee, O Israel: and after I shall have done these things to thee, be prepared to meet thy God, O Israel."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 5: 4b-6, 7, 8",
      "reference": "Psalms 5: 4b-6, 7, 8",
      "verses": [
        "R. (9a) Lead me in your justice, Lord.",
        "4b O Lord, in the morning thou shalt hear my voice.",
        "5 In the morning I will stand before thee, and will see: because thou art not a God that willest iniquity.",
        "6 Neither shall the wicked dwell near thee: nor shall the unjust abide before thy eyes.",
        "R. Lead me in your justice, Lord.",
        "7 Thou hatest all the workers of iniquity: Thou wilt destroy all that speak a lie. The bloody and the deceitful man the Lord will abhor.",
        "R. Lead me in your justice, Lord.",
        "8 But as for me in the multitude of thy mercy, I will come into thy house; I will worship towards thy holy temple, in thy fear.",
        "R. Lead me in your justice, Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Psalms 130: 5",
      "reference": "Psalms 130: 5",
      "verses": [
        "R. Alleluia, alleluia.",
        "5 I trust in the Lord; my soul trusts in his word.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 8: 23-27",
      "reference": "Matthew 8: 23-27",
      "verses": [
        "23 And when he entered into the boat, his disciples followed him:",
        "24 And behold a great tempest arose in the sea, so that the boat was covered with waves, but he was asleep.",
        "25 And they came to him, and awaked him, saying: Lord, save us, we perish.",
        "26 And Jesus saith to them: Why are you fearful, O ye of little faith? Then rising up he commanded the winds, and the sea, and there came a great calm.",
        "27 But the men wondered, saying: What manner of man is this, for the winds and the sea obey him?"
      ]
    }
  ]
}