{
  "date": "2026-06-22",
  "url": "https://www.catholicgallery.org/mass-reading/220626/",
  "title": "Daily Mass Readings for Monday, 22 June 2026",
  "feast": "Ordinary Weekday/ Paulinus of Nola, Bishop/ John Fisher, Bishop, Martyr, and Thomas More, Married Man, Martyr",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Kings 17: 5-8, 13-15a, 18",
      "reference": "Second Kings 17: 5-8, 13-15a, 18",
      "verses": [
        "5 And he went through all the land: and going up to Samaria, he besieged it three years.",
        "6 And in the ninth year of Osee, the king of the Assyrians took Samaria, and carried Israel away to Assyria: and he placed them in Hala and Habor by the river of Gozan, in the cities of the Medes.",
        "7 For so it was that the children of Israel had sinned against the Lord their God, who brought them out of the land of Egypt, from under the hand of Pharao king of Egypt, and they worshipped strange gods.",
        "8 And they walked according to the way of the nations which the Lord had destroyed in the sight of the children of Israel and of the kings of Israel: because they had done in like manner.",
        "13 And the Lord testified to them in Israel and in Juda by the hand of all the prophets and seers, saying: Return from your wicked ways, and keep my precepts, and ceremonies, according to all the law which I commanded your fathers: and as I have sent to you in the hand of my servants the prophets.",
        "14 And they hearkened not, but hardened their necks like to the neck of their fathers, who would not obey the Lord their God.",
        "15a And they rejected his ordinances and the covenant that he made with their fathers, and the testimonies which he testified against them.",
        "18 And the Lord was very angry with Israel, and removed them from his sight, and there remained only the tribe of Juda."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 60: 3, 4-5, 12-13",
      "reference": "Psalms 60: 3, 4-5, 12-13",
      "verses": [
        "R. (7b) Help us with your right hand, O Lord, and answer us.",
        "3 O God, thou hast cast us off, and hast destroyed us; thou hast been angry, and hast had mercy on us.",
        "R. Help us with your right hand, O Lord, and answer us.",
        "4 Thou hast moved the earth, and hast troubled it: heal thou the breaches thereof, for it has been moved.",
        "5 Thou hast shewn thy people hard things; thou hast made us drink wine of sorrow.",
        "R. Help us with your right hand, O Lord, and answer us.",
        "12 Wilt not thou, O God, who hast cast us off? and wilt not thou, O God, go out with our armies?",
        "13 Give us help from trouble: for vain is the salvation of man.",
        "R. Help us with your right hand, O Lord, and answer us."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Hebrews 4: 12",
      "reference": "Hebrews 4: 12",
      "verses": [
        "R. Alleluia, alleluia.",
        "12 The word of God is living and effective, able to discern reflections and thoughts of the heart.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 7: 1-5",
      "reference": "Matthew 7: 1-5",
      "verses": [
        "1 Judge not, that you may not be judged,",
        "2 For with what judgment you judge, you shall be judged: and with what measure you mete, it shall be measured to you again.",
        "3 And why seest thou the mote that is in thy brother’s eye; and seest not the beam that is in thy own eye?",
        "4 Or how sayest thou to thy brother: Let me cast the mote out of thy eye; and behold a beam is in thy own eye?",
        "5 Thou hypocrite, cast out first the beam in thy own eye, and then shalt thou see to cast out the mote out of thy brother’s eye."
      ]
    }
  ]
}