{
  "date": "2026-06-23",
  "url": "https://www.catholicgallery.org/mass-reading/230626/",
  "title": "Daily Mass Readings for Tuesday, 23 June 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Kings 19: 9b-11, 14-21, 31-35a, 36",
      "reference": "Second Kings 19: 9b-11, 14-21, 31-35a, 36",
      "verses": [
        "9b When he heard of Theraca king of Ethiopia: Behold, he is come out to fight with thee: and was going against him, he sent messengers to Ezechias, saying:",
        "10 Thus shall you say to Ezechias king of Juda: Let not thy God deceive thee, in whom thou trustest: and do not say: Jerusalem shall not be delivered into the hands of the king of the Assyrians.",
        "11 Behold thou hast heard what the kings of the Assyrians have done to all countries, how they have laid them waste: and canst thou alone be delivered?",
        "14 And when Ezechias had received the letter of the hand of the messengers, and had read it, he went up to the house of the Lord, and spread it before the Lord,",
        "15 And he prayed in his sight, saying: O Lord God of Israel, who sitteth upon the cherubims, thou alone art the God of all the kings of the earth: thou madest heaven and earth:",
        "16 Incline thy ear, and hear: open, O Lord, thy eyes, and see: and hear all the words of Sennacherib, who hath sent to upbraid unto us the living God.",
        "17 Of a truth, O Lord, the kings of the Assyrians have destroyed nations, and the lands of them all.",
        "18 And they have cast their gods into the fire: for they were not Rods, but the works of men’s hands of wood and stone, and they destroyed them.",
        "19 Now therefore, O Lord our God, save us from his hand, that all the kingdoms of the earth may know, that thou art the Lord the only God.",
        "20 And Isaias the son of Amos sent to Ezechias, saying: Thus saith the Lord the God of Israel: I have heard the prayer thou hast made to me concerning Sennacherib king of the Assyrians.",
        "21 This is the word, that the Lord hath spoken of him: The virgin the daughter of Sion hath despised thee, and laughed thee to scorn: the daughter of Jerusalem hath wagged her head behind thy back.",
        "31 For out of Jerusalem shall go forth a remnant, and that which shall be saved out of mount Sion: the zeal of the Lord of hosts shall do this.",
        "32 Wherefore thus saith the Lord concerning the king of the Assyrians: He shall not come into this city, nor shoot an arrow into it, nor come before it with shield, nor cast a trench about it.",
        "33 By the way that he came, he shall return: and into this city he shall not come, saith the Lord.",
        "34 And I will protect this city, and will save it for my own sake, and for David my servant’s sake.",
        "35a And it came to pass that night, that an angel of the Lord came, and slew in the camp of the Assyrians a hundred and eighty-five thousand.",
        "36 And Sennacherib king of the Assyrians departing went away, and he returned and abode in Ninive."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 48: 2-3ab, 3cd-4, 10-11",
      "reference": "Psalms 48: 2-3ab, 3cd-4, 10-11",
      "verses": [
        "R. (9d) God upholds his city for ever.",
        "2 Great is the Lord, and exceedingly to be praised in the city of our God, in his holy mountain.",
        "3ab With the joy of the whole earth is mount Sion founded.",
        "R. God upholds his city for ever.",
        "3cd On the sides of the north, the city of the great king.",
        "4 In her houses shall God be known, when he shall protect her.",
        "R. God upholds his city for ever.",
        "10 We have received thy mercy, O God, in the midst of thy temple.",
        "11 According to thy name, O God, so also is thy praise unto the ends of the earth: thy right hand is full of justice.",
        "R. God upholds his city for ever."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 8: 12",
      "reference": "John 8: 12",
      "verses": [
        "R. Alleluia, alleluia.",
        "12 I am the light of the world, says the Lord; whoever follows me will have the light of life.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 7: 6, 12-14",
      "reference": "Matthew 7: 6, 12-14",
      "verses": [
        "6 Give not that which is holy to dogs; neither cast ye your pearls before swine, lest perhaps they trample them under their feet, and turning upon you, they tear you.",
        "12 All things therefore whatsoever you would that men should do to you, do you also to them. For this is the law and the prophets.",
        "13 Enter ye in at the narrow gate: for wide is the gate, and broad is the way that leadeth to destruction, and many there are who go in thereat.",
        "14 How narrow is the gate, and strait is the way that leadeth to life: and few there are that find it!"
      ]
    }
  ]
}