{
  "date": "2026-03-14",
  "url": "https://www.catholicgallery.org/mass-reading/140326/",
  "title": "Daily Mass Readings for Saturday, 14 March 2026",
  "feast": "Lenten Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Hosea 6: 1-6",
      "reference": "Hosea 6: 1-6",
      "verses": [
        "1 In their affliction they will rise early to me: Come, and let us return to the Lord:",
        "2 For he hath taken us, and he will heal us: he will strike, and he will cure us.",
        "3 He will revive us after two days: on the third day he will raise us up, and we shall live in his sight. We shall know, and we shall follow on, that we may know the Lord. His going forth is prepared as the morning light, and he will come to us as the early and the latter rain to the earth.",
        "4 What shall I do to thee, O Ephraim? what shall I do to thee, O Juda? your mercy is as a morning cloud, and as the dew that goeth away in the morning.",
        "5 For this reason have I hewed them by the prophets, I have slain them by the words of my mouth: and thy judgments shall go forth as the light.",
        "6 For I desired mercy, and not sacrifice: and the knowledge of God more than holocausts."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 51: 3-4, 18-19, 20-21ab",
      "reference": "Psalms 51: 3-4, 18-19, 20-21ab",
      "verses": [
        "R. (Hosea 6:6) It is mercy I desire, and not sacrifice.",
        "3 Have mercy on me, O God, according to thy great mercy. And according to the multitude of thy tender mercies blot out my iniquity.",
        "4 Wash me yet more from my iniquity, and cleanse me from my sin.",
        "R. It is mercy I desire, and not sacrifice.",
        "18 For if thou hadst desired sacrifice, I would indeed have given it: with burnt offerings thou wilt not be delighted.",
        "19 A sacrifice to God is an afflicted spirit: a contrite and humbled heart, O God, thou wilt not despise.",
        "R. It is mercy I desire, and not sacrifice.",
        "20 Deal favourably, O Lord, in thy good will with Sion; that the walls of Jerusalem may be built up.",
        "21ab Then shalt thou accept the sacrifice of justice, oblations and whole burnt offerings.",
        "R. It is mercy I desire, and not sacrifice."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Verse Before the Gospel: Psalms 95: 8",
      "reference": "Verse Before the Gospel: Psalms 95: 8",
      "verses": [
        "8 If today you hear his voice, harden not your hearts."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 18: 9-14",
      "reference": "Luke 18: 9-14",
      "verses": [
        "9 And to some who trusted in themselves as just, and despised others, he spoke also this parable:",
        "10 Two men went up into the temple to pray: the one a Pharisee, and the other a publican.",
        "11 The Pharisee standing, prayed thus with himself: O God, I give thee thanks that I am not as the rest of men, extortioners, unjust, adulterers, as also is this publican.",
        "12 I fast twice in a week: I give tithes of all that I possess.",
        "13 And the publican, standing afar off, would not so much as lift up his eyes towards heaven; but struck his breast, saying: O God, be merciful to me a sinner.",
        "14 I say to you, this man went down into his house justified rather than the other: because every one that exalteth himself, shall be humbled: and he that humbleth himself, shall be exalted."
      ]
    }
  ]
}