{
  "date": "2026-03-27",
  "url": "https://www.catholicgallery.org/mass-reading/270326/",
  "title": "Daily Mass Readings for Friday, 27 March 2026",
  "feast": "Lenten Weekday. Day of Abstinence from Meat (age 14 and up)",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Jeremiah 20: 10-13",
      "reference": "Jeremiah 20: 10-13",
      "verses": [
        "10 For I heard the reproaches of many, and terror on every side: Persecute him, and let us persecute him: from all the men that were my familiars, and continued at my side: if by any means he may be deceived, and we may prevail against him, and be revenged on him.",
        "11 But the Lord is with me as a strong warrior: therefore they that persecute me shall fall, and shall be weak: they shall be greatly confounded, because they have not understood the everlasting reproach, which never shall be effaced.",
        "12 And thou, O Lord of hosts, prover of the just, who seest the reins and the heart: let me see, I beseech thee, thy vengeance on them: for to thee I have laid open my cause.",
        "13 Sing ye to the Lord, praise the Lord: because he hath delivered the soul of the poor out of the hand of the wicked."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 18: 2-3a, 3bc-4, 5-6, 7",
      "reference": "Psalms 18: 2-3a, 3bc-4, 5-6, 7",
      "verses": [
        "R. (7) In my distress I called upon the Lord, and he heard my voice.",
        "2 I will love thee, O Lord, my strength:",
        "3a The Lord is my firmament, my refuge, and my deliverer.",
        "R. In my distress I called upon the Lord, and he heard my voice.",
        "3bc My God is my helper, and in him will I put my trust. My protector and the horn of my salvation, and my support.",
        "4 Praising I will call upon the Lord: and I shall be saved from my enemies.",
        "R. In my distress I called upon the Lord, and he heard my voice.",
        "5 The sorrows of death surrounded me: and the torrents of iniquity troubled me.",
        "6 The sorrows of hell encompassed me: and the snares of death prevented me.",
        "R. In my distress I called upon the Lord, and he heard my voice.",
        "7 In my affliction I called upon the Lord, and I cried to my God: And he heard my voice from his holy temple: and my cry before him came into his ears.",
        "R. In my distress I called upon the Lord, and he heard my voice."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Verse Before the Gospel: John 6: 63c, 68c",
      "reference": "Verse Before the Gospel: John 6: 63c, 68c",
      "verses": [
        "63c, 68cYour words, Lord, are Spirit and life; you have the words of everlasting life."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 10: 31-42",
      "reference": "John 10: 31-42",
      "verses": [
        "31 The Jews then took up stones to stone him.",
        "32 Jesus answered them: Many good works I have shewed you from my Father; for which of these works do you stone me?",
        "33 The Jews answered him: For a good work we stone thee not, but for blasphemy; and because that thou, being a man, maketh thyself God.",
        "34 Jesus answered them: Is it not written in your law: I said you are gods?",
        "35 If he called them gods, to whom the word of God was spoken, and the scripture cannot be broken;",
        "36 Do you say of him whom the Father hath sanctified and sent into the world: Thou blasphemest, because I said, I am the Son of God?",
        "37 If I do not the works of my Father, believe me not.",
        "38 But if I do, though you will not believe me, believe the works: that you may know and believe that the Father is in me, and I in the Father.",
        "39 They sought therefore to take him; and he escaped out of their hands.",
        "40 And he went again beyond the Jordan, into that place where John was baptizing first; and there he abode.",
        "41 And many resorted to him, and they said: John indeed did no sign.",
        "42 But all things whatsoever John said of this man, were true. And many believed in him."
      ]
    }
  ]
}