{
  "date": "2026-03-19",
  "url": "https://www.catholicgallery.org/mass-reading/190326/",
  "title": "Daily Mass Readings for Thursday, 19 March 2026",
  "feast": "Joseph, Husband of Mary Solemnity",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Samuel 7: 4-5a, 12-14a, 16",
      "reference": "Second Samuel 7: 4-5a, 12-14a, 16",
      "verses": [
        "4 But it came to pass that night, that the word of the Lord came to Nathan, saying:",
        "5a Go, and say to my servant David,",
        "12 And when thy days shall be fulfilled, and thou shalt sleep with thy fathers, I will raise up thy seed after thee, which shall proceed out of thy bowels, and I will establish his kingdom.",
        "13 He shall build a house to my name, and I will establish the throne of his kingdom for ever.",
        "14a I will be to him a father, and he shall be to me a son.",
        "16 And thy house shall be faithful, and thy kingdom for ever before thy face, and thy throne shall be firm for ever."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 89: 2-3, 4-5, 27 and 29",
      "reference": "Psalms 89: 2-3, 4-5, 27 and 29",
      "verses": [
        "R. (37) The son of David will live for ever.",
        "2 The mercies of the Lord I will sing for ever. I will shew forth thy truth with my mouth to generation and generation.",
        "3 For thou hast said: Mercy shall be built up for ever in the heavens: thy truth shall be prepared in them.",
        "R. The son of David will live for ever.",
        "4 I have made a covenant with my elect: I have sworn to David my servant:",
        "5 Thy seed will I settle for ever. And I will build up thy throne unto generation and generation.",
        "R. The son of David will live for ever.",
        "27 He shall cry out to me: Thou art my father: my God, and the support of my salvation.",
        "29 I will keep my mercy for him for ever: and my covenant faithful to him.",
        "R. The son of David will live for ever."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Romans 4: 13, 16-18, 22",
      "reference": "Romans 4: 13, 16-18, 22",
      "verses": [
        "13 For not through the law was the promise to Abraham, or to his seed, that he should be heir of the world; but through the justice of faith.",
        "16 Therefore is it of faith, that according to grace the promise might be firm to all the seed; not to that only which is of the law, but to that also which is of the faith of Abraham, who is the father of us all,",
        "17 (As it is written: I have made thee a father of many nations,) before God, whom he believed, who quickeneth the dead; and calleth those things that are not, as those that are.",
        "18 Who against hope believed in hope; that he might be made the father of many nations, according to that which was said to him: So shall thy seed be.",
        "22 And therefore it was reputed to him unto justice."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Verse Before the Gospel: Psalms 84: 5",
      "reference": "Verse Before the Gospel: Psalms 84: 5",
      "verses": [
        "5 Blessed are those who dwell in your house, O Lord; they never cease to praise you."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 1: 16, 18-21, 24 or Luke 2: 41-51a",
      "reference": "Matthew 1: 16, 18-21, 24 or Luke 2: 41-51a",
      "verses": [
        "16 And Jacob begot Joseph the husband of Mary, of whom was born Jesus, who is called Christ.",
        "18 Now the generation of Christ was in this wise. When as his mother Mary was espoused to Joseph, before they came together, she was found with child, of the Holy Ghost.",
        "19 Whereupon Joseph her husband, being a just man, and not willing publicly to expose her, was minded to put her away privately.",
        "20 But while he thought on these things, behold the angel of the Lord appeared to him in his sleep, saying: Joseph, son of David, fear not to take unto thee Mary thy wife, for that which is conceived in her, is of the Holy Ghost.",
        "21 And she shall bring forth a son: and thou shalt call his name JESUS. For he shall save his people from their sins.",
        "24 And Joseph rising up from sleep, did as the angel of the Lord had commanded him, and took unto him his wife.",
        "Or",
        "41 And his parents went every year to Jerusalem, at the solemn day of the pasch,",
        "42 And when he was twelve years old, they going up into Jerusalem, according to the custom of the feast,",
        "43 And having fulfilled the days, when they returned, the child Jesus remained in Jerusalem; and his parents knew it not.",
        "44 And thinking that he was in the company, they came a day’s journey, and sought him among their kinsfolks and acquaintance.",
        "45 And not finding him, they returned into Jerusalem, seeking him.",
        "46 And it came to pass, that, after three days, they found him in the temple, sitting in the midst of the doctors, hearing them, and asking them questions.",
        "47 And all that heard him were astonished at his wisdom and his answers.",
        "48 And seeing him, they wondered. And his mother said to him: Son, why hast thou done so to us? behold thy father and I have sought thee sorrowing.",
        "49 And he said to them: How is it that you sought me? did you not know, that I must be about my father’s business?",
        "50 And they understood not the word that he spoke unto them.",
        "51a And he went down with them, and came to Nazareth, and was subject to them."
      ]
    }
  ]
}