{
  "date": "2026-03-01",
  "url": "https://www.catholicgallery.org/mass-reading/010326/",
  "title": "Daily Mass Readings for Sunday, 1 March 2026",
  "feast": "Second Sunday of Lent",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Genesis 12: 1-4a",
      "reference": "Genesis 12: 1-4a",
      "verses": [
        "1 And the Lord said to Abram: Go forth out of thy country, and from thy kindred, and out of thy father’s house, and come into the land which I shall shew thee.",
        "2 And I will make of thee a great nation, and I will bless thee, and magnify thy name, and thou shalt be blessed.",
        "3 I will bless them that bless thee, and curse them that curse thee, and IN THEE shall all the kindred of the earth be blessed:",
        "4a So Abram went out as the Lord had commanded him."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 33: 4-5, 18-19, 20, 22",
      "reference": "Psalms 33: 4-5, 18-19, 20, 22",
      "verses": [
        "R. (22) Lord, let your mercy be on us, as we place our trust in you.",
        "4 For the word of the Lord is right, and all his works are done with faithfulness.",
        "5 He loveth mercy and judgment; the earth is full of the mercy of the Lord.",
        "R. Lord, let your mercy be on us, as we place our trust in you.",
        "18 Behold the eyes of the Lord are on them that fear him: and on them that hope in his mercy.",
        "19 To deliver their souls from death; and feed them in famine.",
        "R. Lord, let your mercy be on us, as we place our trust in you.",
        "20 Our soul waiteth for the Lord: for he is our helper and protector.",
        "22 Let thy mercy, O Lord, be upon us, as we have hoped in thee.",
        "R. Lord, let your mercy be on us, as we place our trust in you."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Second Timothy 1: 8b-10",
      "reference": "Second Timothy 1: 8b-10",
      "verses": [
        "8b Be not thou therefore ashamed of the testimony of our Lord, nor of me his prisoner: but labour with the gospel, according to the power of God,",
        "9 Who hath delivered us and called us by his holy calling, not according to our works, but according to his own purpose and grace, which was given us in Christ Jesus before the times of the world.",
        "10 But is now made manifest by the illumination of our Saviour Jesus Christ, who hath destroyed death, and hath brought to light life and incorruption by the gospel:"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Verse Before the Gospel: Matthew 17: 5",
      "reference": "Verse Before the Gospel: Matthew 17: 5",
      "verses": [
        "5 From the shining cloud the Father’s voice is heard: This is my beloved Son, hear him."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 17: 1-9",
      "reference": "Matthew 17: 1-9",
      "verses": [
        "1 And after six days Jesus taketh unto him Peter and James, and John his brother, and bringeth them up into a high mountain apart:",
        "2 And he was transfigured before them. And his face did shine as the sun: and his garments became white as snow.",
        "3 And behold there appeared to them Moses and Elias talking with him.",
        "4 And Peter answering, said to Jesus: Lord, it is good for us to be here: if thou wilt, let us make here three tabernacles, one for thee, and one for Moses, and one for Elias.",
        "5 And as he was yet speaking, behold a bright cloud overshadowed them. And lo, a voice out of the cloud, saying: This is my beloved Son, in whom I am well pleased: hear ye him.",
        "6 And the disciples hearing, fell upon their face, and were very much afraid.",
        "7 And Jesus came and touched them: and said to them, Arise, and fear not.",
        "8 And they lifting up their eyes saw no one but only Jesus.",
        "9 And as they came down from the mountain, Jesus charged them, saying: Tell the vision to no man, till the Son of man be risen from the dead."
      ]
    }
  ]
}