{
  "date": "2026-03-02",
  "url": "https://www.catholicgallery.org/mass-reading/020326/",
  "title": "Daily Mass Readings for Monday, 2 March 2026",
  "feast": "Lenten Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Daniel 9: 4b-10",
      "reference": "Daniel 9: 4b-10",
      "verses": [
        "4b O Lord God, great and terrible, who keepest the covenant, and mercy to them that love thee, and keep thy commandments.",
        "5 We have sinned, we have committed iniquity, we have done wickedly, and have revolted: and we have gone aside from thy commandments, and thy judgments.",
        "6 We have not hearkened to thy servants the prophets, that have spoken in thy name to our kings, to our princes, to our fathers, and to all the people of the land.",
        "7 To thee, O Lord, justice: but to us confusion of face, as at this day to the men of Juda, and to the inhabitants of Jerusalem, and to all Israel to them that are near, and to them that are far off in all the countries whither thou hast driven them, for their iniquities by which they have sinned against thee.",
        "8 O Lord, to us belongeth confusion of face, to our princes, and to our fathers that have sinned.",
        "9 But to thee, the Lord our God, mercy and forgiveness, for we have departed from thee:",
        "10 And we have not hearkened to the voice of the Lord our God, to walk in his law, which he set before us by his servants the prophets."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 79: 8, 9, 11 and 13",
      "reference": "Psalms 79: 8, 9, 11 and 13",
      "verses": [
        "R. (103: 10a) Lord, do not deal with us according to our sins.",
        "8 Remember not our former iniquities: let thy mercies speedily prevent us, for we are become exceeding poor.",
        "R. Lord, do not deal with us according to our sins.",
        "9 Help us, O God, our saviour: and for the glory of thy name, O Lord, deliver us: and forgive us our sins for thy name’s sake:",
        "R. Lord, do not deal with us according to our sins.",
        "11 Let the sighing of the prisoners come in before thee. According to the greatness of thy arm, take possession of the children of them that have been put to death.",
        "R. Lord, do not deal with us according to our sins.",
        "13 But we thy people, and the sheep of thy pasture, will give thanks to thee for ever. We will shew forth thy praise, unto generation and generation.",
        "R. Lord, do not deal with us according to our sins."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Verse Before the Gospel: John 6: 63c, 68c",
      "reference": "Verse Before the Gospel: John 6: 63c, 68c",
      "verses": [
        "63c, 68cYour words, Lord, are Spirit and life; you have the words of everlasting life."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 6: 36-38",
      "reference": "Luke 6: 36-38",
      "verses": [
        "36 Be ye therefore merciful, as your Father also is merciful.",
        "37 Judge not, and you shall not be judged. Condemn not, and you shall not be condemned. Forgive, and you shall be forgiven.",
        "38 Give, and it shall be given to you: good measure and pressed down and shaken together and running over shall they give into your bosom. For with the same measure that you shall mete withal, it shall be measured to you again."
      ]
    }
  ]
}