{
  "date": "2026-03-09",
  "url": "https://www.catholicgallery.org/mass-reading/090326/",
  "title": "Daily Mass Readings for Monday, 9 March 2026",
  "feast": "Lenten Weekday/ Frances of Rome, Married Woman, Religious Founder",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Kings 5: 1-15",
      "reference": "Second Kings 5: 1-15",
      "verses": [
        "1 Naaman, general of the army of the king of Syria, was a great man with his master, and honourable: for by him the Lord gave deliverance to Syria: and he was a valiant man and rich, but a leper.",
        "2 Now there had gone out robbers from Syria, and had led away captive out of the land of Israel a little maid, and she waited upon Naaman’s wife.",
        "3 And she said to her mistress: I wish my master had been with the prophet, that is in Samaria: he would certainly have healed him of the leprosy which he hath.",
        "4 Then Naaman went in to his lord, and told him, saying: Thus and thus said tile girl from the land of Israel.",
        "5 And the king of Syria sad to him: Go, and I will send a letter to the king of Israel. And he departed, and took with him ten talents of silver, and six thousand pieces of gold, and tell changes of raiment,",
        "6 And brought the letter to the king of Israel, in these words: When thou shalt receive this letter, know that I have sent to thee Naaman my servant, that thou mayest heal him of his leprosy.",
        "7 And when the king of Israel had read the letter, he rent his garments, and said: Am I God, to be able to kill and give life, that this man hath sent to me, to heal a man of his leprosy? mark, and see how he seeketh occasions against me.",
        "8 And when Eliseus the man of God had heard this, to wit, that the king of Israel had rent his garments, he sent to him, saying: Why hast thou rent thy garments? let him come to me, and let him know that there is a prophet in Israel.",
        "9 So Naaman came with his horses and chariots, and stood at the door of the house of Eliseus:",
        "10 And Eliseus sent a messenger to him, saying: Go, and wash seven times in the Jordan, and thy flesh shall recover health, and thee shalt be clean.",
        "11 Naaman was angry and went away, saying: I thought he would hare come out to me, and standing would hare invoked the name of the Lord his God, and touched with his hand the place of the leprosy, and healed me.",
        "12 Are not the Abana, and the Pharphar, rivers of Damascus, better than all the waters of Israel, that I may wash in them, and be made clean? So as he turned, and was going away with indignation,",
        "13 His servants came to him, and said to him: Father, if the prophet had bid thee do some great thing, surely thou shouldst have done it: how much rather what he now hath said to thee: Wash, and thou shalt he clean?",
        "14 Then he went down, and washed in the Jordan seven times: according to the word of the man of God, and his flesh was restored, like the flesh of a little child, and he was made clean.",
        "15 And returning to the man of God with all his train, be came, and stood before him, and said: In truth, I know there is no other God in all the earth, but only in Israel."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 42: 2, 3; 43: 3, 4",
      "reference": "Psalms 42: 2, 3; 43: 3, 4",
      "verses": [
        "R. (42:3) Athirst is my soul for the living God. When shall I go and behold the face of God?",
        "2 As the hart panteth after the fountains of water; so my soul panteth after thee, O God.",
        "R. Athirst is my soul for the living God. When shall I go and behold the face of God?",
        "3 My soul hath thirsted after the strong living God; when shall I come and appear before the face of God?",
        "R. Athirst is my soul for the living God. When shall I go and behold the face of God?",
        "43:3 Send forth thy light and thy truth: they have conducted me, and brought me unto thy holy hill, and into thy tabernacles.",
        "R. Athirst is my soul for the living God. When shall I go and behold the face of God?",
        "4 And I will go in to the altar of God: to God who giveth joy to my youth. To thee, O God my God, I will give praise upon the harp: why art thou sad, O my soul?",
        "R. Athirst is my soul for the living God. When shall I go and behold the face of God?"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Verse Before the Gospel: Psalms 130: 5, 7",
      "reference": "Verse Before the Gospel: Psalms 130: 5, 7",
      "verses": [
        "5, 7 I hope in the LORD, I trust in his word; with him there is kindness and plenteous redemption."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 4: 24-30",
      "reference": "Luke 4: 24-30",
      "verses": [
        "24 And he said: Amen I say to you, that no prophet is accepted in his own country.",
        "25 In truth I say to you, there were many widows in the days of Elias in Israel, when heaven was shut up three years and six months, when there was a great famine throughout all the earth.",
        "26 And to none of them was Elias sent, but to Sarepta of Sidon, to a widow woman.",
        "27 And there were many lepers in Israel in the time of Eliseus the prophet: and none of them was cleansed but Naaman the Syrian.",
        "28 And all they in the synagogue, hearing these things, were filled with anger.",
        "29 And they rose up and thrust him out of the city; and they brought him to the brow of the hill, whereon their city was built, that they might cast him down headlong.",
        "30 But he passing through the midst of them, went his way."
      ]
    }
  ]
}