{
  "date": "2026-03-26",
  "url": "https://www.catholicgallery.org/mass-reading/260326/",
  "title": "Daily Mass Readings for Thursday, 26 March 2026",
  "feast": "Lenten Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Genesis 17: 3-9",
      "reference": "Genesis 17: 3-9",
      "verses": [
        "3 Abram fell flat on his face.",
        "4 And God said to him: I AM, and my covenant is with thee, and thou shalt be a father of many nations.",
        "5 Neither shall thy name be called any more Abram: but thou shalt be called Abraham: because I have made thee a father of many nations.",
        "6 And I will make thee increase, exceedingly, and I will make nations of thee, and kings shall come out of thee.",
        "7 And I will establish my covenant between me and thee, and between thy seed after thee in their generations, by a perpetual covenant: to be a God to thee, and to thy seed after thee.",
        "8 And I will give to thee, and to thy seed, the land of thy sojournment, all the land of Chanaan for a perpetual possession, and I will be their God.",
        "9 Again God said to Abraham: And thou therefore shalt keep my covenant, and thy seed after thee in their generations."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 105: 4-5, 6-7, 8-9",
      "reference": "Psalms 105: 4-5, 6-7, 8-9",
      "verses": [
        "R. (8a) The Lord remembers his covenant for ever.",
        "4 Seek ye the Lord, and be strengthened: seek his face evermore.",
        "5 Remember his marvellous works which he hath done; his wonders, and the judgments of his mouth.",
        "R. The Lord remembers his covenant for ever.",
        "6 O ye seed of Abraham his servant; ye sons of Jacob his chosen.",
        "7 He is the Lord our God: his judgments are in all the earth.",
        "R. The Lord remembers his covenant for ever.",
        "8 He hath remembered his covenant for ever: the word which he commanded to a thousand generations.",
        "9 Which he made to Abraham; and his oath to Isaac:",
        "R. The Lord remembers his covenant for ever."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Verse Before the Gospel: Psalms 95: 8",
      "reference": "Verse Before the Gospel: Psalms 95: 8",
      "verses": [
        "8 If today you hear his voice, harden not your hearts."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 8: 51-59",
      "reference": "John 8: 51-59",
      "verses": [
        "51 Amen, amen I say to you: If any man keep my word, he shall not see death for ever.",
        "52 The Jews therefore said: Now we know that thou hast a devil. Abraham is dead, and the prophets; and thou sayest: If any man keep my word, he shall not taste death for ever.",
        "53 Art thou greater than our father Abraham, who is dead? and the prophets are dead. Whom dost thou make thyself?",
        "54 Jesus answered: If I glorify myself, my glory is nothing. It is my Father that glorifieth me, of whom you say that he is your God.",
        "55 And you have not known him, but I know him. And if I shall say that I know him not, I shall be like to you, a liar. But I do know him, and do keep his word.",
        "56 Abraham your father rejoiced that he might see my day: he saw it, and was glad.",
        "57 The Jews therefore said to him: Thou art not yet fifty years old, and hast thou seen Abraham?",
        "58 Jesus said to them: Amen, amen I say to you, before Abraham was made, I am.",
        "59 They took up stones therefore to cast at him. But Jesus hid himself, and went out of the temple."
      ]
    }
  ]
}