{
  "date": "2026-07-24",
  "url": "https://www.catholicgallery.org/mass-reading/240726/",
  "title": "Daily Mass Readings for Friday, 24 July 2026",
  "feast": "Ordinary Weekday/ Sharbel Makhluf, Priest",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Jeremiah 3: 14-17",
      "reference": "Jeremiah 3: 14-17",
      "verses": [
        "14 Return, O ye revolting children, saith the Lord: for I am your husband: and I will take you, one of a city, and two of a kindred, and will bring you into Sion.",
        "15 And I will give you pastors according to my own heart, and they shall feed you with knowledge and doctrine.",
        "16 And when you shall be multiplied, and increase in the land in those days, saith the Lord, they shall say no more: The ark of the covenant of the Lord: neither shall it come upon the heart, neither shall they remember it, neither shall it be visited, neither shall that be done any more.",
        "17 At that time Jerusalem shall be called the thrown of the Lord: and all the nations shall be gathered together to it, in the name of the Lord to Jerusalem, and they shall not walk after the perversity of their most wicked heart."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Jeremiah 31: 10, 11-12abcd, 13",
      "reference": "Jeremiah 31: 10, 11-12abcd, 13",
      "verses": [
        "R. (10d) The Lord will guard us as a shepherd guards his flock.",
        "10 Hear the word of the Lord, O ye nations, and declare it in the islands that are afar off, and say: He that scattered Israel will gather him: and he will keep him as the shepherd doth his flock.",
        "R. The Lord will guard us as a shepherd guards his flock.",
        "11 For the Lord hath redeemed Jacob, and delivered him out of the hand of one that was mightier than he.",
        "12abcd And they shall come, and shall give praise in mount Sion: and they shall flow together to the good things of the Lord, for the corn, and wine, and oil, and the increase of cattle and herds.",
        "R. The Lord will guard us as a shepherd guards his flock.",
        "13 Then shall the virgin rejoice in the dance, the young men and old men together: and I will turn their mourning into joy, and will comfort them, and make them joyful after their sorrow.",
        "R. The Lord will guard us as a shepherd guards his flock."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 8: 15",
      "reference": "Luke 8: 15",
      "verses": [
        "R. Alleluia, alleluia.",
        "15 Blessed are they who have kept the word with a generous heart and yield a harvest through perseverance.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 13: 18-23",
      "reference": "Matthew 13: 18-23",
      "verses": [
        "18 Hear you therefore the parable of the sower.",
        "19 When any one heareth the word of the kingdom, and understandeth it not, there cometh the wicked one, and catcheth away that which was sown in his heart: this is he that received the seed by the way side.",
        "20 And he that received the seed upon stony ground, is he that heareth the word, and immediately receiveth it with joy.",
        "21 Yet hath he not root in himself, but is only for a time: and when there ariseth tribulation and persecution because of the word, he is presently scandalized.",
        "22 And he that received the seed among thorns, is he that heareth the word, and the care of this world and the deceitfulness of riches choketh up the word, and he becometh fruitless.",
        "23 But he that received the seed upon good ground, is he that heareth the word, and understandeth, and beareth fruit, and yieldeth the one an hundredfold, and another sixty, and another thirty."
      ]
    }
  ]
}