{
  "date": "2026-07-21",
  "url": "https://www.catholicgallery.org/mass-reading/210726/",
  "title": "Daily Mass Readings for Tuesday, 21 July 2026",
  "feast": "Ordinary Weekday/ Lawrence of Brindisi, Priest, Religious, Doctor",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Micah 7: 14-15, 18-20",
      "reference": "Micah 7: 14-15, 18-20",
      "verses": [
        "14 Feed thy people with thy rod, the flock of thy inheritance, them that dwell alone in the forest, in the midst of Carmel: they shall feed in Basan and Galaad according to the days of old.",
        "15 According to the days of thy coming out of the land of Egypt I will shew him wonders.",
        "18 Who is a God like to thee, who takest away iniquity, and passest by the sin of the remnant of thy inheritance? he will send his fury in no more, because he delighteth in mercy.",
        "19 He will turn again, and have mercy on us: he will put away our iniquities: and he will cast all our sins into the bottom of the sea.",
        "20 Thou wilt perform the truth of Jacob, the mercy to Abraham: which thou hast sworn to our fathers from the days of old."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 85: 2-4, 5-6, 7-8",
      "reference": "Psalms 85: 2-4, 5-6, 7-8",
      "verses": [
        "R. (8a) Lord, show us your mercy and love.",
        "2 Lord, thou hast blessed thy land: thou hast turned away the captivity of Jacob.",
        "3 Thou hast forgiven the iniquity of thy people: thou hast covered all their sins.",
        "4 Thou hast mitigated all thy anger: thou hast turned away from the wrath of thy indignation.",
        "R. Lord, show us your mercy and love.",
        "5 Convert us, O God our saviour: and turn off thy anger from us.",
        "6 Wilt thou be angry with us for ever: or wilt thou extend thy wrath from generation to generation?",
        "R. Lord, show us your mercy and love.",
        "7 Thou wilt turn, O God, and bring us to life: and thy people shall rejoice in thee.",
        "8 shew us, O Lord, thy mercy; and grant us thy salvation.",
        "R. Lord, show us your mercy and love."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 23",
      "reference": "John 14: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Whoever loves me will keep my word, and my Father will love him and we will come to him.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 12: 46-50",
      "reference": "Matthew 12: 46-50",
      "verses": [
        "46 As he was yet speaking to the multitudes, behold his mother and his brethren stood without, seeking to speak to him.",
        "47 And one said unto him: Behold thy mother and thy brethren stand without, seeking thee.",
        "48 But he answering him that told him, said: Who is my mother, and who are my brethren?",
        "49 And stretching forth his hand towards his disciples, he said: Behold my mother and my brethren.",
        "50 For whosoever shall do the will of my Father, that is in heaven, he is my brother, and sister, and mother."
      ]
    }
  ]
}