{
  "date": "2026-07-26",
  "url": "https://www.catholicgallery.org/mass-reading/260726/",
  "title": "Daily Mass Readings for Sunday, 26 July 2026",
  "feast": "Seventeenth Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Kings 3: 5, 7-12",
      "reference": "First Kings 3: 5, 7-12",
      "verses": [
        "5 And the Lord appeared to Solomon in a dream by night, saying: Ask what thou wilt that I should give thee.",
        "7 And now, O Lord God, thou hast made thy servant king instead of David my father: and I am but a child, and know not how to go out and come in.",
        "8 And thy servant is in the midst of the people which thou hast chosen, an immense people, which cannot be numbered nor counted for multitude.",
        "9 Give therefore to thy servant an understanding heart, to judge thy people, and discern between good and evil. For who shall be able to judge this people, thy people which is so numerous?",
        "10 And the word was pleasing to the Lord that Solomon had asked such a thing.",
        "11 And the Lord said to Solomon: Because thou hast asked this thing, and hast not asked for thyself long life or riches, nor the lives of thy enemies, but hast asked for thyself wisdom to discern judgment,",
        "12 Behold I have done for thee according to thy words, and have given thee a wise and understanding heart, insomuch that there hath been no one like thee before thee, nor shall arise after thee."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 119: 57, 72, 76-77, 127-128, 129-130",
      "reference": "Psalms 119: 57, 72, 76-77, 127-128, 129-130",
      "verses": [
        "R. (97a) Lord, I love your commands.",
        "57 O Lord, my portion, I have said, I would keep the law.",
        "72 The law of thy mouth is good to me, above thousands of gold and silver.",
        "R. Lord, I love your commands.",
        "76 O! let thy mercy be for my comfort, according to thy word unto thy servant.",
        "77 Let thy tender mercies come unto me, and I shall live: for thy law is my meditation.",
        "R. Lord, I love your commands.",
        "127 Therefore have I loved thy commandments above gold and the topaz.",
        "128 Therefore was I directed to all thy commandments: I have hated all wicked ways.",
        "R. Lord, I love your commands.",
        "129 PHE. Thy testimonies are wonderful: therefore my soul hath sought them.",
        "130 The declaration of thy words giveth light: and giveth understanding to little ones.",
        "R. Lord, I love your commands."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Romans 8: 28-30",
      "reference": "Romans 8: 28-30",
      "verses": [
        "28 And we know that to them that love God, all things work together unto good, to such as, according to his purpose, are called to be saints.",
        "29 For whom he foreknew, he also predestinated to be made conformable to the image of his Son; that he might be the firstborn amongst many brethren.",
        "30 And whom he predestinated, them he also called. And whom he called, them he also justified. And whom he justified, them he also glorified."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 11: 25",
      "reference": "Matthew 11: 25",
      "verses": [
        "R. Alleluia, alleluia.",
        "25 Blessed are you, Father, Lord of heaven and earth; for you have revealed to little ones the mysteries of the kingdom.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 13: 44-52",
      "reference": "Matthew 13: 44-52",
      "verses": [
        "44 The kingdom of heaven is like unto a treasure hidden in a field. Which a man having found, hid it, and for joy thereof goeth, and selleth all that he hath, and buyeth that field.",
        "45 Again the kingdom of heaven is like to a merchant seeking good pearls.",
        "46 Who when he had found one pearl of great price, went his way, and sold all that he had, and bought it.",
        "47 Again the kingdom of heaven is like to a net cast into the sea, and gathering together of all kind of fishes.",
        "48 Which, when it was filled, they drew out, and sitting by the shore, they chose out the good into vessels, but the bad they cast forth.",
        "49 So shall it be at the end of the world. The angels shall go out, and shall separate the wicked from among the just.",
        "50 And shall cast them into the furnace of fire: there shall be weeping and gnashing of teeth.",
        "51 Have ye understood all these things? They say to him: Yes.",
        "52 He said unto them: Therefore every scribe instructed in the kingdom of heaven, is like to a man that is a householder, who bringeth forth out of his treasure new things and old."
      ]
    }
  ]
}