{
  "date": "2026-07-14",
  "url": "https://www.catholicgallery.org/mass-reading/140726/",
  "title": "Daily Mass Readings for Tuesday, 14 July 2026",
  "feast": "Blessed Kateri Tekakwitha, Virgin Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 7: 1-9",
      "reference": "Isaiah 7: 1-9",
      "verses": [
        "1 And it came to pass in the days of Achaz the son of Joathan, the son of Ozias, king of Juda, that Basin king of Syria, and Phacee the son of Romelia king of Israel, came up to Jerusalem, to fight against it: but they could not prevail over it.",
        "2 And they told the house of David, saying: Syria hath rested upon Ephraim, and his heart was moved, and the heart of his people, as the trees of the woods are moved with the wind.",
        "3 And the Lord said to Isaias: Go forth to meet Achaz, thou and Jasub thy son that is left, to the conduit of the upper pool, a in the way of the fuller’s held.",
        "4 And thou shalt say to him: See thou be quiet: fear not, and let not thy heart be afraid of the two tails of these fire brands, smoking with the wrath of the fury of Rasin king of Syria, and of the son of Romelia.",
        "5 Because Syria hath taken counsel against thee, unto the evil of Ephraim and the son of Romelia, saying:",
        "6 Let us go up to Juda, and rouse it up, and draw it away to us, and make the son of Tabeel king in the midst thereof.",
        "7 Thus saith the Lord God: It shall not stand, and this shall not be.",
        "8 But the head of Syria is Damascus, and the head of Damascus is Basin: and within threescore and five years, Ephraim shall cease to be a people:",
        "9 And the head of Ephraim is Samaria and the head of Samaria the son of Romelia. If you will not believe, you shall not continue."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 48: 2-3a, 3b-4, 5-6, 7-8",
      "reference": "Psalms 48: 2-3a, 3b-4, 5-6, 7-8",
      "verses": [
        "R. (9d) God upholds his city for ever.",
        "2 Great is the Lord, and exceedingly to be praised in the city of our God, in his holy mountain.",
        "3a With the joy of the whole earth is mount Sion founded.",
        "R. God upholds his city for ever.",
        "3b On the sides of the north, the city of the great king.",
        "4 In her houses shall God be known, when he shall protect her.",
        "R. God upholds his city for ever.",
        "5 For behold the kings of the earth assembled themselves: they gathered together.",
        "6 So they saw, and they wondered, they were troubled, they were moved:",
        "R. God upholds his city for ever.",
        "7 Trembling took hold of them. There were pains as of a woman in labour.",
        "8 With a vehement wind thou shalt break in pieces the ships of Tharsis.",
        "R. God upholds his city for ever."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Psalms 95: 8",
      "reference": "Psalms 95: 8",
      "verses": [
        "R. Alleluia, alleluia.",
        "8 If today you hear his voice, harden not your hearts.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 11: 20-24",
      "reference": "Matthew 11: 20-24",
      "verses": [
        "20 Then began he to upbraid the cities wherein were done the most of his miracles, for that they had not done penance.",
        "21 Woe to thee, Corozain, woe to thee, Bethsaida: for if in Tyre and Sidon had been wrought the miracles that have been wrought in you, they had long ago done penance in sackcloth and ashes.",
        "22 But I say unto you, it shall be more tolerable for Tyre and Sidon in the day of judgment, than for you.",
        "23 And thou Capharnaum, shalt thou be exalted up to heaven? thou shalt go down even unto hell. For if in Sodom had been wrought the miracles that have been wrought in thee, perhaps it had remained unto this day.",
        "24 But I say unto you, that it shall be more tolerable for the land of Sodom in the day of judgment, than for thee."
      ]
    }
  ]
}