{
  "date": "2026-07-03",
  "url": "https://www.catholicgallery.org/mass-reading/030726/",
  "title": "Daily Mass Readings for Friday, 3 July 2026",
  "feast": "Thomas, Apostle Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ephesians 2: 19-22",
      "reference": "Ephesians 2: 19-22",
      "verses": [
        "19 Now therefore you are no more strangers and foreigners; but you are fellow citizens with the saints, and the domestics of God,",
        "20 Built upon the foundation of the apostles and prophets, Jesus Christ himself being the chief corner stone:",
        "21 In whom all the building, being framed together, groweth up into an holy temple in the Lord.",
        "22 In whom you also are built together into an habitation of God in the Spirit."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 117: 1bc, 2",
      "reference": "Psalms 117: 1bc, 2",
      "verses": [
        "R. (Mark 16:15) Go out to all the world and tell the Good News.",
        "1bc O praise the Lord, all ye nations: praise him, all ye people.",
        "R. Go out to all the world and tell the Good News.",
        "2 For his mercy is confirmed upon us: and the truth of the Lord remaineth for ever.",
        "R. Go out to all the world and tell the Good News."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 20: 29",
      "reference": "John 20: 29",
      "verses": [
        "R. Alleluia, alleluia.",
        "29 You believe in me, Thomas, because you have seen me, says the Lord; blessed are those who have not seen, but still believe!",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 20: 24-29",
      "reference": "John 20: 24-29",
      "verses": [
        "24 Now Thomas, one of the twelve, who is called Didymus, was not with them when Jesus came.",
        "25 The other disciples therefore said to him: We have seen the Lord. But he said to them: Except I shall see in his hands the print of the nails, and put my finger into the place of the nails, and put my hand into his side, I will not believe.",
        "26 And after eight days again his disciples were within, and Thomas with them. Jesus cometh, the doors being shut, and stood in the midst, and said: Peace be to you.",
        "27 Then he saith to Thomas: Put in thy finger hither, and see my hands; and bring hither thy hand, and put it into my side; and be not faithless, but believing.",
        "28 Thomas answered, and said to him: My Lord, and my God.",
        "29 Jesus saith to him: Because thou hast seen me, Thomas, thou hast believed: blessed are they that have not seen, and have believed."
      ]
    }
  ]
}