{
  "date": "2026-07-28",
  "url": "https://www.catholicgallery.org/mass-reading/280726/",
  "title": "Daily Mass Readings for Tuesday, 28 July 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Jeremiah 14: 17-22",
      "reference": "Jeremiah 14: 17-22",
      "verses": [
        "17 And thou shalt speak this word to them: Let my eyes shed down tears night and day, and let them not cease, because the virgin daughter of my people is afflicted with a great affliction, with an exceeding grievous evil.",
        "18 If I go forth into the fields, behold the slain with the sword: and if I enter into the city, behold them that are consumed with famine. The prophet also and the priest are gone into a land which they knew not.",
        "19 Hast thou utterly cast away Juda, or hath thy soul abhorred Sion? why then hast thou struck us, so that there is no healing for us? we have looked for peace, and there is no good: and for the time of healing, and behold trouble.",
        "20 We acknowledge, O Lord, our wickedness, the iniquities of our fathers, because we have sinned against thee.",
        "21 Give us not to be a reproach, for thy name’s sake, and do not disgrace in us the throne of thy glory: remember, break not thy covenant with us.",
        "22 Are there any among the graven things of the Gentiles that can send rain? or can the heavens give showers? art not thou the Lord our God, whom we have looked for? for thou hast made all these things."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 79: 8, 9, 11 and 13",
      "reference": "Psalms 79: 8, 9, 11 and 13",
      "verses": [
        "R. (9) For the glory of your name, O Lord, deliver us.",
        "8 Remember not our former iniquities: let thy mercies speedily prevent us, for we are become exceeding poor.",
        "R. For the glory of your name, O Lord, deliver us.",
        "9 Help us, O God, our saviour: and for the glory of thy name, O Lord, deliver us: and forgive us our sins for thy name’s sake:",
        "R. For the glory of your name, O Lord, deliver us.",
        "11 Let the sighing of the prisoners come in before thee. According to the greatness of thy arm, take possession of the children of them that have been put to death.",
        "R. For the glory of your name, O Lord, deliver us.",
        "13 But we thy people, and the sheep of thy pasture, will give thanks to thee for ever. We will shew forth thy praise, unto generation and generation.",
        "R. For the glory of your name, O Lord, deliver us."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia",
      "reference": "",
      "verses": [
        "R. Alleluia, alleluia.",
        "The seed is the word of God, Christ is the sower; all who come to him will live for ever.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 13: 36-43",
      "reference": "Matthew 13: 36-43",
      "verses": [
        "36 Then having sent away the multitudes, he came into the house, and his disciples came to him, saying: Expound to us the parable of the cockle of the field.",
        "37 Who made answer and said to them: He that soweth the good seed, is the Son of man.",
        "38 And the field, is the world. And the good seed are the children of the kingdom. And the cockle, are the children of the wicked one.",
        "39 And the enemy that sowed them, is the devil. But the harvest is the end of the world. And the reapers are the angels.",
        "40 Even as cockle therefore is gathered up, and burnt with fire: so shall it be at the end of the world.",
        "41 The Son of man shall send his angels, and they shall gather out of his kingdom all scandals, and them that work iniquity.",
        "42 And shall cast them into the furnace of fire: there shall be weeping and gnashing of teeth.",
        "43 Then shall the just shine as the sun, in the kingdom of their Father. He that hath ears to hear, let him hear."
      ]
    }
  ]
}