{
  "date": "2026-07-18",
  "url": "https://www.catholicgallery.org/mass-reading/180726/",
  "title": "Daily Mass Readings for Saturday, 18 July 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary/ Camillus De Lellis, Priest",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Micah 2: 1-5",
      "reference": "Micah 2: 1-5",
      "verses": [
        "1 Woe to you that devise that which is unprofitable, and work evil in your beds: in the morning light they execute it, because their hand is against God.",
        "2 And they have coveted fields, and taken them by violence, and houses they have forcibly taken away: and oppressed a man and his house, a man and his inheritance.",
        "3 Therefore thus saith the Lord: Behold, I devise an evil against this family: from which you shall not withdraw your necks, and you shall not walk haughtily, for this is a very evil time.",
        "4 In that day a parable shall be taken up upon you, and a song shall be sung with melody by them that say: We are laid waste and spoiled: the portion of my people is changed: how shall he depart from me, whereas he is returning that will divide our land?",
        "5 Therefore thou shalt have none that shall cast the cord of a lot in the assembly of the Lord."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 10: 1-2, 3-4, 7-8, 14",
      "reference": "Psalms 10: 1-2, 3-4, 7-8, 14",
      "verses": [
        "R. (12b) Do not forget the poor, O Lord!",
        "1 Why, O Lord, hast thou retired afar off? why dost thou slight us in our wants, in the time of trouble?",
        "2 Whilst the wicked man is proud, the poor is set on fire: they are caught in the counsels which they devise.",
        "R. Do not forget the poor, O Lord!",
        "3 For the sinner is praised in the desires of his soul: and the unjust man is blessed.",
        "4 The sinner hath provoked the Lord according to the multitude of his wrath he will not seek him:",
        "R. Do not forget the poor, O Lord!",
        "7 His mouth is full of cursing, and of bitterness, and of deceit: under his tongue are labour and sorrow.",
        "8 He sitteth in ambush with the rich in private places, that he may kill the innocent.",
        "R. Do not forget the poor, O Lord!",
        "14 Thou seest it, for thou considerest labour and sorrow: that thou mayst deliver them into thy hands. To thee is the poor man left: thou wilt be a helper to the orphan.",
        "R. Do not forget the poor, O Lord!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Second Corinthians 5: 19",
      "reference": "Second Corinthians 5: 19",
      "verses": [
        "R. Alleluia, alleluia.",
        "19 God was reconciling the world to himself in Christ, and entrusting to us the message of reconciliation.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 12: 14-21",
      "reference": "Matthew 12: 14-21",
      "verses": [
        "14 And the Pharisees going out made a consultation against him, how they might destroy him.",
        "15 But Jesus knowing it, retired from thence: and many followed him, and he healed them all.",
        "16 And he charged them that they should not make him known.",
        "17 That it might be fulfilled which was spoken by Isaias the prophet, saying:",
        "18 Behold my servant whom I have chosen, my beloved in whom my soul hath been well pleased. I will put my spirit upon him, and he shall shew judgment to the Gentiles.",
        "19 He shall not contend, nor cry out, neither shall any man hear his voice in the streets.",
        "20 The bruised reed he shall not break: and smoking flax he shall not extinguish: till he send forth judgment unto victory.",
        "21 And in his name the Gentiles shall hope."
      ]
    }
  ]
}