{
  "date": "2026-07-04",
  "url": "https://www.catholicgallery.org/mass-reading/040726/",
  "title": "Daily Mass Readings for Saturday, 4 July 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary/ Independence Day",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Amos 9: 11-15",
      "reference": "Amos 9: 11-15",
      "verses": [
        "11 In that day I will raise up the tabernacle of David, that is fallen: and I will close up the breaches of the walls thereof, and repair what was fallen: and I will rebuild it as in the days of old.",
        "12 That they may possess the remnant of Edom, and all nations, because my name is invoked upon them: saith the Lord that doth these things.",
        "13 Behold the days come, saith the Lord, when the ploughman shall overtake the reaper, and the treader of grapes him that soweth seed: and the mountains shall drop sweetness, and every hill shall be tilled.",
        "14 And I will bring back the captivity of my people Israel: and they shall build the abandoned cities, and inhabit them: and they shall plant vineyards, and drink the wine of them: and shall make gardens, and eat the fruits of them.",
        "15 And I will plant them upon their own land: and I will no more pluck them out of their land which I have given them, saith the Lord thy God."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 85: 9ab and 10, 11-12, 13-14",
      "reference": "Psalms 85: 9ab and 10, 11-12, 13-14",
      "verses": [
        "R. (9b) The Lord speaks of peace to his people.",
        "9ab I will hear what the Lord God will speak in me: for he will speak peace unto his people.",
        "10 Surely his salvation is near to them that fear him: that glory may dwell in our land.",
        "R. The Lord speaks of peace to his people.",
        "11 Mercy and truth have met each other: justice and peace have kissed.",
        "12 Truth is sprung out of the earth: and justice hath looked down from heaven.",
        "R. The Lord speaks of peace to his people.",
        "13 For the Lord will give goodness: and our earth shall yield her fruit.",
        "14 Justice shall walk before him: and shall set his steps in the way.",
        "R. The Lord speaks of peace to his people."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 10: 27",
      "reference": "John 10: 27",
      "verses": [
        "R. Alleluia, alleluia.",
        "27 My sheep hear my voice, says the Lord; I know them, and they follow me.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 9: 14-17",
      "reference": "Matthew 9: 14-17",
      "verses": [
        "14 Then came to him the disciples of John, saying: Why do we and the Pharisees fast often, but thy disciples do not fast?",
        "15 And Jesus said to them: Can the children of the bridegroom mourn, as long as the bridegroom is with them? But the days will come, when the bridegroom shall be taken away from them, and then they shall fast.",
        "16 And nobody putteth a piece of raw cloth unto an old garment. For it taketh away the fullness thereof from the garment, and there is made a greater rent.",
        "17 Neither do they put new wine into old bottles. Otherwise the bottles break, and the wine runneth out, and the bottles perish. But new wine they put into new bottles: and both are preserved."
      ]
    }
  ]
}