{
  "date": "2026-07-06",
  "url": "https://www.catholicgallery.org/mass-reading/060726/",
  "title": "Daily Mass Readings for Monday, 6 July 2026",
  "feast": "Ordinary Weekday/ Maria Goretti, Virgin, Martyr",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Hosea 2: 16, 17c-18, 21-22",
      "reference": "Hosea 2: 16, 17c-18, 21-22",
      "verses": [
        "16 Therefore, behold I will allure her, and will lead her into the wilderness: and I will speak to her heart.",
        "17c She shall sing there according to the days of her youth, and according to the days of her coming up out of the land of Egypt.",
        "18 And it shall be in that day, saith the Lord, That she shall call me: My husband, and she shall call me no more Baali.",
        "21 And I will espouse thee to me for ever: and I will espouse thee to me in justice, and judgment, and in mercy, and in commiserations.",
        "22 And I will espouse thee to me in faith: and thou shalt know that I am the Lord."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 145: 2-3, 4-5, 6-7, 8-9",
      "reference": "Psalms 145: 2-3, 4-5, 6-7, 8-9",
      "verses": [
        "R. (8a) The Lord is gracious and merciful.",
        "2 Every day I will bless thee: and I will praise thy name for ever; yea, for ever and ever.",
        "3 Great is the Lord, and greatly to be praised: and of his greatness there is no end.",
        "R. The Lord is gracious and merciful.",
        "4 Generation and generation shall praise thy works: and they shall declare thy power.",
        "5 They shall speak of the magnificence of the glory of thy holiness: and shall tell thy wondrous works.",
        "R. The Lord is gracious and merciful.",
        "6 And they shall speak of the might of thy terrible acts: and shall declare thy greatness.",
        "7 They shall publish the memory of the abundance of thy sweetness: and shall rejoice in thy justice.",
        "R. The Lord is gracious and merciful.",
        "8 The Lord is gracious and merciful: patient and plenteous in mercy.",
        "9 The Lord is sweet to all: and his tender mercies are over all his works.",
        "R. The Lord is gracious and merciful."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Second Timothy 1: 10",
      "reference": "Second Timothy 1: 10",
      "verses": [
        "R. Alleluia, alleluia.",
        "10 Our Savior Jesus Christ has destroyed death and brought life to light through the Gospel.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 9: 18-26",
      "reference": "Matthew 9: 18-26",
      "verses": [
        "18 As he was speaking these things unto them, behold a certain ruler came up, and adored him, saying: Lord, my daughter is even now dead; but come, lay thy hand upon her, and she shall live.",
        "19 And Jesus rising up followed him, with his disciples.",
        "20 And behold a woman who was troubled with an issue of blood twelve years, came behind him, and touched the hem of his garment.",
        "21 For she said within herself: If I shall touch only his garment, I shall be healed.",
        "22 But Jesus turning and seeing her, said: Be of good heart, daughter, thy faith hath made thee whole. And the woman was made whole from that hour.",
        "23 And when Jesus was come into the house of the ruler, and saw the minstrels and the multitude making a rout,",
        "24 He said: Give place, for the girl is not dead, but sleepeth. And they laughed him to scorn.",
        "25 And when the multitude was put forth, he went in, and took her by the hand. And the maid arose.",
        "26 And the fame hereof went abroad into all that country."
      ]
    }
  ]
}