{
  "date": "2026-07-25",
  "url": "https://www.catholicgallery.org/mass-reading/250726/",
  "title": "Daily Mass Readings for Saturday, 25 July 2026",
  "feast": "James, Apostle Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Corinthians 4: 7-15",
      "reference": "Second Corinthians 4: 7-15",
      "verses": [
        "7 But we have this treasure in earthen vessels, that the excellency may be of the power of God, and not of us.",
        "8 In all things we suffer tribulation, but are not distressed; we are straitened, but are not destitute;",
        "9 We suffer persecution, but are not forsaken; we are cast down, but we perish not:",
        "10 Always bearing about in our body the mortification of Jesus, that the life also of Jesus may be made manifest in our bodies.",
        "11 For we who live are always delivered unto death for Jesus’ sake; that the life also of Jesus may be made manifest in our mortal flesh.",
        "12 So then death worketh in us, but life in you.",
        "13 But having the same spirit of faith, as it is written: I believed, for which cause I have spoken; we also believe, for which cause we speak also:",
        "14 Knowing that he who raised up Jesus, will raise us up also with Jesus, and place us with you.",
        "15 For all things are for your sakes; that the grace abounding through many, may abound in thanksgiving unto the glory of God."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 126: 1bc-2ab, 2cd-3, 4-5, 6",
      "reference": "Psalms 126: 1bc-2ab, 2cd-3, 4-5, 6",
      "verses": [
        "R. (5) Those who sow in tears shall reap rejoicing.",
        "1bc When the lord brought back the captivity of Sion, we became like men comforted.",
        "2ab Then was our mouth filled with gladness; and our tongue with joy.",
        "R. Those who sow in tears shall reap rejoicing.",
        "2cd Then shall they say among the Gentiles: The Lord hath done great things for them.",
        "3 The Lord hath done great things for us: we are become joyful.",
        "R. Those who sow in tears shall reap rejoicing.",
        "4 Turn again our captivity, O Lord, as a stream in the south.",
        "5 They that sow in tears shall reap in joy.",
        "R. Those who sow in tears shall reap rejoicing.",
        "6 Going they went and wept, casting their seeds. But coming they shall come with joyfulness, carrying their sheaves.",
        "R. Those who sow in tears shall reap rejoicing."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 15: 16",
      "reference": "John 15: 16",
      "verses": [
        "R. Alleluia, alleluia.",
        "16 I chose you from the world, to go and bear fruit that will last, says the Lord.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 20: 20-28",
      "reference": "Matthew 20: 20-28",
      "verses": [
        "20 Then came to him the mother of the sons of Zebedee with her sons, adoring and asking something of him.",
        "21 Who said to her: What wilt thou? She saith to him: Say that these my two sons may sit, the one on thy right hand, and the other on thy left, in thy kingdom.",
        "22 And Jesus answering, said: You know not what you ask. Can you drink the chalice that I shall drink? They say to him: We can.",
        "23 He saith to them: My chalice indeed you shall drink; but to sit on my right or left hand, is not mine to give to you, but to them for whom it is prepared by my Father.",
        "24 And the ten hearing it, were moved with indignation against the two brethren.",
        "25 But Jesus called them to him, and said: You know that the princes of the Gentiles lord it over them; and they that are the greater, exercise power upon them.",
        "26 It shall not be so among you: but whosoever will be the greater among you, let him be your minister:",
        "27 And he that will be first among you, shall be your servant.",
        "28 Even as the Son of man is not come to be ministered unto, but to minister, and to give his life a redemption for many."
      ]
    }
  ]
}