{
  "date": "2026-07-15",
  "url": "https://www.catholicgallery.org/mass-reading/150726/",
  "title": "Daily Mass Readings for Wednesday, 15 July 2026",
  "feast": "Bonaventure, Bishop, Religious, Doctor Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 10: 5-7, 13b-16",
      "reference": "Isaiah 10: 5-7, 13b-16",
      "verses": [
        "5 Woe to the Assyrian, he is the rod and the staff of my anger, and my indignation is in their hands.",
        "6 I will send him to a deceitful nation, and I will give him a charge against the people of my wrath, to take away the spoils, and to lay hold on the prey, and to tread them down like the mire of the streets.",
        "7 But he shall not take it so, and his heart shall not think so: but his heart shall be set to destroy, and to cut off nations not a few.",
        "13b By the strength of my own hand I have done it, and by my own wisdom I have understood: and I have removed the bounds of the people, and have taken the spoils of the princes, and as a mighty man hath pulled down them that sat on high.",
        "14 And my hand hath found the strength of the people as a nest; and as eggs are gathered, that are left, so have I gathered all the earth: and there was none that moved the wing, or opened the mouth, or made the least noise.",
        "15 Shall the axe boast itself against him that cutteth with it? or shall the saw exalt itself against him by whom it is drawn? as if a rod should lift itself up against him that lifteth it up, and a staff exalt itself, which is but wood.",
        "16 Therefore the sovereign Lord, the Lord of hosts, shall send leanness among his fat ones: and under his glory shall be kindled a burning, as it were the burning of a fire."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 94: 5-6, 7-8, 9-10, 14-15",
      "reference": "Psalms 94: 5-6, 7-8, 9-10, 14-15",
      "verses": [
        "R. (14a) The Lord will not abandon his people.",
        "5 Thy people, O Lord, they have brought low: and they have afflicted thy inheritance.",
        "6 They have slain the widow and the stranger: and they have murdered the fatherless.",
        "R. The Lord will not abandon his people.",
        "7 And they have said: The Lord shall not see: neither shall the God of Jacob understand.",
        "8 Understand, ye senseless among the people: and, you fools, be wise at last.",
        "R. The Lord will not abandon his people.",
        "9 He that planted the ear, shall he not hear? or he that formed the eye, doth he not consider?",
        "10 He that chastiseth nations, shall he not rebuke: he that teacheth man knowledge?",
        "R. The Lord will not abandon his people.",
        "14 For the Lord will not cast off his people: neither will he forsake his own inheritance.",
        "15 Until justice be turned into judgment: and they that are near it are all the upright in heart.",
        "R. The Lord will not abandon his people."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 11: 25",
      "reference": "Matthew 11: 25",
      "verses": [
        "R. Alleluia, alleluia.",
        "25 Blessed are you, Father, Lord of heaven and earth, you have revealed to little ones the mysteries of the Kingdom.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 11: 25-27",
      "reference": "Matthew 11: 25-27",
      "verses": [
        "25 At that time Jesus answered and said: I confess to thee, O Father, Lord of heaven and earth, because thou hast hid these things from the wise and prudent, and hast revealed them to the little ones.",
        "26 Yea, Father; for so hath it seemed good in thy sight.",
        "27 All things are delivered to me by my Father. And no one knoweth the Son, but the Father: neither doth any one know the Father, but the Son, and he to whom it shall please the Son to reveal him."
      ]
    }
  ]
}