{
  "date": "2026-07-19",
  "url": "https://www.catholicgallery.org/mass-reading/190726/",
  "title": "Daily Mass Readings for Sunday, 19 July 2026",
  "feast": "Sixteenth Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Wisdom 12: 13, 16-19",
      "reference": "Wisdom 12: 13, 16-19",
      "verses": [
        "13 For there is no other God but thou, who hast care of all, that thou shouldst shew that thou dost not give judgment unjustly.",
        "16 For thy power is the beginning of justice: and because thou art Lord of all, thou makest thyself gracious to all.",
        "17 For thou shewest thy power, when men will not believe thee to be absolute in power, and thou convincest the boldness of them that know thee not.",
        "18 But thou being master of power, judgest with tranquillity; and with great favour disposest of us: for thy power is at hand when thou wilt.",
        "19 But thou hast taught thy people by such works, that they must be just and humane, and hast made thy children to be of a good hope: because in judging thou givest place for repentance for sins."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 86: 5-6, 9-10, 15-16",
      "reference": "Psalms 86: 5-6, 9-10, 15-16",
      "verses": [
        "R. (5a) Lord, you are good and forgiving.",
        "5 For thou, O Lord, art sweet and mild: and plenteous in mercy to all that call upon thee.",
        "6 Give ear, O Lord, to my prayer: and attend to the voice of my petition.",
        "R. Lord, you are good and forgiving.",
        "9 All the nations thou hast made shall come and adore before thee, O Lord: and they shall glorify thy name.",
        "10 For thou art great and dost wonderful things: thou art God alone.",
        "R. Lord, you are good and forgiving.",
        "15 And thou, O Lord, art a God of compassion, and merciful, patient, and of much mercy, and true.",
        "16 O look upon me, and have mercy on me: give thy command to thy servant, and save the son of thy handmaid.",
        "R. Lord, you are good and forgiving."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Romans 8: 26-27",
      "reference": "Romans 8: 26-27",
      "verses": [
        "26 Likewise the Spirit also helpeth our infirmity. For we know not what we should pray for as we ought; but the Spirit himself asketh for us with unspeakable groanings.",
        "27 And he that searcheth the hearts, knoweth what the Spirit desireth; because he asketh for the saints according to God."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 11: 25",
      "reference": "Matthew 11: 25",
      "verses": [
        "R. Alleluia, alleluia.",
        "25 Blessed are you, Father, Lord of heaven and earth; you have revealed to little ones the mysteries of the kingdom.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 13: 24-43",
      "reference": "Matthew 13: 24-43",
      "verses": [
        "24 Another parable he proposed to them, saying: The kingdom of heaven is likened to a man that sowed good seeds in his field.",
        "25 But while men were asleep, his enemy came and oversowed cockle among the wheat and went his way.",
        "26 And when the blade was sprung up, and had brought forth fruit, then appeared also the cockle.",
        "27 And the servants of the goodman of the house coming said to him: Sir, didst thou not sow good seed in thy field? whence then hath it cockle?",
        "28 And he said to them: An enemy hath done this. And the servants said to him: Wilt thou that we go and gather it up?",
        "29 And he said: No, lest perhaps gathering up the cockle, you root up the wheat also together with it.",
        "30 Suffer both to grow until the harvest, and in the time of the harvest I will say to the reapers: Gather up first the cockle, and bind it into bundles to burn, but the wheat gather ye into my barn.",
        "31 Another parable he proposed unto them, saying: The kingdom of heaven is like to a grain of mustard seed, which a man took and sowed in his field.",
        "32 Which is the least indeed of all seeds; but when it is grown up, it is greater than all herbs, and becometh a tree, so that the birds of the air come, and dwell in the branches thereof.",
        "33 Another parable he spoke to them: The kingdom of heaven is like to leaven, which a woman took and hid in three measures of meal, until the whole was leavened.",
        "34 All these things Jesus spoke in parables to the multitudes: and without parables he did not speak to them.",
        "35 That it might be fulfilled which was spoken by the prophet, saying: I will open my mouth in parables, I will utter things hidden from the foundation of the world.",
        "36 Then having sent away the multitudes, he came into the house, and his disciples came to him, saying: Expound to us the parable of the cockle of the field.",
        "37 Who made answer and said to them: He that soweth the good seed, is the Son of man.",
        "38 And the field, is the world. And the good seed are the children of the kingdom. And the cockle, are the children of the wicked one.",
        "39 And the enemy that sowed them, is the devil. But the harvest is the end of the world. And the reapers are the angels.",
        "40 Even as cockle therefore is gathered up, and burnt with fire: so shall it be at the end of the world.",
        "41 The Son of man shall send his angels, and they shall gather out of his kingdom all scandals, and them that work iniquity.",
        "42 And shall cast them into the furnace of fire: there shall be weeping and gnashing of teeth.",
        "43 Then shall the just shine as the sun, in the kingdom of their Father. He that hath ears to hear, let him hear."
      ]
    }
  ]
}