{
  "date": "2026-07-13",
  "url": "https://www.catholicgallery.org/mass-reading/130726/",
  "title": "Daily Mass Readings for Monday, 13 July 2026",
  "feast": "Ordinary Weekday/ Henry, Married Man",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 1: 10-17",
      "reference": "Isaiah 1: 10-17",
      "verses": [
        "10 Hear the word of the Lord, ye rulers of Sodom, give ear to the law of our God, ye people of Gomorrha.",
        "11 To what purpose do you offer me the multitude of your victims, saith the Lord? I am full, I desire not holocausts of rams, and fat of fatlings, and blood of calves, and lambs, and buck goats.",
        "12 When you came to appear before me, who required these things at your hands, that you should walk in my courts?",
        "13 Offer sacrifice no more in vain: incense is an abomination to me. The new moons, and the sabbaths, and other festivals I will not abide, your assemblies are wicked.",
        "14 My soul hateth your new moons, and your solemnities: they are become troublesome to me, I am weary of bearing them.",
        "15 And when you stretch forth your hands, I will turn away my eyes from you: and when you multiply prayer, I will not hear: for your hands are full of blood.",
        "16 Wash yourselves, be clean, take away the evil of your devices from my eyes: cease to do perversely,",
        "17 Learn to do well: seek judgment, relieve the oppressed, judge for the fatherless, defend the widow."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 50: 8-9, 16bc-17, 21 and 23",
      "reference": "Psalms 50: 8-9, 16bc-17, 21 and 23",
      "verses": [
        "R. (23b) To the upright I will show the saving power of God.",
        "8 I will not reprove thee for thy sacrifices: and thy burnt offerings are always in my sight.",
        "9 I will not take calves out of thy house: nor he goats out of thy flocks.",
        "R. To the upright I will show the saving power of God.",
        "16bc Why dost thou declare my justices, and take my covenant in thy mouth?",
        "17 Seeing thou hast hated discipline: and hast cast my words behind thee.",
        "R. To the upright I will show the saving power of God.",
        "21 These things hast thou done, and I was silent. Thou thoughtest unjustly that I should be like to thee: but I will reprove thee, and set before thy face.",
        "23 The sacrifice of praise shall glorify me: and there is the way by which I will shew him the salvation of God.",
        "R. To the upright I will show the saving power of God."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 5: 10",
      "reference": "Matthew 5: 10",
      "verses": [
        "R. Alleluia, alleluia.",
        "10 Blessed are they who are persecuted for the sake of righteousness, for theirs is the Kingdom of heaven.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 10: 34 – 11: 1",
      "reference": "Matthew 10: 34 – 11: 1",
      "verses": [
        "34 Do not think that I came to send peace upon earth: I came not to send peace, but the sword.",
        "35 For I came to set a man at variance against his father, and the daughter against her mother, and the daughter in law against her mother in law.",
        "36 And a man’s enemies shall be they of his own household.",
        "37 He that loveth father or mother more than me, is not worthy of me; and he that loveth son or daughter more than me, is not worthy of me.",
        "38 And he that taketh not up his cross, and followeth me, is not worthy of me.",
        "39 He that findeth his life, shall lose it: and he that shall lose his life for me, shall find it.",
        "40 He that receiveth you, receiveth me: and he that receiveth me, receiveth him that sent me.",
        "41 He that receiveth a prophet in the name of a prophet, shall receive the reward of a prophet: and he that receiveth a just man in the name of a just man, shall receive the reward of a just man.",
        "42 And whosoever shall give to drink to one of these little ones a cup of cold water only in the name of a disciple, amen I say to you, he shall not lose his reward.",
        "11:1 And it came to pass, when Jesus had made an end of commanding his twelve disciples, he passed from thence, to teach and preach in their cities."
      ]
    }
  ]
}