{
  "date": "2026-07-29",
  "url": "https://www.catholicgallery.org/mass-reading/290726/",
  "title": "Daily Mass Readings for Wednesday, 29 July 2026",
  "feast": "Martha, Disciple of the Lord Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Jeremiah 15: 10, 16-21",
      "reference": "Jeremiah 15: 10, 16-21",
      "verses": [
        "10 Woe is me, my mother: why hast thou borne me a man of strife, a man of contention to all the earth? I have not lent on usury, neither hath any man lent to me on usury: yet all curse me.",
        "16 Thy words were found, and I did eat them, and thy word was to me a joy and gladness of my heart: for thy name is called upon me, O Lord God of hosts.",
        "17 I sat not in the assembly of jesters, nor did I make a boast of the presence of thy hand: I sat alone, because thou hast filled me with threats.",
        "18 Why is my sorrow become perpetual, and my wound desperate so as to refuse to be healed? it is become to me as the falsehood of deceitful waters that cannot be trusted.",
        "19 Therefore thus saith the Lord: If thou wilt be converted, I will convert thee, and thou shalt stand before my face; and if thou wilt separate the precious from the vile, thou shalt be as my mouth: they shall be turned to thee, and thou shalt not be turned to them.",
        "20 And I will make thee to this people as a strong wall of brass: and they shall fight against thee, and shall not prevail: for I am with thee to save thee, and to deliver thee, saith the Lord.",
        "21 And I will deliver thee out of the hand of the wicked, and I will redeem thee out of the hand of the mighty."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 59: 2-3, 4, 10-11, 17, 18",
      "reference": "Psalms 59: 2-3, 4, 10-11, 17, 18",
      "verses": [
        "R. (17d) God is my refuge on the day of distress.",
        "2 Deliver me from my enemies, O my God; and defend me from them that rise up against me.",
        "3 Deliver me from them that work iniquity, and save me from bloody men.",
        "R. God is my refuge on the day of distress.",
        "4 For behold they have caught my soul: the mighty have rushed in upon me: Neither is it my iniquity, nor my sin, O Lord",
        "R. God is my refuge on the day of distress.",
        "10 I will keep my strength to thee: for thou art my protector:",
        "11 My God, his mercy shall prevent me.",
        "R. God is my refuge on the day of distress.",
        "17 But I will sing thy strength: and will extol thy mercy in the morning. For thou art become my support, and my refuge, in the day of my trouble.",
        "18 Unto thee, O my helper, will I sing, for thou art God my defence: my God my mercy.",
        "R. God is my refuge on the day of distress."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 8: 12",
      "reference": "John 8: 12",
      "verses": [
        "R. Alleluia, alleluia.",
        "12 I am the light of the world, says the Lord; whoever follows me will have the light of life.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 11: 19-27 or Luke 10: 38-42",
      "reference": "John 11: 19-27 or Luke 10: 38-42",
      "verses": [
        "19 And many of the Jews were come to Martha and Mary, to comfort them concerning their brother.",
        "20 Martha therefore, as soon as she heard that Jesus had come, went to meet him: but Mary sat at home.",
        "21 Martha therefore said to Jesus: Lord, if thou hadst been here, my brother had not died.",
        "22 But now also I know that whatsoever thou wilt ask of God, God will give it thee.",
        "23 Jesus saith to her: Thy brother shall rise again.",
        "24 Martha saith to him: I know that he shall rise again, in the resurrection at the last day.",
        "25 Jesus said to her: I am the resurrection and the life: he that believeth in me, although he be dead, shall live:",
        "26 And every one that liveth, and believeth in me, shall not die for ever. Believest thou this?",
        "27 She saith to him: Yea, Lord, I have believed that thou art Christ the Son of the living God, who art come into this world.",
        "Or",
        "38 Now it came to pass as they went, that he entered into a certain town: and a certain woman named Martha, received him into her house.",
        "39 And she had a sister called Mary, who sitting also at the Lord’s feet, heard his word.",
        "40 But Martha was busy about much serving. Who stood and said: Lord, hast thou no care that my sister hath left me alone to serve? speak to her therefore, that she help me.",
        "41 And the Lord answering, said to her: Martha, Martha, thou art careful, and art troubled about many things:",
        "42 But one thing is necessary. Mary hath chosen the best part, which shall not be taken away from her."
      ]
    }
  ]
}