{
  "date": "2026-07-17",
  "url": "https://www.catholicgallery.org/mass-reading/170726/",
  "title": "Daily Mass Readings for Friday, 17 July 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 38: 1-6, 21-22, 7-8",
      "reference": "Isaiah 38: 1-6, 21-22, 7-8",
      "verses": [
        "1 In those days Ezechias was sick even to death, and Isaias the son of Amos the prophet came unto him, and said to him: Thus saith the Lord: Take order with thy house, for thou shalt die, and not live.",
        "2 And Ezechias turned his face toward the wall, and prayed to the Lord,",
        "3 And said: I beseech thee, O Lord, remember how I have walked before thee in truth, and with a perfect heart, and have done that which is good in thy sight. And Ezechias wept with great weeping.",
        "4 And the word of the Lord came to Isaias, saying:",
        "5 Go and say to Ezechias: Thus saith the Lord the God of David thy father: I have heard thy prayer, and I have seen thy tears: behold I will add to thy days fifteen years:",
        "6 And I will deliver thee and this city out of the hand of the king of the Assyrians, and I will protect it.",
        "21 Now Isaias had ordered that they should take a lump of figs, and lay it as it plaster upon the wound, and that he should be healed.",
        "22 And Ezechias bed said: What shall be the sign that I shall go up to the house of the Lord?",
        "7 And this shall be a sign to thee from the Lord, that the Lord will do this word which he hath spoken:",
        "8 Behold I will bring again the shadow of the lines, by which it is now gone down in the sun dial of Achaz with the sun, ten lines backward. And the sun returned ten lines by the degrees by which it was gone down."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Isaiah 38: 10, 11, 12abcd, 16",
      "reference": "Isaiah 38: 10, 11, 12abcd, 16",
      "verses": [
        "R. (17b) You saved my life, O Lord; I shall not die.",
        "10 I said: In the midst of my days I shall go to the gates of hell: I sought for the residue of my years.",
        "R. You saved my life, O Lord; I shall not die.",
        "11 I said: I shall not see the Lord God in the land of the living. I shall behold man no more, nor the inhabitant of rest.",
        "R. You saved my life, O Lord; I shall not die.",
        "12abcd My generation is at an end, and it is rolled away from me, as a shepherd’s tent. My life is cut off, as by a weaver: whilst I was yet but beginning, he out me off.",
        "R. You saved my life, O Lord; I shall not die.",
        "16 O Lord, if man’s life be such, and the life of my spirit be in such things as these, thou shalt correct me, and make me to live.",
        "R. You saved my life, O Lord; I shall not die."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 10: 27",
      "reference": "John 10: 27",
      "verses": [
        "R. Alleluia, alleluia.",
        "27 My sheep hear my voice, says the Lord; I know them, and they follow me.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 12: 1-8",
      "reference": "Matthew 12: 1-8",
      "verses": [
        "1 At that time Jesus went through the corn on the sabbath: and his disciples being hungry, began to pluck the ears, and to eat.",
        "2 And the Pharisees seeing them, said to him: Behold thy disciples do that which is not lawful to do on the sabbath days.",
        "3 But he said to them: Have you not read what David did when he was hungry, and they that were with him:",
        "4 How he entered into the house of God, and did eat the loaves of proposition, which it was not lawful for him to eat, nor for them that were with him, but for the priests only?",
        "5 Or have ye not read in the law, that on the sabbath days the priests in the temple break the sabbath, and are without blame?",
        "6 But I tell you that there is here a greater than the temple.",
        "7 And if you knew what this meaneth: I will have mercy, and not sacrifice: you would never have condemned the innocent.",
        "8 For the Son of man is Lord even of the sabbath."
      ]
    }
  ]
}