{
  "date": "2026-07-01",
  "url": "https://www.catholicgallery.org/mass-reading/010726/",
  "title": "Daily Mass Readings for Wednesday, 1 July 2026",
  "feast": "Ordinary Weekday/ Blessed Junipero Serra, Priest, Religious, Missionary",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Amos 5: 14-15, 21-24",
      "reference": "Amos 5: 14-15, 21-24",
      "verses": [
        "14 Seek ye good, and not evil, that you may live: and the Lord the God of hosts will be with you, as you have said.",
        "15 Hate evil, and love good, and establish judgment in the gate: it may be the Lord the God of hosts may have mercy on the remnant of Joseph.",
        "21 I hate, and have rejected your festivities: and I will not receive the odour of your assemblies.",
        "22 And if you offer me holocausts, and your gifts, I will not receive them: neither will I regard the vows of your fat beasts.",
        "23 Take away from me the tumult of thy songs: and I will not hear the canticles of thy harp.",
        "24 But judgment shall be revealed as water, and justice as a mighty torrent."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 50: 7, 8-9, 10-11, 12-13, 16bc-17",
      "reference": "Psalms 50: 7, 8-9, 10-11, 12-13, 16bc-17",
      "verses": [
        "R. (23b) To the upright I will show the saving power of God.",
        "7 Hear, O my people, and I will speak: O Israel, and I will testify to thee: I am God, thy God.",
        "R. To the upright I will show the saving power of God.",
        "8 I will not reprove thee for thy sacrifices: and thy burnt offerings are always in my sight.",
        "9 I will not take calves out of thy house: nor he goats out of thy flocks.",
        "R. To the upright I will show the saving power of God.",
        "10 For all the beasts of the woods are mine: the cattle on the hills, and the oxen.",
        "11 I know all the fowls of the air: and with me is the beauty of the field.",
        "R. To the upright I will show the saving power of God.",
        "12 If I should be hungry, I would not tell thee: for the world is mine, and the fulness thereof.",
        "13 Shall I eat the flesh of bullocks? or shall I drink the blood of goats?",
        "R. To the upright I will show the saving power of God.",
        "16bc Why dost thou declare my justices, and take my covenant in thy mouth?",
        "17 Seeing thou hast hated discipline: and hast cast my words behind thee.",
        "R. To the upright I will show the saving power of God."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: James 1: 18",
      "reference": "James 1: 18",
      "verses": [
        "R. Alleluia, alleluia.",
        "18 The Father willed to give us birth by the word of truth that we may be a kind of firstfruits of his creatures.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 8: 28-34",
      "reference": "Matthew 8: 28-34",
      "verses": [
        "28 And when he was come on the other side of the water, into the country of the Gerasens, there met him two that were possessed with devils, coming out of the sepulchres, exceeding fierce, so that none could pass by that way.",
        "29 And behold they cried out, saying: What have we to do with thee, Jesus Son of God? art thou come hither to torment us before the time?",
        "30 And there was, not far from them, an herd of many swine feeding.",
        "31 And the devils besought him, saying: If thou cast us out hence, send us into the herd of swine.",
        "32 And he said to them: Go. But they going out went into the swine, and behold the whole herd ran violently down a steep place into the sea: and they perished in the waters.",
        "33 And they that kept them fled: and coming into the city, told every thing, and concerning them that had been possessed by the devils.",
        "34 And behold the whole city went out to meet Jesus, and when they saw him, they besought him that he would depart from their coasts."
      ]
    }
  ]
}