{
  "date": "2026-07-31",
  "url": "https://www.catholicgallery.org/mass-reading/310726/",
  "title": "Daily Mass Readings for Friday, 31 July 2026",
  "feast": "Ignatius of Loyola, Priest, Religious Founder Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Jeremiah 26: 1-9",
      "reference": "Jeremiah 26: 1-9",
      "verses": [
        "1 In the beginning of the reign of Joakim the son of Josias king of Juda, came this word from the Lord, saying:",
        "2 Thus saith the Lord: Stand in the court of the house of the Lord, and speak to all the cities of Juda, out of which they come, to adore in the house of the Lord, all the words which I have commanded thee to to speak unto them: leave not out one word.",
        "3 If so be they will hearken and be converted every one from his evil way; that I may repent me of the evil that I think to do unto them for the wickedness of their doings.",
        "4 And thou shalt say to them: Thus saith the Lord: If you will not hearken to me to walk in my law, which I have given to you:",
        "5 To give ear to the words of my servants the prophets, whom I sent to you rising up early: and sending, and you have not hearkened:",
        "6 I will make this house like Silo: and I will make this city a curse to all the nations of the earth.",
        "7 And the priests, and the prophets, and all the people heard Jeremias speaking these words in the house of the Lord.",
        "8 And when Jeremias made an end of speaking all that the Lord had commanded him to speak to all the people, the priests, and the prophets, and all the people laid hold on him, saying: Let him be put to death.",
        "9 Why hath he prophesied in the name of the Lord, saying: This house shall be like Silo; and this city shall be made desolate, without an inhabitant? And all the people were gathered together against Jeremias in the house of the Lord."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 69: 5, 8-10, 14",
      "reference": "Psalms 69: 5, 8-10, 14",
      "verses": [
        "R. (14c) Lord, in your great love, answer me.",
        "5 They are multiplied above the hairs of my head, who hate me without cause. My enemies are grown strong who have wrongfully persecuted me: then did I pay that which I took not away.",
        "R. Lord, in your great love, answer me.",
        "8 Because for thy sake I have borne reproach; shame hath covered my face.",
        "9 I am become a stranger to my brethren, and an alien to the sons of my mother.",
        "10 For the zeal of thy house hath eaten me up: and the reproaches of them that reproached thee are fallen upon me.",
        "R. Lord, in your great love, answer me.",
        "14 But as for me, my prayer is to thee, O Lord; for the time of thy good pleasure, O God. In the multitude of thy mercy hear me, in the truth of thy salvation.",
        "R. Lord, in your great love, answer me."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: First Peter 1: 25",
      "reference": "First Peter 1: 25",
      "verses": [
        "R. Alleluia, alleluia.",
        "25 The word of the Lord remains forever; this is the word that has been proclaimed to you.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 13: 54-58",
      "reference": "Matthew 13: 54-58",
      "verses": [
        "54 And coming into his own country, he taught them in their synagogues, so that they wondered and said: How came this man by this wisdom and miracles?",
        "55 Is not this the carpenter’s son? Is not his mother called Mary, and his brethren James, and Joseph, and Simon, and Jude:",
        "56 And his sisters, are they not all with us? Whence therefore hath he all these things?",
        "57 And they were scandalized in his regard. But Jesus said to them: A prophet is not without honour, save in his own country, and in his own house.",
        "58 And he wrought not many miracles there, because of their unbelief."
      ]
    }
  ]
}