{
  "date": "2026-07-12",
  "url": "https://www.catholicgallery.org/mass-reading/120726/",
  "title": "Daily Mass Readings for Sunday, 12 July 2026",
  "feast": "Fifteenth Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 55: 10-11",
      "reference": "Isaiah 55: 10-11",
      "verses": [
        "10 And as the rain and the snow come down from heaven, and return no more thither, but soak the earth, and water it, and make it to spring, and give seed to the sower, and bread to the eater:",
        "11 So shall my word be, which shall go forth from my mouth: it shall not return to me void, but it shall do whatsoever I please, and shall prosper in the things for which I sent it."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 65: 10, 11, 12-13, 14",
      "reference": "Psalms 65: 10, 11, 12-13, 14",
      "verses": [
        "R. (Lk 8:8) The seed that falls on good ground will yield a fruitful harvest.",
        "10 Thou hast visited the earth, and hast plentifully watered it; thou hast many ways enriched it. The river of God is filled with water, thou hast prepared their food: for so is its preparation.",
        "R. The seed that falls on good ground will yield a fruitful harvest.",
        "11 Fill up plentifully the streams thereof, multiply its fruits; it shall spring up and rejoice in its showers.",
        "R. The seed that falls on good ground will yield a fruitful harvest.",
        "12 Thou shalt bless the crown of the year of thy goodness: and thy fields shall be filled with plenty.",
        "13 The beautiful places of the wilderness shall grow fat: and the hills shall be girded about with joy,",
        "R. The seed that falls on good ground will yield a fruitful harvest.",
        "14 The rams of the flock are clothed, and the vales shall abound with corn: they shall shout, yea they shall sing a hymn.",
        "R. The seed that falls on good ground will yield a fruitful harvest."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Romans 8: 18-23",
      "reference": "Romans 8: 18-23",
      "verses": [
        "18 For I reckon that the sufferings of this time are not worthy to be compared with the glory to come, that shall be revealed in us.",
        "19 For the expectation of the creature waiteth for the revelation of the sons of God.",
        "20 For the creature was made subject to vanity, not willingly, but by reason of him that made it subject, in hope:",
        "21 Because the creature also itself shall be delivered from the servitude of corruption, into the liberty of the glory of the children of God.",
        "22 For we know that every creature groaneth and travaileth in pain, even till now.",
        "23 And not only it, but ourselves also, who have the firstfruits of the Spirit, even we ourselves groan within ourselves, waiting for the adoption of the sons of God, the redemption of our body."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia",
      "reference": "",
      "verses": [
        "R. Alleluia, alleluia.",
        "The seed is the word of God, Christ is the sower. All who come to him will have live forever.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 13: 1-23",
      "reference": "Matthew 13: 1-23",
      "verses": [
        "1 The same day Jesus going out of the house, sat by the sea side.",
        "2 And great multitudes were gathered unto him, so that he went up into a boat and sat: and all the multitude stood on the shore.",
        "3 And he spoke to them many things in parables, saying: Behold the sower went forth to sow.",
        "4 And whilst he soweth some fell by the way side, and the birds of the air came and ate them up.",
        "5 And other some fell upon stony ground, where they had not much earth: and they sprung up immediately, because they had no deepness of earth.",
        "6 And when the sun was up they were scorched: and because they had not root, they withered away.",
        "7 And others fell among thorns: and the thorns grew up and choked them.",
        "8 And others fell upon good ground: and they brought forth fruit, some an hundredfold, some sixtyfold, and some thirtyfold.",
        "9 He that hath ears to hear, let him hear.",
        "10 And his disciples came and said to him: Why speakest thou to them in parables?",
        "11 Who answered and said to them: Because to you it is given to know the mysteries of the kingdom of heaven: but to them it is not given.",
        "12 For he that hath, to him shall be given, and he shall abound: but he that hath not, from him shall be taken away that also which he hath.",
        "13 Therefore do I speak to them in parables: because seeing they see not, and hearing they hear not, neither do they understand.",
        "14 And the prophecy of Isaias is fulfilled in them, who saith: By hearing you shall hear, and shall not understand: and seeing you shall see, and shall not perceive.",
        "15 For the heart of this people is grown gross, and with their ears they have been dull of hearing, and their eyes they have shut: lest at any time they should see with their eyes, and hear with their ears, and understand with their heart, and be converted, and I should heal them.",
        "16 But blessed are your eyes, because they see, and your ears, because they hear.",
        "17 For, amen, I say to you, many prophets and just men have desired to see the things that you see, and have not seen them, and to hear the things that you hear and have not heard them.",
        "18 Hear you therefore the parable of the sower.",
        "19 When any one heareth the word of the kingdom, and understandeth it not, there cometh the wicked one, and catcheth away that which was sown in his heart: this is he that received the seed by the way side.",
        "20 And he that received the seed upon stony ground, is he that heareth the word, and immediately receiveth it with joy.",
        "21 Yet hath he not root in himself, but is only for a time: and when there ariseth tribulation and persecution because of the word, he is presently scandalized.",
        "22 And he that received the seed among thorns, is he that heareth the word, and the care of this world and the deceitfulness of riches choketh up the word, and he becometh fruitless.",
        "23 But he that received the seed upon good ground, is he that heareth the word, and understandeth, and beareth fruit, and yieldeth the one an hundredfold, and another sixty, and another thirty."
      ]
    }
  ]
}