{
  "date": "2026-07-05",
  "url": "https://www.catholicgallery.org/mass-reading/050726/",
  "title": "Daily Mass Readings for Sunday, 5 July 2026",
  "feast": "Fourteenth Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Zechariah 9: 9-10",
      "reference": "Zechariah 9: 9-10",
      "verses": [
        "9 Rejoice greatly, O daughter of Sion, shout for joy, O daughter of Jerusalem: BEHOLD THY KING will come to thee, the just and saviour: he is poor, and riding upon an ass, and upon a colt the foal of an ass.",
        "10 And I will destroy the chariot out of Ephraim, and the horse out of Jerusalem, and the bow for war shall be broken: and he shall speak peace to the Gentiles, and his power shall be from sea to sea, and from the rivers even to the end of the earth."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 145: 1-2, 8-9, 10-11, 13-14",
      "reference": "Psalms 145: 1-2, 8-9, 10-11, 13-14",
      "verses": [
        "R. (1) I will praise your name for ever, my king and my God.",
        "or",
        "R. Alleluia.",
        "1 I will extol thee, O God my king: and I will bless thy name for ever; yea, for ever and ever.",
        "2 Every day I will bless thee: and I will praise thy name for ever; yea, for ever and ever.",
        "R. I will praise your name for ever, my king and my God.",
        "or",
        "R. Alleluia.",
        "8 The Lord is gracious and merciful: patient and plenteous in mercy.",
        "9 The Lord is sweet to all: and his tender mercies are over all his works.",
        "R. I will praise your name for ever, my king and my God.",
        "or",
        "R. Alleluia.",
        "10 Let all thy works, O lord, praise thee: and let thy saints bless thee.",
        "11 They shall speak of the glory of thy kingdom: and shall tell of thy power:",
        "R. I will praise your name for ever, my king and my God.",
        "or",
        "R. Alleluia.",
        "13 Thy kingdom is a kingdom of all ages: and thy dominion endureth throughout all generations. The Lord is faithful in all his words: and holy in all his works.",
        "14 The Lord lifteth up all that fall: and setteth up all that are cast down.",
        "R. I will praise your name for ever, my king and my God.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Romans 8: 9, 11-13",
      "reference": "Romans 8: 9, 11-13",
      "verses": [
        "9 But you are not in the flesh, but in the spirit, if so be that the Spirit of God dwell in you. Now if any man have not the Spirit of Christ, he is none of his.",
        "11 And if the Spirit of him that raised up Jesus from the dead, dwell in you; he that raised up Jesus Christ from the dead, shall quicken also your mortal bodies, because of his Spirit that dwelleth in you.",
        "12 Therefore, brethren, we are debtors, not to the flesh, to live according to the flesh.",
        "13 For if you live according to the flesh, you shall die: but if by the Spirit you mortify the deeds of the flesh, you shall live."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 11: 25",
      "reference": "Matthew 11: 25",
      "verses": [
        "R. Alleluia, alleluia.",
        "25 Blessed are you, Father, Lord of heaven and earth; you have revealed to little ones the mysteries of the kingdom.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 11: 25-30",
      "reference": "Matthew 11: 25-30",
      "verses": [
        "25 At that time Jesus answered and said: I confess to thee, O Father, Lord of heaven and earth, because thou hast hid these things from the wise and prudent, and hast revealed them to the little ones.",
        "26 Yea, Father; for so hath it seemed good in thy sight.",
        "27 All things are delivered to me by my Father. And no one knoweth the Son, but the Father: neither doth any one know the Father, but the Son, and he to whom it shall please the Son to reveal him.",
        "28 Come to me, all you that labour, and are burdened, and I will refresh you.",
        "29 Take up my yoke upon you, and learn of me, because I am meek, and humble of heart: and you shall find rest to your souls.",
        "30 For my yoke is sweet and my burden light."
      ]
    }
  ]
}