{
  "date": "2026-07-09",
  "url": "https://www.catholicgallery.org/mass-reading/090726/",
  "title": "Daily Mass Readings for Thursday, 9 July 2026",
  "feast": "Ordinary Weekday/ Augustine Zhao Rong, Priest, and Companions, Martyrs",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Hosea 11: 1-4, 8c-9",
      "reference": "Hosea 11: 1-4, 8c-9",
      "verses": [
        "1 Thus says the LORD: when Israel was a child, and I loved him: and I called my son out of Egypt.",
        "2 As they called them, they went away from before their face: they offered victims to Baalim, and sacrificed to idols.",
        "3 And I was like a foster father to Ephraim, I carried them in my arms: and they knew not that I healed them.",
        "4 I will draw them with the cords of Adam, with the bands of love: and I will be to them as one that taketh off the yoke on their jaws: and I put his meat to him that he might eat.",
        "8c How shall I make thee as Adama, shall I set thee as Seboim? my heart is turned within me, my repentance is stirred up.",
        "9 I will not execute the fierceness of my wrath: I will not return to destroy Ephraim: because I am God, and not man: the holy one in the midst of thee, and I will not enter into the city."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 80: 2ac and 3b, 15-16",
      "reference": "Psalms 80: 2ac and 3b, 15-16",
      "verses": [
        "R. (4b) Let us see your face, Lord, and we shall be saved.",
        "2ac Give ear, O thou that rulest Israel: Thou that sittest upon the cherubims, shine forth",
        "3b Stir up thy might.",
        "R. Let us see your face, Lord, and we shall be saved.",
        "15 Turn again, O God of hosts, look down from heaven, and see, and visit this vineyard:",
        "16 And perfect the same which thy right hand hath planted: and upon the son of man whom thou hast confirmed for thyself.",
        "R. Let us see your face, Lord, and we shall be saved."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Mark 1: 15",
      "reference": "Mark 1: 15",
      "verses": [
        "R. Alleluia, alleluia.",
        "15 The Kingdom of God is at hand: repent and believe in the Gospel.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 10: 7-15",
      "reference": "Matthew 10: 7-15",
      "verses": [
        "7 And going, preach, saying: The kingdom of heaven is at hand.",
        "8 Heal the sick, raise the dead, cleanse the lepers, cast out devils: freely have you received, freely give.",
        "9 Do not possess gold, nor silver, nor money in your purses:",
        "10 Nor scrip for your journey, nor two coats, nor shoes, nor a staff; for the workman is worthy of his meat.",
        "11 And into whatsoever city or town you shall enter, inquire who in it is worthy, and there abide till you go thence.",
        "12 And when you come into the house, salute it, saying: Peace be to this house.",
        "13 And if that house be worthy, your peace shall come upon it; but if it be not worthy, your peace shall return to you.",
        "14 And whosoever shall not receive you, nor hear your words: going forth out of that house or city shake off the dust from your feet.",
        "15 Amen I say to you, it shall be more tolerable for the land of Sodom and Gomorrha in the day of judgment, than for that city."
      ]
    }
  ]
}