{
  "date": "2026-01-13",
  "url": "https://www.catholicgallery.org/mass-reading/130126/",
  "title": "Daily Mass Readings for Tuesday, 13 January 2026",
  "feast": "Ordinary Weekday/ Hilary, Bishop, Doctor",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Samuel 1: 9-20",
      "reference": "First Samuel 1: 9-20",
      "verses": [
        "9 So Anna arose after she had eaten and drunk in Silo: And Heli the priest sitting upon a stool, before the door of the temple of the Lord:",
        "10 As Anna had her heart full of grief, she prayed to the Lord, shedding many tears,",
        "11 And she made a vow, saying: O Lord, of hosts, if thou wilt look down on the affliction of thy servant, and wilt be mindful of me, and not forget thy handmaid, and wilt give to thy servant a man child: I will give him to the Lord all the days of his life, and no razor shall come upon his head.",
        "12 And it came to pass, as she multiplied prayers before the Lord, that Heli observed her mouth.",
        "13 Now Anna spoke in her heart, and only her lips moved, but her voice was not heard at all. Heli therefore thought her to be drunk,",
        "14 And said to her: How long wilt thou, be drunk? digest a little the wine, of which thou hast taken too much.",
        "15 Anna answering, said: Not so, my lord: for I am an exceeding unhappy woman, and have drunk neither wine nor any strong drink, but I have poured out my soul before the Lord.",
        "16 Count not thy handmaid for one of the daughters of Belial: for out of the abundance of my sorrow and grief have I spoken till now.",
        "17 Then Heli said to her: Go in peace: and the God of Israel grant thee thy petition, which thou hast asked of him.",
        "18 And she said: Would to God thy handmaid may find grace in thy eyes. So the woman went on her way, and ate, and her countenance was no more changed.",
        "19 And they rose in the morning, and worshipped before the Lord: and they returned, and came into their house at Ramatha. And Elcana knew Anna his wife: and the Lord remembered her.",
        "20 And it came to pass when the time was come about, Anna conceived and bore a son, and called his name Samuel: because she had asked him of the Lord."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: First Samuel 2: 1, 4-5, 6-7, 8abcd",
      "reference": "First Samuel 2: 1, 4-5, 6-7, 8abcd",
      "verses": [
        "R. (1) My heart exults in the Lord, my Savior.",
        "1 My heart hath rejoiced in the Lord, and my horn is exalted in my God: my mouth is enlarged over my enemies: because I have joyed in thy salvation.",
        "R. My heart exults in the Lord, my Savior.",
        "4 The bow of the mighty is overcome, and the weak are girt with strength.",
        "5 They that were full before have hired out themselves for bread: and the hungry are filled, so that the barren hath borne many: and she that had many children is weakened.",
        "R. My heart exults in the Lord, my Savior.",
        "6 The Lord killeth and maketh alive, he bringeth down to hell and bringeth back again.",
        "7 The Lord maketh poor and maketh rich, he humbleth and he exalteth.",
        "R. My heart exults in the Lord, my Savior.",
        "8abcd He raiseth up the needy from the dust, and lifteth up the poor from the dunghill: that he may sit with princes, and hold the throne of glory.",
        "R. My heart exults in the Lord, my Savior."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: First Thessalonians 2: 13",
      "reference": "First Thessalonians 2: 13",
      "verses": [
        "R. Alleluia, alleluia.",
        "13 Receive the word of God, not as the word of men, but as it truly is, the word of God.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 1: 21-28",
      "reference": "Mark 1: 21-28",
      "verses": [
        "21 And they entered into Capharnaum, and forthwith upon the sabbath days going into the synagogue, he taught them.",
        "22 And they were astonished at his doctrine. For he was teaching them as one having power, and not as the scribes.",
        "23 And there was in their synagogue a man with an unclean spirit; and he cried out,",
        "24 Saying: What have we to do with thee, Jesus of Nazareth? art thou come to destroy us? I know who thou art, the Holy One of God.",
        "25 And Jesus threatened him, saying: Speak no more, and go out of the man.",
        "26 And the unclean spirit tearing him, and crying out with a loud voice, went out of him.",
        "27 And they were all amazed, insomuch that they questioned among themselves, saying: What thing is this? what is this new doctrine? for with power he commandeth even the unclean spirits, and they obey him.",
        "28 And the fame of him was spread forthwith into all the country of Galilee."
      ]
    }
  ]
}