{
  "date": "2026-01-25",
  "url": "https://www.catholicgallery.org/mass-reading/250126/",
  "title": "Daily Mass Readings for Sunday, 25 January 2026",
  "feast": "Third Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 8: 23 – 9: 3",
      "reference": "Isaiah 8: 23 – 9: 3",
      "verses": [
        "23 At the first time the land of Zabulon, and the land of Nephtali was lightly touched: and at the last the way of the sea beyond the Jordan of the Galilee of the Gentiles was heavily loaded.",
        "9:1 The people that walked in darkness, have seen a great light: to them that dwelt in the region of the shadow of death, light is risen.",
        "2 Thou hast multiplied the nation, and hast not increased the joy. They shall rejoice before thee, as they that rejoice in the harvest, as conquerors rejoice after taking a prey, when they divide the spoils.",
        "3 For the yoke of their burden, and the rod of their shoulder, and the sceptre of their oppressor thou hast overcome, as in the day of Median."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 27: 1, 4, 13-14",
      "reference": "Psalms 27: 1, 4, 13-14",
      "verses": [
        "R. (1a) The Lord is my light and my salvation.",
        "1 The Lord is my light and my salvation, whom shall I fear? The Lord is the protector of my life: of whom shall I be afraid?",
        "R. The Lord is my light and my salvation.",
        "4 One thing I have asked of the Lord, this will I seek after; that I may dwell in the house of the Lord all the days of my life. That I may see the delight of the Lord, and may visit his temple.",
        "R. The Lord is my light and my salvation.",
        "13 I believe to see the good things of the Lord in the land of the living.",
        "14 Expect the Lord, do manfully, and let thy heart take courage, and wait thou for the Lord.",
        "R. The Lord is my light and my salvation."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First Corinthians 1: 10-13, 17",
      "reference": "First Corinthians 1: 10-13, 17",
      "verses": [
        "10 Now I beseech you, brethren, by the name of our Lord Jesus Christ, that you all speak the same thing, and that there be no schisms among you; but that you be perfect in the same mind, and in the same judgment.",
        "11 For it hath been signified unto me, my brethren, of you, by them that are of the house of Chloe, that there are contentions among you.",
        "12 Now this I say, that every one of you saith: I indeed am of Paul; and I am of Apollo; and I am of Cephas; and I of Christ.",
        "13 Is Christ divided? Was Paul then crucified for you? or were you baptized in the name of Paul?",
        "17 For Christ sent me not to baptize, but to preach the gospel: not in wisdom of speech, lest the cross of Christ should be made void."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 4: 23",
      "reference": "Matthew 4: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Jesus proclaimed the Gospel of the kingdom and cured every disease among the people.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 4: 12-23 or Matthew 4: 12-17",
      "reference": "Matthew 4: 12-23 or Matthew 4: 12-17",
      "verses": [
        "12 And when Jesus had heard that John was delivered up, he retired into Galilee:",
        "13 And leaving the city Nazareth, he came and dwelt in Capharnaum on the sea coast, in the borders of Zabulon and Nephthalim;",
        "14 That it might be fulfilled which was said by Isaias the prophet:",
        "15 Land of Zabulon and land of Nephthalim, the way of the sea beyond the Jordan, Galilee of the Gentiles:",
        "16 The people that sat in darkness, hath seen great light: and to them that sat in the region of the shadow of death, light is sprung up.",
        "17 From that time Jesus began to preach, and to say: Do penance, for the kingdom of heaven is at hand.",
        "18 And Jesus walking by the sea of Galilee, saw two brethren, Simon who is called Peter, and Andrew his brother, casting a net into the sea (for they were fishers).",
        "19 And he saith to them: Come ye after me, and I will make you to be fishers of men.",
        "20 And they immediately leaving their nets, followed him.",
        "21 And going on from thence, he saw other two brethren, James the son of Zebedee, and John his brother, in a ship with Zebedee their father, mending their nets: and he called them.",
        "22 And they forthwith left their nets and father, and followed him.",
        "23 And Jesus went about all Galilee, teaching in their synagogues, and preaching the gospel of the kingdom: and healing all manner of sickness and every infirmity, among the people.",
        "Or",
        "12 And when Jesus had heard that John was delivered up, he retired into Galilee:",
        "13 And leaving the city Nazareth, he came and dwelt in Capharnaum on the sea coast, in the borders of Zabulon and Nephthalim;",
        "14 That it might be fulfilled which was said by Isaias the prophet:",
        "15 Land of Zabulon and land of Nephthalim, the way of the sea beyond the Jordan, Galilee of the Gentiles:",
        "16 The people that sat in darkness, hath seen great light: and to them that sat in the region of the shadow of death, light is sprung up.",
        "17 From that time Jesus began to preach, and to say: Do penance, for the kingdom of heaven is at hand."
      ]
    }
  ]
}