{
  "date": "2026-01-18",
  "url": "https://www.catholicgallery.org/mass-reading/180126/",
  "title": "Daily Mass Readings for Sunday, 18 January 2026",
  "feast": "Second Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 49: 3, 5-6",
      "reference": "Isaiah 49: 3, 5-6",
      "verses": [
        "3 And he said to me: Thou art my servant Israel, for in thee will I glory.",
        "5 And now saith the Lord, that formed me from the womb to be his servant, that I may bring back Jacob unto him, and Israel will not be gathered together: and I am glorified in the eyes of the Lord, and my God is made my strength.",
        "6 And he said: It is a small thing that thou shouldst be my servant to raise up the tribes of Jacob, and to convert the dregs of Israel. Behold, I have given thee to be the light of the Gentiles, that thou mayst be my salvation even to the farthest part of the earth."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 40: 2, 4, 7-8, 8-9, 10",
      "reference": "Psalms 40: 2, 4, 7-8, 8-9, 10",
      "verses": [
        "R. (8a and 9a) Here am I, Lord; I come to do your will.",
        "2 With expectation I have waited for the Lord, and he was attentive to me.",
        "4 And he put a new canticle into my mouth, a song to our God.",
        "R. Here am I, Lord; I come to do your will.",
        "7 Sacrifice and oblation thou didst not desire; but thou hast pierced ears for me. Burnt offering and sin offering thou didst not require:",
        "8a Then said I, Behold I come.",
        "R. Here am I, Lord; I come to do your will.",
        "8b In the head of the book it is written of me",
        "9 That I should do thy will: O my God, I have desired it, and thy law in the midst of my heart.",
        "R. Here am I, Lord; I come to do your will.",
        "10 I have declared thy justice in a great church, lo, I will not restrain my lips: O Lord, thou knowest it.",
        "R. Here am I, Lord; I come to do your will."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First Corinthians 1: 1-3",
      "reference": "First Corinthians 1: 1-3",
      "verses": [
        "1 Paul, called to be an apostle of Jesus Christ by the will of God, and Sosthenes a brother,",
        "2 To the church of God that is at Corinth, to them that are sanctified in Christ Jesus, called to be saints, with all that invoke the name of our Lord Jesus Christ, in every place of theirs and ours.",
        "3 Grace to you, and peace from God our Father, and from the Lord Jesus Christ."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 1: 14a, 12a",
      "reference": "John 1: 14a, 12a",
      "verses": [
        "R. Alleluia, alleluia.",
        "14a, 12a The Word of God became flesh and dwelt among us. To those who accepted him, he gave power to become children of God.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 1: 29-34",
      "reference": "John 1: 29-34",
      "verses": [
        "29 The next day, John saw Jesus coming to him, and he saith: Behold the Lamb of God, behold him who taketh away the sin of the world.",
        "30 This is he, of whom I said: After me there cometh a man, who is preferred before me: because he was before me.",
        "31 And I knew him not, but that he may be made manifest in Israel, therefore am I come baptizing with water.",
        "32 And John gave testimony, saying: I saw the Spirit coming down, as a dove from heaven, and he remained upon him.",
        "33 And I knew him not; but he who sent me to baptize with water, said to me: He upon whom thou shalt see the Spirit descending, and remaining upon him, he it is that baptizeth with the Holy Ghost.",
        "34 And I saw, and I gave testimony, that this is the Son of God."
      ]
    }
  ]
}