{
  "date": "2026-01-12",
  "url": "https://www.catholicgallery.org/mass-reading/120126/",
  "title": "Daily Mass Readings for Monday, 12 January 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Samuel 1: 1-8",
      "reference": "First Samuel 1: 1-8",
      "verses": [
        "1 There was a man of Ramathaimsophim, of mount Ephraim, and his name was Elcana, the son of Jeroham, the son of Eliu, the son of Thohu, the son of Suph, an Ephraimite:",
        "2 And he had two wives, the name of one was Anna, and the name of the other Phenenna. Phenenna had children: but Anna had no children.",
        "3 And this man went up out of his city upon the appointed days, to adore and to offer sacrifice to the Lord of hosts in Silo. And the two sons of Heli, Ophni and Phinees, were there priests of the Lord.",
        "4 Now the day came, and Elcana offered sacrifice, and gave to Phenenna his wife, and to all her sons and daughters, portions:",
        "5 But to Anna he gave one portion with sorrow, because he loved Anna. And the Lord had shut up her womb.",
        "6 Her rival also afflicted her, and troubled her exceedingly, insomuch that she upbraided her, that the Lord had shut up her womb:",
        "7 And thus she did every year, when the time returned that they went up to the temple of the Lord: and thus she provoked her: but Anna wept, and did not eat.",
        "8 Then Elcana her husband said to her: Anna, why weepest thou? and why dost thou not eat? And why dost thou afflict thy heart? Am not I better to thee than ten children?"
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 116: 12-13, 14-16, 18-19",
      "reference": "Psalms 116: 12-13, 14-16, 18-19",
      "verses": [
        "R. (17a) To you, Lord, I will offer a sacrifice of praise.",
        "or",
        "R. Alleluia.",
        "12 What shall I render to the Lord, for all the things he hath rendered unto me?",
        "13 I will take the chalice of salvation; and I will call upon the name of the Lord.",
        "R. To you, Lord, I will offer a sacrifice of praise.",
        "or",
        "R. Alleluia.",
        "14 I will pay my vows to the Lord before all his people:",
        "15 Precious in the sight of the Lord is the death of his saints.",
        "16 O Lord, for I am thy servant: I am thy servant, and the son of thy handmaid. Thou hast broken my bonds:",
        "R. To you, Lord, I will offer a sacrifice of praise.",
        "or",
        "R. Alleluia.",
        "18 I will pay my vows to the Lord in the sight of all his people:",
        "19 In the courts of the house of the Lord, in the midst of thee, O Jerusalem.",
        "R. To you, Lord, I will offer a sacrifice of praise.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Mark 1: 15",
      "reference": "Mark 1: 15",
      "verses": [
        "R. Alleluia, alleluia.",
        "15 The Kingdom of God is at hand; repent and believe in the Gospel.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 1: 14-20",
      "reference": "Mark 1: 14-20",
      "verses": [
        "14 And after that John was delivered up, Jesus came into Galilee, preaching the gospel of the kingdom of God,",
        "15 And saying: The time is accomplished, and the kingdom of God is at hand: repent, and believe the gospel.",
        "16 And passing by the sea of Galilee, he saw Simon and Andrew his brother, casting nets into the sea (for they were fishermen).",
        "17 And Jesus said to them: Come after me, and I will make you to become fishers of men.",
        "18 And immediately leaving their nets, they followed him.",
        "19 And going on from thence a little farther, he saw James the son of Zebedee, and John his brother, who also were mending their nets in the ship:",
        "20 And forthwith he called them. And leaving their father Zebedee in the ship with his hired men, they followed him."
      ]
    }
  ]
}