{
  "date": "2026-01-21",
  "url": "https://www.catholicgallery.org/mass-reading/210126/",
  "title": "Daily Mass Readings for Wednesday, 21 January 2026",
  "feast": "Agnes, Virgin, Martyr Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Samuel 17: 32-33, 37, 40-51",
      "reference": "First Samuel 17: 32-33, 37, 40-51",
      "verses": [
        "32 And when he was brought to him, he said to him: Let not any man’s heart be dismayed in him: I thy servant will go, and will fight against the Philistine.",
        "33 And Saul said to David: Thou art not able to withstand this Philistine, nor to fight against him: for thou art but a boy, but he is a warrior from his youth.",
        "37 And David said: The Lord who delivered me out of the paw of the lion, and out of the paw of the bear, he will deliver me out of the hand of this Philistine. And Saul said to David: Go, and the Lord be with thee.",
        "40 And he took his staff, which he had always in his hands: and chose him five smooth stones out of the brook, and put them into the shepherd’s scrip, which he had with him, and he took a sling in his hand, and went forth against the Philistine.",
        "41 And the Philistine came on, and drew nigh against David, and his armourbearer before him.",
        "42 And when the Philistine looked, and beheld David, he despised him. For he was a young man, ruddy, and of a comely countenance.",
        "43 And the Philistine said to David: Am I a dog, that thou comest to me with a staff? And the Philistine cursed David by his gods.",
        "44 And he said to David: Come to me, and I will give thy flesh to the birds of the air, and to the beasts of the earth.",
        "45 And David said to the Philistine: Thou comest to me with a sword, and with a spear, and with a shield: but I come to thee in the name of the Lord of hosts, the God of the armies of Israel, which thou hast defied.",
        "46 This day, and the Lord will deliver thee into my hand, and I will slay thee, and take away thy head from thee: and I will give the carcasses of the army of the Philistines this day to the birds of the air, and to the beasts of the earth: that all the earth may know that there is a God in Israel.",
        "47 And all this assembly shall know, that the Lord saveth not with sword and spear: for it is his battle, and he will deliver you into our hands.",
        "48 And when the Philistine arose and was coming, and drew nigh to meet David, David made haste, and ran to the fight to meet the Philistine.",
        "49 And he put his hand into his scrip, and took a stone, and cast it with the sling, and fetching it about struck the Philistine in the forehead: and the stone was fixed in his forehead, and he fell on his face upon the earth.",
        "50 And David prevailed over the Philistine, with a sling and a stone, and he struck, and slew the Philistine. And as David had no sword in his hand,",
        "51 He ran, and stood over the Philistine, and took his sword, and drew it out of the sheath, and slew him, and cut off his head. And the Philistines seeing that their champion was dead, fled away."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 144: 1b, 2, 9-10",
      "reference": "Psalms 144: 1b, 2, 9-10",
      "verses": [
        "R. (1) Blessed be the Lord, my Rock!",
        "1 Blessed be the Lord my God, who teacheth my hands to fight, and my fingers to war.",
        "R. Blessed be the Lord, my Rock!",
        "2 My mercy, and my refuge: my support, and my deliverer: My protector, and I have hoped in him: who subdueth my people under me.",
        "R. Blessed be the Lord, my Rock!",
        "9 To thee, O God, I will sing a new canticle: on the psaltery and an instrument of ten strings I will sing praises to thee.",
        "10 Who givest salvation to kings: who hast redeemed thy servant David from the malicious sword.",
        "R. Blessed be the Lord, my Rock!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 4: 23",
      "reference": "Matthew 4: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Jesus preached the Gospel of the Kingdom and cured every disease among the people.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 3: 1-6",
      "reference": "Mark 3: 1-6",
      "verses": [
        "1 And he entered again into the synagogue, and there was a man there who had a withered hand.",
        "2 And they watched him whether he would heal on the sabbath days; that they might accuse him.",
        "3 And he said to the man who had the withered hand: Stand up in the midst.",
        "4 And he saith to them: Is it lawful to do good on the sabbath days, or to do evil? to save life, or to destroy? But they held their peace.",
        "5 And looking round about on them with anger, being grieved for the blindness of their hearts, he saith to the man: Stretch forth thy hand. And he stretched it forth: and his hand was restored unto him.",
        "6 And the Pharisees going out, immediately made a consultation with the Herodians against him, how they might destroy him."
      ]
    }
  ]
}