{
  "date": "2026-01-31",
  "url": "https://www.catholicgallery.org/mass-reading/310126/",
  "title": "Daily Mass Readings for Saturday, 31 January 2026",
  "feast": "John Bosco, Priest, Religious Founder Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Samuel 12: 1-7a, 10-17",
      "reference": "Second Samuel 12: 1-7a, 10-17",
      "verses": [
        "1 And the Lord sent Nathan to David: and when he was come to him, he said to him: There were two men in one city, the one rich, and the other poor.",
        "2 The rich man had exceeding many sheep and oxen.",
        "3 But the poor man had nothing at all but one little ewe lamb, which he had bought and nourished up, and which had grown up in his house together with his children, eating of his bread, and drinking of his cup, and sleeping in his bosom: and it was unto him as a daughter.",
        "4 And when a certain stranger was come to the rich man, he spared to take of his own sheep and oxen, to make a feast for that stranger, who was come to him, but took the poor man’s ewe, and dressed it for the man that was come to him.",
        "5 And David’s anger being exceedingly kindled against that man, he said to Nathan: As the Lord liveth, the man that hath done this is a child of death.",
        "6 He shall restore the ewe fourfold, because he did this thing, and had no pity.",
        "7a And Nathan said to David: Thou art the man. Thus saith the Lord the God of Israel.",
        "10 Therefore the sword shall never depart from thy house, because thou hast despised me, and hast taken the wife of Urias the Hethite to be thy wife.",
        "11 Thus saith the Lord: Behold, I will raise up evil against thee out of thy own house, and I will take thy wives before thy eyes I and give them to thy neighhour, and he shall lie with thy wives in the sight of this sun.",
        "12 For thou didst it secretly: but I will do this thing in the sight of all Israel, and in the sight of the sun.",
        "13 And David said to Nathan: I have sinned against the Lord. And Nathan said to David: The Lord also hath taken away thy sin: thou shalt not die.",
        "14 Nevertheless, because thou hast given occasion to the enemies of the Lord to blaspheme, for this thing, the child that is born to thee, shall surely die.",
        "15 And Nathan returned to his house. The Lord also struck the child which the wife of Urias had borne to David, and his life was despaired of.",
        "16 And David besought the Lord for the child: and David kept a fast, and going in by himself lay upon the ground.",
        "17 And the ancients of his house came, to make him rise from the ground: but he would not, neither did he eat meat with them."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 51: 12-13, 14-15, 16-17",
      "reference": "Psalms 51: 12-13, 14-15, 16-17",
      "verses": [
        "R. (12a) Create a clean heart in me, O God.",
        "12 Create a clean heart in me, O God: and renew a right spirit within my bowels.",
        "13 Cast me not away from thy face; and take not thy holy spirit from me.",
        "R. Create a clean heart in me, O God.",
        "14 Restore unto me the joy of thy salvation, and strengthen me with a perfect spirit.",
        "15 I will teach the unjust thy ways: and the wicked shall be converted to thee.",
        "R. Create a clean heart in me, O God.",
        "16 Deliver me from blood, O God, thou God of my salvation: and my tongue shall extol thy justice.",
        "17 O Lord, thou wilt open my lips: and my mouth shall declare thy praise.",
        "R. Create a clean heart in me, O God."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 3: 16",
      "reference": "John 3: 16",
      "verses": [
        "R. Alleluia, alleluia.",
        "16 God so loved the world that he gave his only-begotten Son, so that everyone who believes in him might have eternal life.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 4: 35-41",
      "reference": "Mark 4: 35-41",
      "verses": [
        "35 And he saith to them that day, when evening was come: Let us pass over to the other side.",
        "36 And sending away the multitude, they take him even as he was in the ship: and there were other ships with him.",
        "37 And there arose a great storm of wind, and the waves beat into the ship, so that the ship was filled.",
        "38 And he was in the hinder part of the ship, sleeping upon a pillow; and they awake him, and say to him: Master, doth it not concern thee that we perish?",
        "39 And rising up, he rebuked the wind, and said to the sea: Peace, be still. And the wind ceased: and there was made a great calm.",
        "40 And he said to them: Why are you fearful? have you not faith yet?",
        "41 And they feared exceedingly: and they said one to another: Who is this (thinkest thou) that both wind and sea obey him?"
      ]
    }
  ]
}