{
  "date": "2026-01-11",
  "url": "https://www.catholicgallery.org/mass-reading/110126/",
  "title": "Daily Mass Readings for Sunday, 11 January 2026",
  "feast": "Baptism of the Lord Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 42: 1-4, 6-7",
      "reference": "Isaiah 42: 1-4, 6-7",
      "verses": [
        "1 Behold my servant, I will uphold him: my elect, my soul delighteth in him: I have given my spirit upon him, he shall bring forth judgment to the Gentiles.",
        "2 He shall not cry, nor have respect to person, neither shall his voice be heard abroad.",
        "3 The bruised reed he shall not break, and smoking flax he shall not quench: he shall bring forth judgment unto truth.",
        "4 He shall not be sad, nor troublesome, till he set judgment in the earth: and the islands shall wait for his law.",
        "6 I the Lord have called thee in justice, and taken thee by the hand, and preserved thee. And I have given thee for a covenant of the people, for a light of the Gentiles:",
        "7 That thou mightest open the eyes of the blind, and bring forth the prisoner out of prison, and them that sit in darkness out of the prison house."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 29: 1-2, 3-4, 9-10",
      "reference": "Psalms 29: 1-2, 3-4, 9-10",
      "verses": [
        "R. (11b) The Lord will bless his people with peace.",
        "1 Bring to the Lord, O ye children of God: bring to the Lord the offspring of rams.",
        "2 Bring to the Lord glory and honour: bring to the Lord glory to his name: adore ye the Lord in his holy court.",
        "R. The Lord will bless his people with peace.",
        "3 The voice of the Lord is upon the waters; the God of majesty hath thundered, The Lord is upon many waters.",
        "4 The voice of the Lord is in power; the voice of the Lord in magnificence.",
        "R. The Lord will bless his people with peace.",
        "9 The voice of the Lord prepareth the stags: and he will discover the thick woods: and in his temple all shall speak his glory.",
        "10 The Lord maketh the flood to dwell: and the Lord shall sit king for ever.",
        "R. The Lord will bless his people with peace."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Acts 10: 34-38",
      "reference": "Acts 10: 34-38",
      "verses": [
        "34 And Peter opening his mouth, said: In very deed I perceive, that God is not a respecter of persons.",
        "35 But in every nation, he that feareth him, and worketh justice, is acceptable to him.",
        "36 God sent the word to the children of Israel, preaching peace by Jesus Christ: (he is Lord of all.)",
        "37 You know the word which hath been published through all Judea: for it began from Galilee, after the baptism which John preached,",
        "38 Jesus of Nazareth: how God anointed him with the Holy Ghost, and with power, who went about doing good, and healing all that were oppressed by the devil, for God was with him."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Mark 9: 7",
      "reference": "Mark 9: 7",
      "verses": [
        "R. Alleluia, alleluia.",
        "7 The heavens were opened and the voice of the Father thundered: This is my beloved Son, listen to him.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 3: 13-17",
      "reference": "Matthew 3: 13-17",
      "verses": [
        "13 Then cometh Jesus from Galilee to the Jordan, unto John, to be baptized by him.",
        "14 But John stayed him, saying: I ought to be baptized by thee, and comest thou to me?",
        "15 And Jesus answering, said to him: Suffer it to be so now. For so it becometh us to fulfill all justice. Then he suffered him.",
        "16 And Jesus being baptized, forthwith came out of the water: and lo, the heavens were opened to him: and he saw the Spirit of God descending as a dove, and coming upon him.",
        "17 And behold a voice from heaven, saying: This is my beloved Son, in whom I am well pleased."
      ]
    }
  ]
}