{
  "date": "2026-01-20",
  "url": "https://www.catholicgallery.org/mass-reading/200126/",
  "title": "Daily Mass Readings for Tuesday, 20 January 2026",
  "feast": "Ordinary Weekday/ Fabian, Pope, Martyr/ Sebastian, Martyr",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Samuel 16: 1-13",
      "reference": "First Samuel 16: 1-13",
      "verses": [
        "1 And the Lord said to Samuel: How long wilt thou mourn for Saul, whom I have rejected from reigning over Israel? fill thy horn with oil, and come, that I may send thee to Isai the Bethlehemite: for I have provided me a king among his sons.",
        "2 And Samuel said: How shall I go? for Saul will hear of it, and he will kill me. And the Lord said: Thou shalt take with thee a calf of the herd, and thou shalt say: I am come to sacrifice to the Lord.",
        "3 And thou shalt call Isai to the sacrifice, and I will shew thee what thou art to do, and thou shalt anoint him whom I shall shew to thee.",
        "4 Then Samuel did as the Lord had said to him. And he came to Bethlehem, and the ancients of the city wondered, and meeting him, they said: Is thy coming hither peaceable?",
        "5 And he said: It is peaceable: I am come to offer sacrifice to the Lord, be ye sanctified, and come with me to the sacrifice. And he sanctified Isai and his sons, and called them to the sacrifice.",
        "6 And when they were come in, he saw Eliab, and said: Is the Lord’s anointed before him?",
        "7 And the Lord said to Samuel: Look not on his countenance, nor on the height of his stature: because I have rejected him, nor do I judge according to the look of man: for man seeth those things that appear, but the Lord beholdeth the heart.",
        "8 And Isai called Abinadab, and brought him before Samuel. And he said: Neither hath the Lord chosen this.",
        "9 And Isai brought Samma, and he said of him: Neither hath the Lord chosen this.",
        "10 Isai therefore brought his seven sons before Samuel: and Samuel said to Isai: The Lord hath not chosen any one of these.",
        "11 And Samuel said to Isai: Are here all thy sons? He answered: There remaineth yet a young one, who keepeth the sheep. And Samuel said to Isai: Send, and fetch him, for we will not sit down till he come hither.",
        "12 He sent therefore and brought him Now he was ruddy and beautiful to behold, and of a comely face. And the Lord said: Arise, and anoint him, for this is he.",
        "13 Then Samuel took the horn of oil, and anointed him in the midst of his brethren: and the spirit of the Lord came upon David from that day forward: and Samuel rose up, and went to Ramatha."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 89: 20, 21-22, 27-28",
      "reference": "Psalms 89: 20, 21-22, 27-28",
      "verses": [
        "R. (21a) I have found David, my servant.",
        "20 Then thou spokest in a vision to thy saints, and saidst: I have laid help upon one that is mighty, and have exalted one chosen out of my people.",
        "R. I have found David, my servant.",
        "21 I have found David my servant: with my holy oil I have anointed him.",
        "22 For my hand shall help him: and my arm shall strengthen him.",
        "R. I have found David, my servant.",
        "27 He shall cry out to me: Thou art my father: my God, and the support of my salvation.",
        "28 And I will make him my firstborn, high above the kings of the earth.",
        "R. I have found David, my servant."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Ephesians 1: 17-18",
      "reference": "Ephesians 1: 17-18",
      "verses": [
        "R. Alleluia, alleluia.",
        "17-18 May the Father of our Lord Jesus Christ enlighten the eyes of our hearts, that we may know what is the hope that belongs to our call.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 2: 23-28",
      "reference": "Mark 2: 23-28",
      "verses": [
        "23 And it came to pass again, as the Lord walked through the corn fields on the sabbath, that his disciples began to go forward, and to pluck the ears of corn.",
        "24 And the Pharisees said to him: Behold, why do they on the sabbath day that which is not lawful?",
        "25 And he said to them: Have you never read what David did when he had need, and was hungry himself, and they that were with him?",
        "26 How he went into the house of God, under Abiathar the high priest, and did eat the loaves of proposition, which was not lawful to eat but for the priests, and gave to them who were with him?",
        "27 And he said to them: The sabbath was made for man, and not man for the sabbath.",
        "28 Therefore the Son of man is Lord of the sabbath also."
      ]
    }
  ]
}