{
  "date": "2026-01-19",
  "url": "https://www.catholicgallery.org/mass-reading/190126/",
  "title": "Daily Mass Readings for Monday, 19 January 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Samuel 15: 16-23",
      "reference": "First Samuel 15: 16-23",
      "verses": [
        "16 And Samuel said to Saul: Suffer me, and I will tell thee what the Lord hath said to me this night. And he said to him: Speak.",
        "17 And Samuel said: When thou wast a little one in thy own eyes, wast thou not made the head of the tribes of Israel? And the Lord anointed thee to be king over Israel.",
        "18 And the Lord sent thee on the way, and said: Go, and kill the sinners of Amalec, and thou shalt fight against them until thou hast utterly destroyed them.",
        "19 Why then didst thou not hearken to the voice of the Lord: but hast turned to the prey, and hast done evil in the eyes of the Lord.",
        "20 And Saul said to Samuel: Yea I have hearkened to the voice of the Lord, and have walked in the way by which the Lord sent me, and have brought Agag the king of Amalec, and Amalec I have slain.",
        "21 But the people took of the spoils sheep and oxen, as the firstfruits of those things that were slain, to offer sacrifice to the Lord their God in Galgal.",
        "22 And Samuel said: Doth the Lord desire holocausts and victims, and not rather that the voice of the Lord should be obeyed? For obedience is better than sacrifices: and to hearken rather than to offer the fat of rams.",
        "23 Because it is like the sin of witchcraft, to rebel: and like the crime of idolatry, to refuse to obey. Forasmuch therefore as thou hast rejected the word of the Lord, the Lord hath also rejected thee from being king."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 50: 8-9, 16bc-17, 21 and 23",
      "reference": "Psalms 50: 8-9, 16bc-17, 21 and 23",
      "verses": [
        "R. (23b) To the upright I will show the saving power of God.",
        "8 I will not reprove thee for thy sacrifices: and thy burnt offerings are always in my sight.",
        "9 I will not take calves out of thy house: nor he goats out of thy flocks.",
        "R. To the upright I will show the saving power of God.",
        "16bc Why dost thou declare my justices, and take my covenant in thy mouth?",
        "17 Seeing thou hast hated discipline: and hast cast my words behind thee.",
        "R. To the upright I will show the saving power of God.",
        "21 These things hast thou done, and I was silent. Thou thoughtest unjustly that I should be like to thee: but I will reprove thee, and set before thy face.",
        "23 The sacrifice of praise shall glorify me: and there is the way by which I will shew him the salvation of God.",
        "R. To the upright I will show the saving power of God."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Hebrews 4: 12",
      "reference": "Hebrews 4: 12",
      "verses": [
        "R. Alleluia, alleluia.",
        "12 The word of God is living and effective, able to discern reflections and thoughts of the heart.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 2: 18-22",
      "reference": "Mark 2: 18-22",
      "verses": [
        "18 And the disciples of John and the Pharisees used to fast; and they come and say to him: Why do the disciples of John and of the Pharisees fast; but thy disciples do not fast?",
        "19 And Jesus saith to them: Can the children of the marriage fast, as long as the bridegroom is with them? As long as they have the bridegroom with them, they cannot fast.",
        "20 But the days will come when the bridegroom shall be taken away from them; and then they shall fast in those days.",
        "21 No man seweth a piece of raw cloth to an old garment: otherwise the new piecing taketh away from the old, and there is made a greater rent.",
        "22 And no man putteth new wine into old bottles: otherwise the wine will burst the bottles, and both the wine will be spilled, and the bottles will be lost. But new wine must be put into new bottles."
      ]
    }
  ]
}