{
  "date": "2026-01-30",
  "url": "https://www.catholicgallery.org/mass-reading/300126/",
  "title": "Daily Mass Readings for Friday, 30 January 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Samuel 11: 1-4a, 5-10a, 13-17",
      "reference": "Second Samuel 11: 1-4a, 5-10a, 13-17",
      "verses": [
        "1 And it came to pass at the return of the year, at the time when kings go forth to war, that David sent Joab and his servants with him, and all Israel, and they spoiled the children of Ammon, and besieged Rabba: but David remained in Jerusalem.",
        "2 In the mean time it happened that David arose from his bed after noon, and walked upon the roof of the king’s house: and he saw from the roof of his house a woman washing herself, over against him: and the woman was very beautiful.",
        "3 And the king sent, and inquired who the woman was. And it was told him, that she was Bethsabee the daughter of Eliam, the wife of Urias the Hethite.",
        "4a And David sent messengers, and took her, and she came in to him, and he slept with her.",
        "5 And she returned to her house having conceived. And she sent and told David, and said: I have conceived.",
        "6 And David sent to Joab, saying: Send me Urias the Hethite. And Joab sent Urias to David.",
        "7 And Urias came to David. And David asked how Joab did, and the people, and how the war was carried on.",
        "8 And David said to Urias: Go into thy house, and wash thy feet. And Urias went out from the king’s house, and there went out after him a mess of meat from the king.",
        "9 But Urias slept before the gate of the king’s house, with the other servants of his lord, and went not down to his own house.",
        "10a And it was told David by some that said: Urias went not to his house.",
        "13 And David called him to eat and to drink before him, and he made him drunk: and he went out in the evening, and slept on his couch with the servants of his lord, and went not down into his house.",
        "14 And when the morning was come, David wrote a letter to Joab: and sent it by the hand of Urias,",
        "15 Writing in the letter: Set ye Urias in the front of the battle, where the fight is strongest: and leave ye him, that he may be wounded and die.",
        "16 Wherefore as Joab was besieging the city, he put Urias in the place where he knew the bravest men were.",
        "17 And the men coming out of the city, fought against Joab, and there fell some of the people of the servants of David, and Urias the Hethite was killed also."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 51: 3-4, 5-6a, 6bcd-7, 10-11",
      "reference": "Psalms 51: 3-4, 5-6a, 6bcd-7, 10-11",
      "verses": [
        "R. (3a) Be merciful, O Lord, for we have sinned.",
        "3 Have mercy on me, O God, according to thy great mercy. And according to the multitude of thy tender mercies blot out my iniquity.",
        "4 Wash me yet more from my iniquity, and cleanse me from my sin.",
        "R. Be merciful, O Lord, for we have sinned.",
        "5 For I know my iniquity, and my sin is always before me.",
        "6a To thee only have I sinned, and have done evil before thee.",
        "R. Be merciful, O Lord, for we have sinned.",
        "6bcd I have done evil before thee, that thou mayst be justified in thy words and mayst overcome when thou art judged.",
        "7 For behold I was conceived in iniquities; and in sins did my mother conceive me.",
        "R. Be merciful, O Lord, for we have sinned.",
        "10 To my hearing thou shalt give joy and gladness: and the bones that have been humbled shall rejoice.",
        "11 Turn away thy face from my sins, and blot out all my iniquities.",
        "R. Be merciful, O Lord, for we have sinned."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 11: 25",
      "reference": "Matthew 11: 25",
      "verses": [
        "R. Alleluia, alleluia.",
        "25 Blessed are you, Father, Lord of heaven and earth; you have revealed to little ones the mysteries of the Kingdom.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 4: 26-34",
      "reference": "Mark 4: 26-34",
      "verses": [
        "26 And he said: So is the kingdom of God, as if a man should cast seed into the earth,",
        "27 And should sleep, and rise, night and day, and the seed should spring, and grow up whilst he knoweth not.",
        "28 For the earth of itself bringeth forth fruit, first the blade, then the ear, afterwards the full corn in the ear.",
        "29 And when the fruit is brought forth, immediately he putteth in the sickle, because the harvest is come.",
        "30 And he said: To what shall we liken the kingdom of God? or to what parable shall we compare it?",
        "31 It is as a grain of mustard seed: which when it is sown in the earth, is less than all the seeds that are in the earth:",
        "32 And when it is sown, it groweth up, and becometh greater than all herbs, and shooteth out great branches, so that the birds of the air may dwell under the shadow thereof.",
        "33 And with many such parables, he spoke to them the word, according as they were able to hear.",
        "34 And without parable he did not speak unto them; but apart, he explained all things to his disciples."
      ]
    }
  ]
}