{
  "date": "2026-01-29",
  "url": "https://www.catholicgallery.org/mass-reading/290126/",
  "title": "Daily Mass Readings for Thursday, 29 January 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Samuel 7: 18-19, 24-29",
      "reference": "Second Samuel 7: 18-19, 24-29",
      "verses": [
        "18After Nathan had spoken to King David, he went in, and sat before the Lord, and said: Who am I, O Lord God, and what is my house, that thou hast brought me thus far?",
        "19 But yet this hath seemed little in thy sight, O Lord God, unless thou didst also speak of the house of thy servant for a long time to come: for this is the law of Adam, O Lord God.",
        "24 For thou hast confirmed to thyself thy people Israel to be an everlasting people: and thou, O Lord God, art become their God.",
        "25 And now, O Lord God, raise up for ever the word that thou hast spoken, concerning thy servant and concerning his house: and do as thou hast spoken,",
        "26 That thy name may be magnified for ever, and it may be said: The Lord of hosts is God over Israel. And the house of thy servant David shall be established before the Lord.",
        "27 Because thou, O Lord of hosts, God of Israel, hast revealed to the ear of thy servant, saying: I will build thee a house: therefore hath thy servant found in his heart to pray this prayer to thee.",
        "28 And now, O Lord God, thou art God, and thy words shall be true: for thou hast spoken to thy servant these good things.",
        "29 And now begin, and bless the house of thy servant, that it may endure for ever before thee: because thou, O Lord God, hast spoken it, and with thy blessing let the house of thy servant be blessed for ever."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 132: 1-2, 3-5, 11, 12, 13-14",
      "reference": "Psalms 132: 1-2, 3-5, 11, 12, 13-14",
      "verses": [
        "R. (Lk 1:32b) The Lord God will give him the throne of David, his father.",
        "1 O Lord, remember David, and all his meekness.",
        "2 How he swore to the Lord, he vowed a vow to the God of Jacob:",
        "R. The Lord God will give him the throne of David, his father.",
        "3 If I shall enter into the tabernacle of my house: if I shall go up into the bed wherein I lie:",
        "4 If I shall give sleep to my eyes, or slumber to my eyelids,",
        "5 Or rest to my temples: until I find out a place for the Lord, a tabernacle for the God of Jacob.",
        "R. The Lord God will give him the throne of David, his father.",
        "11 The Lord hath sworn truth to David, and he will not make it void: of the fruit of thy womb I will set upon thy throne.",
        "R. The Lord God will give him the throne of David, his father.",
        "12 If thy children will keep thy covenant, and these my testimonies which I shall teach them: Their children also for evermore shall sit upon thy throne.",
        "R. The Lord God will give him the throne of David, his father.",
        "13 For the Lord hath chosen Sion: he hath chosen it for his dwelling.",
        "14 This is my rest for ever and ever: here will I dwell, for I have chosen it.",
        "R. The Lord God will give him the throne of David, his father."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Psalms 119: 105",
      "reference": "Psalms 119: 105",
      "verses": [
        "R. Alleluia, alleluia.",
        "105 A lamp to my feet is your word, a light to my path.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 4: 21-25",
      "reference": "Mark 4: 21-25",
      "verses": [
        "21 And he said to them: Doth a candle come in to be put under a bushel, or under a bed? and not to be set on a candlestick?",
        "22 For there is nothing hid, which shall not be made manifest: neither was it made secret, but that it may come abroad.",
        "23 If any man have ears to hear, let him hear.",
        "24 And he said to them: Take heed what you hear. In what measure you shall mete, it shall be measured to you again, and more shall be given to you.",
        "25 For he that hath, to him shall be given: and he that hath not, that also which he hath shall be taken away from him."
      ]
    }
  ]
}