{
  "date": "2026-01-08",
  "url": "https://www.catholicgallery.org/mass-reading/080126/",
  "title": "Daily Mass Readings for Thursday, 8 January 2026",
  "feast": "Christmas Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First John 4: 19 – 5: 4",
      "reference": "First John 4: 19 – 5: 4",
      "verses": [
        "19 Let us therefore love God, because God first hath loved us.",
        "20 If any man say, I love God, and hateth his brother; he is a liar. For he that loveth not his brother, whom he seeth, how can he love God, whom he seeth not?",
        "21 And this commandment we have from God, that he, who loveth God, love also his brother.",
        "5:1 Whosoever believeth that Jesus is the Christ, is born of God. And every one that loveth him who begot, loveth him also who is born of him.",
        "2 In this we know that we love the children of God: when we love God, and keep his commandments.",
        "3 For this is the charity of God, that we keep his commandments: and his commandments are not heavy.",
        "4 For whatsoever is born of God, overcometh the world: and this is the victory which overcometh the world, our faith."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 72: 1-2, 14 and 15bc, 17",
      "reference": "Psalms 72: 1-2, 14 and 15bc, 17",
      "verses": [
        "R. (11) Lord, every nation on earth will adore you.",
        "1-2 Give to the king thy judgment, O God: and to the king’s son thy justice: To judge thy people with justice, and thy poor with judgment.",
        "R. Lord, every nation on earth will adore you.",
        "14 He shall redeem their souls from usuries and iniquity: and their names shall be honourable in his sight.",
        "15bc For him they shall always adore: they shall bless him all the day.",
        "R. Lord, every nation on earth will adore you.",
        "17 Let his name be blessed for evermore: his name continueth before the sun. And in him shall all the tribes of the earth be blessed: all nations shall magnify him.",
        "R. Lord, every nation on earth will adore you."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 4: 18",
      "reference": "Luke 4: 18",
      "verses": [
        "R. Alleluia, alleluia.",
        "18 The Lord has sent me to bring glad tidings to the poor and to proclaim liberty to captives.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 4: 14-22",
      "reference": "Luke 4: 14-22",
      "verses": [
        "14 And Jesus returned in the power of the spirit, into Galilee, and the fame of him went out through the whole country.",
        "15 And he taught in their synagogues, and was magnified by all.",
        "16 And he came to Nazareth, where he was brought up: and he went into the synagogue, according to his custom, on the sabbath day; and he rose up to read.",
        "17 And the book of Isaias the prophet was delivered unto him. And as he unfolded the book, he found the place where it was written:",
        "18 The Spirit of the Lord is upon me. Wherefore he hath anointed me to preach the gospel to the poor, he hath sent me to heal the contrite of heart,",
        "19 To preach deliverance to the captives, and sight to the blind, to set at liberty them that are bruised, to preach the acceptable year of the Lord, and the day of reward.",
        "20 And when he had folded the book, he restored it to the minister, and sat down. And the eyes of all in the synagogue were fixed on him.",
        "21 And he began to say to them: This day is fulfilled this scripture in your ears.",
        "22 And all gave testimony to him: and they wondered at the words of grace that proceeded from his mouth, and they said: Is not this the son of Joseph?"
      ]
    }
  ]
}