{
  "date": "2026-01-24",
  "url": "https://www.catholicgallery.org/mass-reading/240126/",
  "title": "Daily Mass Readings for Saturday, 24 January 2026",
  "feast": "Francis De Sales, Bishop, Religious Founder, Doctor Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Samuel 1: 1-4, 11-12, 19, 23-27",
      "reference": "Second Samuel 1: 1-4, 11-12, 19, 23-27",
      "verses": [
        "1 Now it came to pass, after Saul was dead, that David returned from the slaughter of the Amalecites, and abode two days in Siceleg.",
        "2 And on the third day, there appeared a man who came out of Saul’s camp, with his garments rent, and dust strewed on his head: and when he came to David, he fell upon his face, and adored.",
        "3 And David said to him: From whence comest thou? And he said to him: I am fled out of the camp of Israel.",
        "4 And David said unto him: What is the matter that is come to pass? tell me. He said: The people are fled from the battle, and many of the people are fallen and dead: moreover Saul and Jonathan his son are slain.",
        "11 Then David took hold of his garments and rent them, and likewise all the men that were with him.",
        "12 And they mourned, and wept, and fasted until evening for Saul, and for Jonathan his son, and for the people of the Lord, and for the house of Israel, because they were fallen by the sword.",
        "19 The illustrious of Israel are slain upon thy mountains: how are the valiant fallen?",
        "23 Saul and Jonathan, lovely, and comely in their life, even in death they were not divided: they were swifter than eagles, stronger than lions.",
        "24 Ye daughters of Israel, weep over Saul, who clothed you with scarlet in delights, who gave ornaments of gold for your attire.",
        "25 How are the valiant fallen in battle? Jonathan slain in the high places?",
        "26 I grieve for thee, my brother Jonathan: exceeding beautiful, and amiable to me above the love of women. As the mother loveth her only son, so did I love thee.",
        "27 How are the valiant fallen, and the weapons of war perished?"
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 80: 2-3, 5-7",
      "reference": "Psalms 80: 2-3, 5-7",
      "verses": [
        "R. (4b) Let us see your face, Lord, and we shall be saved.",
        "2 Give ear, O thou that rulest Israel: thou that leadest Joseph like a sheep. Thou that sittest upon the cherubims, shine forth",
        "3 Before Ephraim, Benjamin, and Manasses. Stir up thy might, and come to save us.",
        "R. Let us see your face, Lord, and we shall be saved.",
        "5 O Lord God of hosts, how long wilt thou be angry against the prayer of thy servant?",
        "6 How long wilt thou feed us with the bread of tears: and give us for our drink tears in measure?",
        "7 Thou hast made us to be a contradiction to our neighbours: and our enemies have scoffed at us.",
        "R. Let us see your face, Lord, and we shall be saved."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Acts 16: 14b",
      "reference": "Acts 16: 14b",
      "verses": [
        "R. Alleluia, alleluia.",
        "14b Open our hearts, O Lord, to listen to the words of your Son.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 3: 20-21",
      "reference": "Mark 3: 20-21",
      "verses": [
        "20 And they come to a house, and the multitude cometh together again, so that they could not so much as eat bread.",
        "21 And when his friends had heard of it, they went out to lay hold on him. For they said: He is become mad."
      ]
    }
  ]
}