{
  "date": "2026-01-01",
  "url": "https://www.catholicgallery.org/mass-reading/010126/",
  "title": "Daily Mass Readings for Thursday, 1 January 2026",
  "feast": "Mary, Mother of God Solemnity (Octave of Christmas). Holy day of Obligation.",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Numbers 6: 22-27",
      "reference": "Numbers 6: 22-27",
      "verses": [
        "22 And the Lord spoke to Moses, saying:",
        "23 Say to Aaron and his sons: Thus shall you bless the children of Israel, and you shall say to them:",
        "24 The Lord bless thee, and keep thee.",
        "25 The Lord shew his face to thee, and have mercy on thee.",
        "26 The Lord turn his countenance to thee, and give thee peace.",
        "27 And they shall invoke my name upon the children of Israel, and I will bless them."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 67: 2-3, 5, 6, 8",
      "reference": "Psalms 67: 2-3, 5, 6, 8",
      "verses": [
        "R. (2a) May God bless us in his mercy.",
        "2 May God have mercy on us, and bless us: may he cause the light of his countenance to shine upon us, and may he have mercy on us.",
        "3 That we may know thy way upon earth: thy salvation in all nations.",
        "R. May God bless us in his mercy.",
        "5 Let the nations be glad and rejoice: for thou judgest the people with justice, and directest the nations upon earth.",
        "R. May God bless us in his mercy.",
        "6 Let the people, O God, confess to thee: let all the people give praise to thee:",
        "8 May God bless us: and all the ends of the earth fear him.",
        "R. May God bless us in his mercy."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Galatians 4: 4-7",
      "reference": "Galatians 4: 4-7",
      "verses": [
        "4 But when the fulness of the time was come, God sent his Son, made of a woman, made under the law:",
        "5 That he might redeem them who were under the law: that we might receive the adoption of sons.",
        "6 And because you are sons, God hath sent the Spirit of his Son into your hearts, crying: Abba, Father.",
        "7 Therefore now he is not a servant, but a son. And if a son, an heir also through God."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Hebrews 1: 1-2",
      "reference": "Hebrews 1: 1-2",
      "verses": [
        "R. Alleluia, alleluia.",
        "1-2 In the past God spoke to our ancestors through the prophets; in these last days, he has spoken to us through the Son.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 2: 16-21",
      "reference": "Luke 2: 16-21",
      "verses": [
        "16 And they came with haste; and they found Mary and Joseph, and the infant lying in the manger.",
        "17 And seeing, they understood of the word that had been spoken to them concerning this child.",
        "18 And all that heard, wondered; and at those things that were told them by the shepherds.",
        "19 But Mary kept all these words, pondering them in her heart.",
        "20 And the shepherds returned, glorifying and praising God, for all the things they had heard and seen, as it was told unto them.",
        "21 And after eight days were accomplished, that the child should be circumcised, his name was called JESUS, which was called by the angel, before he was conceived in the womb."
      ]
    }
  ]
}