{
  "date": "2026-01-28",
  "url": "https://www.catholicgallery.org/mass-reading/280126/",
  "title": "Daily Mass Readings for Wednesday, 28 January 2026",
  "feast": "Thomas Aquinas, Priest, Religious, Doctor Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Samuel 7: 4-17",
      "reference": "Second Samuel 7: 4-17",
      "verses": [
        "4 But it came to pass that night, that the word of the Lord came to Nathan, saying:",
        "5 Go, and say to my servant David: Thus saith the Lord: Shalt thou build me a house to dwell in?",
        "6 Whereas I have not dwelt in a house from the day that I brought the children of Israel out of the land of Egypt even to this day: but have walked in a tabernacle, and in a tent.",
        "7 In all the places that I have gone through with all the children of Israel, did ever I speak a word to any one of the tribes of Israel, whom I commanded to feed my people Israel, saying: Why have you not built me a house of cedar?",
        "8 And now thus shalt thou speak to my servant David: Thus saith the Lord of hosts: a I took thee out of the pastures from following the sheep to be ruler over my people Israel:",
        "9 And I have been with thee wheresoever thou hast walked, and have slain all thy enemies from before thy face: and I have made thee a great man, like unto the name of the great ones that are on the earth.",
        "10 And I will appoint a place for my people Israel, and I will plant them, and they shall dwell therein, and shall be disturbed no more: neither shall the children of iniquity afflict them any more as they did before,",
        "11 From the day that I appointed judges over my people Israel: and I will give thee rest from all thy enemies. And the Lord foretelleth to thee, that the Lord will make thee a house.",
        "12 And when thy days shall be fulfilled, and thou shalt sleep with thy fathers, I will raise up thy seed after thee, which shall proceed out of thy bowels, and I will establish his kingdom.",
        "13 He shall build a house to my name, and I will establish the throne of his kingdom for ever.",
        "14 I will be to him a father, and he shall be to me a son: and if he commit any iniquity, I will correct him with the rod of men, and with the stripes of the children of men.",
        "15 But my mercy I will not take away from him, as I took it from Saul, whom I removed from before my face.",
        "16 And thy house shall be faithful, and thy kingdom for ever before thy face, and thy throne shall be firm for ever.",
        "17 According to all these words and according to all this vision, so did Nathan speak to David."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 89: 4-5, 27-28, 29-30",
      "reference": "Psalms 89: 4-5, 27-28, 29-30",
      "verses": [
        "R. (29a) For ever I will maintain my love for my servant.",
        "4 I have made a covenant with my elect: I have sworn to David my servant:",
        "5 Thy seed will I settle for ever. And I will build up thy throne unto generation and generation.",
        "R. For ever I will maintain my love for my servant.",
        "27 He shall cry out to me: Thou art my father: my God, and the support of my salvation.",
        "28 And I will make him my firstborn, high above the kings of the earth.",
        "R. For ever I will maintain my love for my servant.",
        "29 I will keep my mercy for him for ever: and my covenant faithful to him.",
        "30 And I will make his seed to endure for evermore: and his throne as the days of heaven.",
        "R. For ever I will maintain my love for my servant."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia",
      "reference": "",
      "verses": [
        "R. Alleluia, alleluia.",
        "The seed is the word of God, Christ is the sower; all who come to him will live for ever.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 4: 1-20",
      "reference": "Mark 4: 1-20",
      "verses": [
        "1 And again he began to teach by the sea side; and a great multitude was gathered together unto him, so that he went up into a ship, and sat in the sea; and all the multitude was upon the land by the sea side.",
        "2 And he taught them many things in parables, and said unto them in his doctrine:",
        "3 Hear ye: Behold, the sower went out to sow.",
        "4 And whilst he sowed, some fell by the way side, and the birds of the air came and ate it up.",
        "5 And other some fell upon stony ground, where it had not much earth; and it shot up immediately, because it had no depth of earth.",
        "6 And when the sun was risen, it was scorched; and because it had no root, it withered away.",
        "7 And some fell among thorns; and the thorns grew up, and choked it, and it yielded no fruit.",
        "8 And some fell upon good ground; and brought forth fruit that grew up, and increased and yielded, one thirty, another sixty, and another a hundred.",
        "9 And he said: He that hath ears to hear, let him hear.",
        "10 And when he was alone, the twelve that were with him asked him the parable.",
        "11 And he said to them: To you it is given to know the mystery of the kingdom of God: but to them that are without, all things are done in parables:",
        "12 That seeing they may see, and not perceive; and hearing they may hear, and not understand: lest at any time they should be converted, and their sins should be forgiven them.",
        "13 And he saith to them: Are you ignorant of this parable? and how shall you know all parables?",
        "14 He that soweth, soweth the word.",
        "15 And these are they by the way side, where the word is sown, and as soon as they have heard, immediately Satan cometh and taketh away the word that was sown in their hearts.",
        "16 And these likewise are they that are sown on the stony ground: who when they have heard the word, immediately receive it with joy.",
        "17 And they have no root in themselves, but are only for a time: and then when tribulation and persecution ariseth for the word they are presently scandalized.",
        "18 And others there are who are sown among thorns: these are they that hear the word,",
        "19 And the cares of the world, and the deceitfulness of riches, and the lusts after other things entering in choke the word, and it is made fruitless.",
        "20 And these are they who are sown upon the good ground, who hear the word, and receive it, and yield fruit, the one thirty, another sixty, and another a hundred."
      ]
    }
  ]
}