{
  "date": "2026-01-15",
  "url": "https://www.catholicgallery.org/mass-reading/150126/",
  "title": "Daily Mass Readings for Thursday, 15 January 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Samuel 4: 1-11",
      "reference": "First Samuel 4: 1-11",
      "verses": [
        "1 And it came to pass in those days, that the Philistines gathered themselves together to fight: and Israel went out to war against the Philistines, and camped by the Stone of help. And the Philistines came to Aphec,",
        "2 And put their army in array against Israel. And when they had joined battle, Israel turned their backs to the Philistines, and there was slain in that fight here and there in the fields about four thousand men.",
        "3 And the people returned to the camp: and the ancients of Israel said: Why hath the Lord defeated us today before the Philistines? Let us fetch unto us the ark of the covenant of the Lord from Silo, and let it come in the midst of us, that it may save us from the hand of our enemies.",
        "4 So the people sent to Silo, and they brought from thence the ark of the covenant of the Lord of hosts sitting upon the cherubims: and the two sons of Heli, Ophni and Phinees, were with the ark of the covenant of God.",
        "5 And when the ark of the covenant of the Lord was come into the camp, all Israel shouted with a great shout, and the earth rang again.",
        "6 And the Philistines heard the noise of the shout, and they said: What is this noise of a great shout in the camp of the Hebrews? And they understood that the ark of the Lord was come into the camp.",
        "7 And the Philistines were afraid, saying: God is come into the camp. And sighing, they said:",
        "8 Woe to us: for there was no such great joy yesterday and the day before: Woe to us. Who shall deliver us from the hand of these high gods? these are the gods that struck Egypt with all the plagues in the desert.",
        "9 Take courage and behave like men, ye Philistines: lest you come to be servants to the Hebrews, as they have served you: take courage and fight.",
        "10 So the Philistines fought, and Israel was overthrown, and every man fled to his own dwelling: and there was an exceeding great slaughter; for there fell of Israel thirty thousand footmen.",
        "11 And the ark of God was taken: and the two sons of Heli, Ophni and Phinees, were slain."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 44: 10-11, 14-15, 24-25",
      "reference": "Psalms 44: 10-11, 14-15, 24-25",
      "verses": [
        "R. (27b) Redeem us, Lord, because of your mercy.",
        "10 But now thou hast cast us off, and put us to shame: and thou, O God, wilt not go out with our armies.",
        "11 Thou hast made us turn our back to our enemies: and they that hated us plundered for themselves.",
        "R. Redeem us, Lord, because of your mercy.",
        "14 Thou hast made us a reproach to our neighbours, a scoff and derision to them that are round about us.",
        "15 Thou hast made us a byword among the Gentiles: a shaking of the head among the people.",
        "R. Redeem us, Lord, because of your mercy.",
        "24-25 Why turnest thou face away? and forgettest our want and our trouble? For our soul is humbled down to the dust: our belly cleaveth to the earth.",
        "R. Redeem us, Lord, because of your mercy."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 4: 23",
      "reference": "Matthew 4: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Jesus preached the Gospel of the Kingdom and cured every disease among the people.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 1: 40-45",
      "reference": "Mark 1: 40-45",
      "verses": [
        "40 And there came a leper to him, beseeching him, and kneeling down said to him: If thou wilt, thou canst make me clean.",
        "41 And Jesus having compassion on him, stretched forth his hand; and touching him, saith to him: I will. Be thou made clean.",
        "42 And when he had spoken, immediately the leprosy departed from him, and he was made clean.",
        "43 And he strictly charged him, and forthwith sent him away.",
        "44 And he saith to him: See thou tell no one; but go, shew thyself to the high priest, and offer for thy cleansing the things that Moses commanded, for a testimony to them.",
        "45 But he being gone out, began to publish and to blaze abroad the word: so that he could not openly go into the city, but was without in desert places: and they flocked to him from all sides."
      ]
    }
  ]
}