{
  "date": "2026-01-27",
  "url": "https://www.catholicgallery.org/mass-reading/270126/",
  "title": "Daily Mass Readings for Tuesday, 27 January 2026",
  "feast": "Ordinary Weekday/ Angela Merici, Virgin, Religious Founder",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Samuel 6: 12b-15, 17-19",
      "reference": "Second Samuel 6: 12b-15, 17-19",
      "verses": [
        "12b David went, and brought away the ark of God out of the house of Obededom into the city of David with joy. And there were with David seven choirs, and calves for victims.",
        "13 And when they that carried the ark of the Lord had gone six paces, he sacrificed an ox and a ram:",
        "14 And David danced with all his might before the Lord: and David was girded with a linen ephod.",
        "15 And David and all the house of Israel brought the ark of the covenant of the Lord with joyful shouting, and with sound of trumpet.",
        "17 And they brought the ark of the Lord, and set it in its place in the midst of the tabernacle, which David had pitched for it: and David offered holocausts, and peace offerings before the Lord.",
        "18 And when he had made an end of offering holocausts and peace offerings, he blessed the people in the name of the Lord of hosts.",
        "19 And he distributed to all the multitude of Israel both men and women, to every one, a cake of bread, and a piece of roasted beef, and fine flour fried with oil: and all the people departed every one to his house."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 24: 7, 8, 9, 10",
      "reference": "Psalms 24: 7, 8, 9, 10",
      "verses": [
        "R. (8) Who is this king of glory? It is the Lord!",
        "7 Lift up your gates, O ye princes, and be ye lifted up, O eternal gates: and the King of Glory shall enter in.",
        "R. Who is this king of glory? It is the Lord!",
        "8 Who is this King of Glory? the Lord who is strong and mighty: the Lord mighty in battle.",
        "R. Who is this king of glory? It is the Lord!",
        "9 Lift up your gates, O ye princes, and be ye lifted up, O eternal gates: and the King of Glory shall enter in.",
        "R. Who is this king of glory? It is the Lord!",
        "10 Who is this King of Glory? the Lord of hosts, he is the King of Glory.",
        "R. Who is this king of glory? It is the Lord!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 11: 25",
      "reference": "Matthew 11: 25",
      "verses": [
        "R. Alleluia, alleluia.",
        "25 Blessed are you, Father, Lord of heaven and earth; you have revealed to little ones the mysteries of the Kingdom.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 3: 31-35",
      "reference": "Mark 3: 31-35",
      "verses": [
        "31 And his mother and his brethren came; and standing without, sent unto him, calling him.",
        "32 And the multitude sat about him; and they say to him: Behold thy mother and thy brethren without seek for thee.",
        "33 And answering them, he said: Who is my mother and my brethren?",
        "34 And looking round about on them who sat about him, he saith: Behold my mother and my brethren.",
        "35 For whosoever shall do the will of God, he is my brother, and my sister, and mother."
      ]
    }
  ]
}