{
  "date": "2026-08-01",
  "url": "https://www.catholicgallery.org/mass-reading/010826/",
  "title": "Daily Mass Readings for Saturday, 1 August 2026",
  "feast": "Alphonsus Liguori, Bishop, Religious Founder, Doctor Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Jeremiah 26: 11-16, 24",
      "reference": "Jeremiah 26: 11-16, 24",
      "verses": [
        "11 And the priests and the prophets spoke to the princes, and to all the people, saying: The judgement of death is for this man: because he hath prophesied against this city, as you have heard with your ears.",
        "12 Then Jeremias spoke to all the princes, and to all the people, saying: The Lord sent me to prophesy concerning this house, and concerning this city all the words that you have heard.",
        "13 Now therefore amend your ways, and your doings, and hearken to the voice of the Lord your God: and the Lord will repent him of the evil that he hath spoken against you.",
        "14 But as for me, behold I am in your hands: do with me what is good and right in your eyes:",
        "15 But know ye, and understand, that if you put me to death, you will shed innocent blood against your own selves, and against this city, and the inhabitants thereof. For in truth the Lord sent me to you, to speak all these words in your hearing.",
        "16 Then the princes, and all the people said to the priests, and to the prophets: There is no judgement of death for this man: for he hath spoken to us in the name of the Lord our God.",
        "24 So the hand of Ahicam the son of Saphan was with Jeremias, that he should not be delivered into the hands of the people, to put him to death."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 69: 15-16, 30-31, 33-34",
      "reference": "Psalms 69: 15-16, 30-31, 33-34",
      "verses": [
        "R. (14c) Lord, in your great love, answer me.",
        "15 Draw me out of the mire, that I may not stick fast: deliver me from them that hate me, and out of the deep waters.",
        "16 Let not the tempest of water drown me, nor the deep swallow me up: and let not the pit shut her mouth upon me.",
        "R. Lord, in your great love, answer me.",
        "30 But I am poor and sorrowful: thy salvation, O God, hath set me up.",
        "31 I will praise the name of God with a canticle: and I will magnify him with praise.",
        "R. Lord, in your great love, answer me.",
        "33 Let the poor see and rejoice: seek ye God, and your soul shall live.",
        "34 For the Lord hath heard the poor: and hath not despised his prisoners.",
        "R. Lord, in your great love, answer me."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 5: 10",
      "reference": "Matthew 5: 10",
      "verses": [
        "R. Alleluia, alleluia.",
        "10 Blessed are they who are persecuted for the sake of righteousness for theirs is the Kingdom of heaven.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 14: 1-12",
      "reference": "Matthew 14: 1-12",
      "verses": [
        "1 At the time Herod the Tetrarch heard the fame of Jesus.",
        "2 And he said to his servants: This is John the Baptist: he is risen from the dead, and therefore mighty works shew forth themselves in him.",
        "3 For Herod had apprehended John and bound him, and put him into prison, because of Herodias, his brother’s wife.",
        "4 For John said to him: It is not lawful for thee to have her.",
        "5 And having a mind to put him to death, he feared the people: because they esteemed him as a prophet.",
        "6 But on Herod’s birthday, the daughter of Herodias danced before them: and pleased Herod.",
        "7 Whereupon he promised with an oath, to give her whatsoever she would ask of him.",
        "8 But she being instructed before by her mother, said: Give me here in a dish the head of John the Baptist.",
        "9 And the king was struck sad: yet because of his oath, and for them that sat with him at table, he commanded it to be given.",
        "10 And he sent, and beheaded John in the prison.",
        "11 And his head was brought in a dish: and it was given to the damsel, and she brought it to her mother.",
        "12 And his disciples came and took the body, and buried it, and came and told Jesus."
      ]
    }
  ]
}