{
  "date": "2026-08-11",
  "url": "https://www.catholicgallery.org/mass-reading/110826/",
  "title": "Daily Mass Readings for Tuesday, 11 August 2026",
  "feast": "Clare, Virgin, Religious Founder Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ezekiel 2: 8 – 3: 4",
      "reference": "Ezekiel 2: 8 – 3: 4",
      "verses": [
        "8 But thou, O son of man, hear all that I say to thee: and do not thou provoke me, as that house provoketh me: open thy mouth, and eat what I give thee.",
        "9 And I looked, and behold, a hand was sent to me, wherein was a book rolled up:",
        "10 And he spread it before me, and it was written within and without: and there were written in it lamentations, and canticles, and woe.",
        "3:1 And he said to me: Son of man, eat all that thou shalt find: eat this book, and go speak to the children of Israel.",
        "2 And I opened my mouth, and he caused me to eat that book:",
        "3 And he said to me: Son of man, thy belly shall eat, and thy bowels shall be filled with this book, which I give thee. And I did eat it: and it was sweet as honey in my mouth.",
        "4 And he said to me: Son of man, go to the house of Israel, and thou shalt speak my words to them."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 119: 14, 24, 72, 103, 111, 131",
      "reference": "Psalms 119: 14, 24, 72, 103, 111, 131",
      "verses": [
        "R. (103a) How sweet to my taste is your promise!",
        "14 I have been delighted in the way of thy testimonies, as in all riches.",
        "R. How sweet to my taste is your promise!",
        "24 For thy testimonies are my meditation: and thy justifications my counsel.",
        "R. How sweet to my taste is your promise!",
        "72 The law of thy mouth is good to me, above thousands of gold and silver.",
        "R. How sweet to my taste is your promise!",
        "103 How sweet are thy words to my palate! more than honey to my mouth.",
        "R. How sweet to my taste is your promise!",
        "111 I have purchased thy testimonies for an inheritance for ever: because they are a joy to my heart.",
        "R. How sweet to my taste is your promise!",
        "131 I opened my mouth and panted: because I longed for thy commandments.",
        "R. How sweet to my taste is your promise!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 11: 29",
      "reference": "Matthew 11: 29",
      "verses": [
        "R. Alleluia, alleluia.",
        "29 Take my yoke upon you and learn from me, for I am meek and humble of heart.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 18: 1-5, 10, 12-14",
      "reference": "Matthew 18: 1-5, 10, 12-14",
      "verses": [
        "1 At that hour the disciples came to Jesus, saying: Who thinkest thou is the greater in the kingdom of heaven?",
        "2 And Jesus calling unto him a little child, set him in the midst of them,",
        "3 And said: Amen I say to you, unless you be converted, and become as little children, you shall not enter into the kingdom of heaven.",
        "4 Whosoever therefore shall humble himself as this little child, he is the greater in the kingdom of heaven.",
        "5 And he that shall receive one such little child in my name, receiveth me.",
        "10 See that you despise not one of these little ones: for I say to you, that their angels in heaven always see the face of my Father who is in heaven.",
        "12 What think you? If a man have an hundred sheep, and one of them should go astray: doth he not leave the ninety-nine in the mountains, and go to seek that which is gone astray?",
        "13 And if it so be that he find it: Amen I say to you, he rejoiceth more for that, than for the ninety-nine that went not astray.",
        "14 Even so it is not the will of your Father, who is in heaven, that one of these little ones should perish."
      ]
    }
  ]
}