{
  "date": "2026-08-13",
  "url": "https://www.catholicgallery.org/mass-reading/130826/",
  "title": "Daily Mass Readings for Thursday, 13 August 2026",
  "feast": "Ordinary Weekday/ Pontian, Pope, Martyr, and Hippolytus, Priest, Martyr",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ezekiel 12: 1-12",
      "reference": "Ezekiel 12: 1-12",
      "verses": [
        "1 And the word of the Lord came to me, saying:",
        "2 Son of man, thou dwellest in the midst of a provoking house: who have eyes to see, and see not: and ears to hear, and hear not: for they are a provoking house.",
        "3 Thou, therefore, O son of man, prepare thee all necessaries for removing, and remove by day in their sight: and thou shalt remove out of thy place to another place in their sight, if so be they will regard it: for they are a provoking house.",
        "4 And thou shalt bring forth thy furniture as the furniture of one that is removing by day in their sight: and thou shalt go forth in the evening in their presence, as one goeth forth that removeth his dwelling.",
        "5 Dig thee a way through the wall before their eyes: and thou shalt go forth through it.",
        "6 In their sight thou shalt be carried out upon men’s shoulders, thou shalt be carried out in the dark: thou shalt cover thy face, and shalt not see the ground: for I have set thee for a sign of things to come to the house of Israel.",
        "7 I did therefore as he had commanded me: I brought forth my goods by day, as the goods of one that removeth: and in the evening I digged through the wall with my hand: and I went forth in the dark, and was carried on men’s shoulders in their sight.",
        "8 And the word of the Lord came to me in the morning, saying:",
        "9 Son of man, hath not the house of Israel, the provoking house, said to thee: What art thou doing?",
        "10 Say to them: Thus saith the Lord God: This burden concerneth my prince that is in Jerusalem, and all the house of Israel, that are among them.",
        "11 Say: I am a sign of things to come to you: as I have done, so shall it be done to them: they shall be removed from their dwellings, and go into captivity.",
        "12 And the prince that is in the midst of them, shall be carried on shoulders, he shall go forth in the dark: they shall dig through the wall to bring him out: his face shall be covered, that he may not see the ground with his eyes."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 78: 56-57, 58-59, 61-62",
      "reference": "Psalms 78: 56-57, 58-59, 61-62",
      "verses": [
        "R. (7b) Do not forget the works of the Lord!",
        "56 Yet they tempted, and provoked the most high God: and they kept not his testimonies.",
        "57 And they turned away, and kept not the covenant: even like their fathers they were turned aside as a crooked bow.",
        "R. Do not forget the works of the Lord!",
        "58 They provoked him to anger on their hills: and moved him to jealousy with their graven things.",
        "59 God heard, and despised them, and he reduced Israel exceedingly as it were to nothing.",
        "R. Do not forget the works of the Lord!",
        "61 And he delivered their strength into captivity: and their beauty into the hands of the enemy.",
        "62 And he shut up his people under the sword: and he despised his inheritance.",
        "R. Do not forget the works of the Lord!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Psalms 119: 135",
      "reference": "Psalms 119: 135",
      "verses": [
        "R. Alleluia, alleluia.",
        "135 Let your countenance shine upon your servant and teach me your statutes.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 18: 21 – 19: 1",
      "reference": "Matthew 18: 21 – 19: 1",
      "verses": [
        "21 Then came Peter unto him and said: Lord, how often shall my brother offend against me, and I forgive him? till seven times?",
        "22 Jesus saith to him: I say not to thee, till seven times; but till seventy times seven times.",
        "23 Therefore is the kingdom of heaven likened to a king, who would take an account of his servants.",
        "24 And when he had begun to take the account, one was brought to him, that owed him ten thousand talents.",
        "25 And as he had not wherewith to pay it, his lord commanded that he should be sold, and his wife and children and all that he had, and payment to be made.",
        "26 But that servant falling down, besought him, saying: Have patience with me, and I will pay thee all.",
        "27 And the lord of that servant being moved with pity, let him go and forgave him the debt.",
        "28 But when that servant was gone out, he found one of his fellow servants that owed him an hundred pence: and laying hold of him, throttled him, saying: Pay what thou owest.",
        "29 And his fellow servant falling down, besought him, saying: Have patience with me, and I will pay thee all.",
        "30 And he would not: but went and cast him into prison, till he paid the debt.",
        "31 Now his fellow servants seeing what was done, were very much grieved, and they came and told their lord all that was done.",
        "32 Then his lord called him; and said to him: Thou wicked servant, I forgave thee all the debt, because thou besoughtest me:",
        "33 Shouldst not thou then have had compassion also on thy fellow servant, even as I had compassion on thee?",
        "34 And his lord being angry, delivered him to the torturers until he paid all the debt.",
        "35 So also shall my heavenly Father do to you, if you forgive not every one his brother from your hearts.",
        "19:1 And it came to pass when Jesus had ended these words, he departed from Galilee, and came into the coasts of Judea, beyond Jordan."
      ]
    }
  ]
}