{
  "date": "2026-08-08",
  "url": "https://www.catholicgallery.org/mass-reading/080826/",
  "title": "Daily Mass Readings for Saturday, 8 August 2026",
  "feast": "Dominic, Priest, Religious Founder Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Habakkuk 1: 12 – 2: 4",
      "reference": "Habakkuk 1: 12 – 2: 4",
      "verses": [
        "12 Wast thou not from the beginning, O Lord my God, my holy one, and we shall not die? Lord, thou hast appointed him for judgment: and made him strong for correction.",
        "13 Thy eyes are too pure to behold evil, and thou canst not look on iniquity. Why lookest thou upon them that do unjust things, and holdest thy peace when the wicked devoureth the man that is more just than himself?",
        "14 And thou wilt make men as the fishes of the sea, and as the creeping things that have no ruler.",
        "15 He lifted up all them with his hook, he drew them in his drag, and gathered them into his net: for this he will be glad and rejoice.",
        "16 Therefore will he offer victims to his drag, and he will sacrifice to his net: because through them his portion is made fat, and his meat dainty.",
        "17 For this cause therefore he spreadeth his net, and will not spare continually to slay the nations.",
        "2:1 I will stand upon my watch, and fix my foot upon the tower: and I will watch, to see what will be said to me, and what I may answer to him that reproveth me.",
        "2 And the Lord answered me, and said: Write the vision, and make it plain upon tables: that he that readeth it may run over it.",
        "3 For as yet the vision is far off, and it shall appear at the end, and shall not lie: if it make any delay, wait for it: for it shall surely come, and it shall not be slack.",
        "4 Behold, he that is unbelieving, his soul shall not be right in himself: but the just shall live in his faith."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 9: 8-9, 10-11, 12-13",
      "reference": "Psalms 9: 8-9, 10-11, 12-13",
      "verses": [
        "R. (11b) You forsake not those who seek you, O Lord.",
        "8 But the Lord remaineth for ever. He hath prepared his throne in judgment:",
        "9 And he shall judge the world in equity, he shall judge the people in justice.",
        "R. You forsake not those who seek you, O Lord.",
        "10 And the Lord is become a refuge for the poor: a helper in due time in tribulation.",
        "11 And let them trust in thee who know thy name: for thou hast not forsaken them that seek thee, O Lord.",
        "R. You forsake not those who seek you, O Lord.",
        "12 Sing ye to the Lord, who dwelleth in Sion: declare his ways among the Gentiles:",
        "13 For requiring their blood he hath remembered the: he hath not forgotten the cry of the poor.",
        "R. You forsake not those who seek you, O Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Second Timothy 1: 10",
      "reference": "Second Timothy 1: 10",
      "verses": [
        "R. Alleluia, alleluia.",
        "10 Our Savior Jesus Christ has destroyed death and brought life to light through the Gospel.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 17: 14-20",
      "reference": "Matthew 17: 14-20",
      "verses": [
        "14 And when he was come to the multitude, there came to him a man falling down on his knees before him, saying: Lord, have pity on my son, for he is a lunatic, and suffereth much: for he falleth often into the fire, and often into the water.",
        "15 And I brought him to thy disciples, and they could not cure him.",
        "16 Then Jesus answered and said: O unbelieving and perverse generation, how long shall I be with you? How long shall I suffer you? bring him hither to me.",
        "17 And Jesus rebuked him, and the devil went out of him, and the child was cured from that hour.",
        "18 Then came the disciples to Jesus secretly, and said: Why could not we cast him out?",
        "19 Jesus said to them: Because of your unbelief. For, amen I say to you, if you have faith as a grain of mustard seed, you shall say to this mountain, Remove from hence hither, and it shall remove; and nothing shall be impossible to you.",
        "20 But this kind is not cast out but by prayer and fasting."
      ]
    }
  ]
}