{
  "date": "2026-08-27",
  "url": "https://www.catholicgallery.org/mass-reading/270826/",
  "title": "Daily Mass Readings for Thursday, 27 August 2026",
  "feast": "Monica, Married Woman Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Corinthians 1: 1-9",
      "reference": "First Corinthians 1: 1-9",
      "verses": [
        "1 Paul, called to be an apostle of Jesus Christ by the will of God, and Sosthenes a brother,",
        "2 To the church of God that is at Corinth, to them that are sanctified in Christ Jesus, called to be saints, with all that invoke the name of our Lord Jesus Christ, in every place of theirs and ours.",
        "3 Grace to you, and peace from God our Father, and from the Lord Jesus Christ.",
        "4 I give thanks to my God always for you, for the grace of God that is given you in Christ Jesus,",
        "5 That in all things you are made rich in him, in all utterance, and in all knowledge;",
        "6 As the testimony of Christ was confirmed in you,",
        "7 So that nothing is wanting to you in any grace, waiting for the manifestation of our Lord Jesus Christ.",
        "8 Who also will confirm you unto the end without crime, in the day of the coming of our Lord Jesus Christ.",
        "9 God is faithful: by whom you are called unto the fellowship of his Son Jesus Christ our Lord."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 145: 2-3, 4-5, 6-7",
      "reference": "Psalms 145: 2-3, 4-5, 6-7",
      "verses": [
        "R. (1) I will praise your name for ever, Lord.",
        "2 Every day I will bless thee: and I will praise thy name for ever; yea, for ever and ever.",
        "3 Great is the Lord, and greatly to be praised: and of his greatness there is no end.",
        "R. I will praise your name for ever, Lord.",
        "4 Generation and generation shall praise thy works: and they shall declare thy power.",
        "5 They shall speak of the magnificence of the glory of thy holiness: and shall tell thy wondrous works.",
        "R. I will praise your name for ever, Lord.",
        "6 And they shall speak of the might of thy terrible acts: and shall declare thy greatness.",
        "7 They shall publish the memory of the abundance of thy sweetness: and shall rejoice in thy justice.",
        "R. I will praise your name for ever, Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 24: 42a, 44",
      "reference": "Matthew 24: 42a, 44",
      "verses": [
        "R. Alleluia, alleluia.",
        "42a, 44 Stay awake! For you do not know when the Son of Man will come.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 24: 42-51",
      "reference": "Matthew 24: 42-51",
      "verses": [
        "42 Watch ye therefore, because ye know not what hour your Lord will come.",
        "43 But know this ye, that if the goodman of the house knew at what hour the thief would come, he would certainly watch, and would not suffer his house to be broken open.",
        "44 Wherefore be you also ready, because at what hour you know not the Son of man will come.",
        "45 Who, thinkest thou, is a faithful and wise servant, whom his lord hath appointed over his family, to give them meat in season.",
        "46 Blessed is that servant, whom when his lord shall come he shall find so doing.",
        "47 Amen I say to you, he shall place him over all his goods.",
        "48 But if that evil servant shall say in his heart: My lord is long a coming:",
        "49 And shall begin to strike his fellow servants, and shall eat and drink with drunkards:",
        "50 The lord of that servant shall come in a day that he hopeth not, and at an hour that he knoweth not:",
        "51 And shall separate him, and appoint his portion with the hypocrites. There shall be weeping and gnashing of teeth."
      ]
    }
  ]
}