{
  "date": "2026-08-17",
  "url": "https://www.catholicgallery.org/mass-reading/170826/",
  "title": "Daily Mass Readings for Monday, 17 August 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ezekiel 24: 15-23",
      "reference": "Ezekiel 24: 15-23",
      "verses": [
        "15 And the word of the Lord came to me, saying:",
        "16 Son of man, behold I take from thee the desire of thy eyes with a stroke: and thou shalt not lament, nor weep: neither shall thy tears run down.",
        "17 Sigh in silence, make no mourning for the dead: let the tire of thy head be upon thee, and thy shoes on thy feet, and cover not thy face, nor eat the meat of mourners.",
        "18 So I spoke to the people in the morning, and my wife died in the evening: and I did in the morning as he had commanded me.",
        "19 And the people said to me: Why dost thou not tell us what these things mean that thou doest?",
        "20 And I said to them: The word of the Lord came to me, saying:",
        "21 Speak to the house of Israel: Thus saith the Lord God: Behold I will profane my sanctuary, the glory of your realm, and the thing that your eyes desire, and for which your soul feareth: your sons, and your daughters, whom you have left, shall fall by the sword.",
        "22 And you shall do as I have done: you shall not cover your faces, nor shall you eat the meat of mourners.",
        "23 You shall have crowns on your heads, and shoes on your feet: you shall not lament nor weep, but you shall pine away for your iniquities, and every one shall sigh with his brother."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Deuteronomy 32: 18-19, 20, 21",
      "reference": "Deuteronomy 32: 18-19, 20, 21",
      "verses": [
        "R. (18a) You have forgotten God who gave you birth.",
        "18 Thou hast forsaken the God that beget thee, and hast forgotten the Lord that created thee.",
        "19 The Lord saw, and was moved to wrath: because his own sons and daughters provoked him.",
        "R. You have forgotten God who gave you birth.",
        "20 And he said: I will hide my face from them, and will consider what their last end shall be: for it is a perverse generation, and unfaithful children.",
        "R. You have forgotten God who gave you birth.",
        "21 They have provoked me with that which was no god, and have angered me with their vanities: and I will provoke them with that which is no people, and will vex them with a foolish nation.",
        "R. You have forgotten God who gave you birth."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 5: 3",
      "reference": "Matthew 5: 3",
      "verses": [
        "R. Alleluia, alleluia.",
        "3 Blessed are the poor in spirit; for theirs is the Kingdom of heaven.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 19: 16-22",
      "reference": "Matthew 19: 16-22",
      "verses": [
        "16 And behold one came and said to him: Good master, what good shall I do that I may have life everlasting?",
        "17 Who said to him: Why asketh thou me concerning good? One is good, God. But if thou wilt enter into life, keep the commandments.",
        "18 He said to him: Which? And Jesus said: Thou shalt do no murder, Thou shalt not commit adultery, Thou shalt not steal, Thou shalt not bear false witness.",
        "19 Honour thy father and thy mother: and, Thou shalt love thy neighbour as thyself.",
        "20 The young man saith to him: All these I have kept from my youth, what is yet wanting to me?",
        "21 Jesus saith to him: If thou wilt be perfect, go sell what thou hast, and give to the poor, and thou shalt have treasure in heaven: and come follow me.",
        "22 And when the young man had heard this word, he went away sad: for he had great possessions."
      ]
    }
  ]
}