{
  "date": "2026-08-24",
  "url": "https://www.catholicgallery.org/mass-reading/240826/",
  "title": "Daily Mass Readings for Monday, 24 August 2026",
  "feast": "Bartholomew, Apostle Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Revelation 21: 9b-14",
      "reference": "Revelation 21: 9b-14",
      "verses": [
        "9b The angel spoke with me, saying: Come, and I will shew thee the bride, the wife of the Lamb.",
        "10 And he took me up in spirit to a great and high mountain: and he shewed me the holy city Jerusalem coming down out of heaven from God,",
        "11 Having the glory of God, and the light thereof was like to a precious stone, as to the jasper stone, even as crystal.",
        "12 And it had a wall great and high, having twelve gates, and in the gates twelve angels, and names written thereon, which are the names of the twelve tribes of the children of Israel.",
        "13 On the east, three gates: and on the north, three gates: and on the south, three gates: and on the west, three gates.",
        "14 And the wall of the city had twelve foundations, and in them, the twelve names of the twelve apostles of the Lamb."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 145: 10-11, 12-13, 17-18",
      "reference": "Psalms 145: 10-11, 12-13, 17-18",
      "verses": [
        "R. (12) Your friends make known, O Lord, the glorious splendor of your Kingdom.",
        "10 Let all thy works, O lord, praise thee: and let thy saints bless thee.",
        "11 They shall speak of the glory of thy kingdom: and shall tell of thy power:",
        "R. Your friends make known, O Lord, the glorious splendor of your Kingdom.",
        "12 To make thy might known to the sons of men: and the glory of the magnificence of thy kingdom.",
        "13 Thy kingdom is a kingdom of all ages: and thy dominion endureth throughout all generations. The Lord is faithful in all his words: and holy in all his works.",
        "R. Your friends make known, O Lord, the glorious splendor of your Kingdom.",
        "17 The Lord is just in all his ways: and holy in all his works.",
        "18 The Lord is nigh unto all them that call upon him: to all that call upon him in truth.",
        "R. Your friends make known, O Lord, the glorious splendor of your Kingdom."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 1: 49b",
      "reference": "John 1: 49b",
      "verses": [
        "R. Alleluia, alleluia.",
        "49b Rabbi, you are the Son of God; you are the King of Israel.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 1: 45-51",
      "reference": "John 1: 45-51",
      "verses": [
        "45 Philip findeth Nathanael, and saith to him: We have found him of whom Moses in the law, and the prophets did write, Jesus the son of Joseph of Nazareth.",
        "46 And Nathanael said to him: Can any thing of good come from Nazareth? Philip saith to him: Come and see.",
        "47 Jesus saw Nathanael coming to him: and he saith of him: Behold an Israelite indeed, in whom there is no guile.",
        "48 Nathanael saith to him: Whence knowest thou me? Jesus answered, and said to him: Before that Philip called thee, when thou wast under the fig tree, I saw thee.",
        "49 Nathanael answered him, and said: Rabbi, thou art the Son of God, thou art the King of Israel.",
        "50 Jesus answered, and said to him: Because I said unto thee, I saw thee under the fig tree, thou believest: greater things than these shalt thou see.",
        "51 And he saith to him: Amen, amen I say to you, you shall see the heaven opened, and the angels of God ascending and descending upon the Son of man."
      ]
    }
  ]
}