{
  "date": "2026-08-07",
  "url": "https://www.catholicgallery.org/mass-reading/070826/",
  "title": "Daily Mass Readings for Friday, 7 August 2026",
  "feast": "Ordinary Weekday/ Sixtus II, Pope, Martyr, and Companions, Martyrs/ Cajetan, Priest",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Nahum 2: 1, 3; 3: 1-3, 6-7",
      "reference": "Nahum 2: 1, 3; 3: 1-3, 6-7",
      "verses": [
        "1 Behold upon the mountains the feet of him that bringeth good tidings, and that preacheth peace: O Juda, keep thy festivals, and pay thy vows: for Belial shall no more pass through thee again, he is utterly cut off.",
        "3 For the Lord hath rendered the pride of Jacob, as the pride of Israel: because the spoilers have laid them waste, and have marred their vine branches.",
        "3:1 Woe to thee, O city of blood, all full of lies and violence: rapine shall not depart from thee.",
        "2 The noise of the whip, and the noise of the rattling of the wheels, and of the neighing horse, and of the running chariot, and of the horsemen coming up,",
        "3 And of the shining sword, and of the glittering spear, and of a multitude slain, and of a grievous destruction: and there is no end of carcasses, and they shall fall down on their dead bodies.",
        "6 And I will cast abominations upon thee, and will disgrace thee, and will make an example of thee.",
        "7 And it shall come to pass that every one that shall see thee, shall flee from thee, and shall say: Ninive is laid waste: who shall bemoan thee? whence shall I seek a comforter for thee?"
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Deuteronomy 32: 35cd-36ab, 39abcd, 41",
      "reference": "Deuteronomy 32: 35cd-36ab, 39abcd, 41",
      "verses": [
        "R. (39c) It is I who deal death and give life.",
        "35cd The day of destruction is at hand, and the time makes haste to come.",
        "36ab The Lord will judge his people, and will have mercy on his servants.",
        "R. It is I who deal death and give life.",
        "39abcd See ye that I alone am, and there is no other God besides me: I will kill and I will make to live: I will strike, and I will heal.",
        "R. It is I who deal death and give life.",
        "41 If I shall whet my sword as the lightning, and my hand take hold on judgment: I will render vengeance to my enemies, and repay them that hate me.",
        "R. It is I who deal death and give life."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 5: 10",
      "reference": "Matthew 5: 10",
      "verses": [
        "R. Alleluia, alleluia.",
        "10 Blessed are they who are persecuted for the sake of righteousness; for theirs is the Kingdom of heaven.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 16: 24-28",
      "reference": "Matthew 16: 24-28",
      "verses": [
        "24 Then Jesus said to his disciples: If any man will come after me, let him deny himself, and take up his cross, and follow me.",
        "25 For he that will save his life, shall lose it: and he that shall lose his life for my sake, shall find it.",
        "26 For what doth it profit a man, if he gain the whole world, and suffer the loss of his own soul? Or what exchange shall a man give for his soul?",
        "27 For the Son of man shall come in the glory of his Father with his angels: and then will he render to every man according to his works.",
        "28 Amen I say to you, there are some of them that stand here, that shall not taste death, till they see the Son of man coming in his kingdom."
      ]
    }
  ]
}