{
  "date": "2026-08-05",
  "url": "https://www.catholicgallery.org/mass-reading/050826/",
  "title": "Daily Mass Readings for Wednesday, 5 August 2026",
  "feast": "Ordinary Weekday/ Dedication of the Basilica of Saint Mary Major in Rome",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Jeremiah 31: 1-7",
      "reference": "Jeremiah 31: 1-7",
      "verses": [
        "1 At that time, saith the Lord, I will be the God of all the families of Israel, and they shall be my people.",
        "2 Thus saith the Lord: The people that were left and escaped from the sword, found grace in the desert: Israel shall go to his rest.",
        "3 The Lord hath appeared from afar to me. Yea I have loved thee with an everlasting love, therefore have I drawn thee, taking pity on thee.",
        "4 And I will build thee again, and thou shalt be built, O virgin of Israel: thou shalt again be adorned with thy timbrels, and shalt go forth in the dances of them that make merry.",
        "5 Thou shalt yet plant vineyards in the mountains of Samaria: the planters shall plant, and they shall not gather the vintage before the time.",
        "6 For there shall be a day, in which the watchmen on mount Ephraim, shall cry: Arise, and let us go up to Sion to the Lord our God.",
        "7 For thus saith the Lord: Rejoice ye in the joy of Jacob, and neigh before the head of the Gentiles: shout ye, and sing, and say: Save, O Lord, thy people, the remnant of Israel."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Jeremiah 31: 10, 11-12ab, 13",
      "reference": "Jeremiah 31: 10, 11-12ab, 13",
      "verses": [
        "R. (10d) The Lord will guard us as a shepherd guards his flock.",
        "10 Hear the word of the Lord, O ye nations, and declare it in the islands that are afar off, and say: He that scattered Israel will gather him: and he will keep him as the shepherd doth his flock.",
        "R. The Lord will guard us as a shepherd guards his flock.",
        "11 For the Lord hath redeemed Jacob, and delivered him out of the hand of one that was mightier than he.",
        "12ab And they shall come, and shall give praise in mount Sion: and they shall flow together to the good things of the Lord.",
        "R. The Lord will guard us as a shepherd guards his flock.",
        "13 Then shall the virgin rejoice in the dance, the young men and old men together: and I will turn their mourning into joy, and will comfort them, and make them joyful after their sorrow.",
        "R. The Lord will guard us as a shepherd guards his flock."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 7: 16",
      "reference": "Luke 7: 16",
      "verses": [
        "R. Alleluia, alleluia.",
        "16A great prophet has arisen in our midst and God has visited his people.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 15: 21-28",
      "reference": "Matthew 15: 21-28",
      "verses": [
        "21 And Jesus went from thence, and retired into the coasts of Tyre and Sidon.",
        "22 And behold a woman of Canaan who came out of those coasts, crying out, said to him: Have mercy on me, O Lord, thou son of David: my daughter is grieviously troubled by the devil.",
        "23 Who answered her not a word. And his disciples came and besought him, saying: Send her away, for she crieth after us:",
        "24 And he answering, said: I was not sent but to the sheep that are lost of the house of Israel.",
        "25 But she came and adored him, saying: Lord, help me.",
        "26 Who answering, said: It is not good to take the bread of the children, and to cast it to the dogs.",
        "27 But she said: Yea, Lord; for the whelps also eat of the crumbs that fall from the table of their masters.",
        "28 Then Jesus answering, said to her: O woman, great is thy faith: be it done to thee as thou wilt: and her daughter was cured from that hour."
      ]
    }
  ]
}