{
  "date": "2026-08-26",
  "url": "https://www.catholicgallery.org/mass-reading/260826/",
  "title": "Daily Mass Readings for Wednesday, 26 August 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second Thessalonians 3: 6-10, 16-18",
      "reference": "Second Thessalonians 3: 6-10, 16-18",
      "verses": [
        "6 And we charge you, brethren, in the name of our Lord Jesus Christ, that you withdraw yourselves from every brother walking disorderly, and not according to the tradition which they have received of us.",
        "7 For yourselves know how you ought to imitate us: for we were not disorderly among you;",
        "8 Neither did we eat any man’s bread for nothing, but in labour and in toil we worked night and day, lest we should be chargeable to any of you.",
        "9 Not as if we had not power: but that we might give ourselves a pattern unto you, to imitate us.",
        "10 For also when we were with you, this we declared to you: that, if any man will not work, neither let him eat.",
        "16 Now the Lord of peace himself give you everlasting peace in every place. The Lord be with you all.",
        "17 The salutation of Paul with my own hand; which is the sign in every epistle. So I write.",
        "18 The grace of our Lord Jesus Christ be with you all. Amen."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 128: 1-2, 4-5",
      "reference": "Psalms 128: 1-2, 4-5",
      "verses": [
        "R. (1) Blessed are those who fear the Lord.",
        "1 Blessed are all they that fear the Lord: that walk in his ways.",
        "2 For thou shalt eat the labours of thy hands: blessed art thou, and it shall be well with thee.",
        "R. Blessed are those who fear the Lord.",
        "4 Behold, thus shall the man be blessed that feareth the Lord.",
        "5 May the Lord bless thee out of Sion: and mayest thou see the good things of Jerusalem all the days of thy life.",
        "R. Blessed are those who fear the Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: First John 2: 5",
      "reference": "First John 2: 5",
      "verses": [
        "R. Alleluia, alleluia.",
        "5 Whoever keeps the word of Christ, the love of God is truly perfected in him.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 23: 27-32",
      "reference": "Matthew 23: 27-32",
      "verses": [
        "27 Woe to you scribes and Pharisees, hypocrites; because you are like to whited sepulchres, which outwardly appear to men beautiful, but within are full of dead men’s bones, and of all filthiness.",
        "28 So you also outwardly indeed appear to men just; but inwardly you are full of hypocrisy and iniquity.",
        "29 Woe to you scribes and Pharisees, hypocrites; that build the sepulchres of the prophets, and adorn the monuments of the just,",
        "30 And say: If we had been in the days of our Fathers, we would not have been partakers with them in the blood of the prophets.",
        "31 Wherefore you are witnesses against yourselves, that you are the sons of them that killed the prophets.",
        "32 Fill ye up then the measure of your fathers."
      ]
    }
  ]
}