{
  "date": "2026-08-16",
  "url": "https://www.catholicgallery.org/mass-reading/160826/",
  "title": "Daily Mass Readings for Sunday, 16 August 2026",
  "feast": "Twentieth Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 56: 1, 6-7",
      "reference": "Isaiah 56: 1, 6-7",
      "verses": [
        "1 Thus saith the Lord: Keep ye judgment, and do justice: for my salvation is near to come, and my justice to be revealed.",
        "6 And the children of the stranger that adhere to the Lord, to worship him, and to love his name, to be his servants: every one that keepeth the sabbath from profaning it, and that holdeth fast my covenant:",
        "7 I will bring them into my holy mount, and will make them joyful in my house of prayer: their holocausts, and their victims shall please me upon my altar: for my house shall be called the house of prayer, for all nations."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 67: 2-3, 5, 6, 8",
      "reference": "Psalms 67: 2-3, 5, 6, 8",
      "verses": [
        "R. (4) O God, let all the nations praise you!",
        "2 May God have mercy on us, and bless us: may he cause the light of his countenance to shine upon us, and may he have mercy on us.",
        "3 That we may know thy way upon earth: thy salvation in all nations.",
        "R. O God, let all the nations praise you!",
        "5 Let the nations be glad and rejoice: for thou judgest the people with justice, and directest the nations upon earth.",
        "R. O God, let all the nations praise you!",
        "6 Let the people, O God, confess to thee: let all the people give praise to thee:",
        "8 May God bless us: and all the ends of the earth fear him.",
        "R. O God, let all the nations praise you!"
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Romans 11: 13-15, 29-32",
      "reference": "Romans 11: 13-15, 29-32",
      "verses": [
        "13 For I say to you, Gentiles: as long indeed as I am the apostle of the Gentiles, I will honour my ministry,",
        "14 If, by any means, I may provoke to emulation them who are my flesh, and may save some of them.",
        "15 For if the loss of them be the reconciliation of the world, what shall the receiving of them be, but life from the dead?",
        "29 For the gifts and the calling of God are without repentance.",
        "30 For as you also in times past did not believe God, but now have obtained mercy, through their unbelief;",
        "31 So these also now have not believed, for your mercy, that they also may obtain mercy.",
        "32 For God hath concluded all in unbelief, that he may have mercy on all."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 4: 23",
      "reference": "Matthew 4: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Jesus proclaimed the Gospel of the kingdom and cured every disease among the people.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 15: 21-28",
      "reference": "Matthew 15: 21-28",
      "verses": [
        "21 And Jesus went from thence, and retired into the coasts of Tyre and Sidon.",
        "22 And behold a woman of Canaan who came out of those coasts, crying out, said to him: Have mercy on me, O Lord, thou son of David: my daughter is grieviously troubled by the devil.",
        "23 Who answered her not a word. And his disciples came and besought him, saying: Send her away, for she crieth after us:",
        "24 And he answering, said: I was not sent but to the sheep that are lost of the house of Israel.",
        "25 But she came and adored him, saying: Lord, help me.",
        "26 Who answering, said: It is not good to take the bread of the children, and to cast it to the dogs.",
        "27 But she said: Yea, Lord; for the whelps also eat of the crumbs that fall from the table of their masters.",
        "28 Then Jesus answering, said to her: O woman, great is thy faith: be it done to thee as thou wilt: and her daughter was cured from that hour."
      ]
    }
  ]
}