{
  "date": "2026-08-22",
  "url": "https://www.catholicgallery.org/mass-reading/220826/",
  "title": "Daily Mass Readings for Saturday, 22 August 2026",
  "feast": "Queenship of the Blessed Virgin Mary Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ezekiel 43: 1-7ab",
      "reference": "Ezekiel 43: 1-7ab",
      "verses": [
        "1 And he brought me to the gate that looked towards the east.",
        "2 And behold the glory of the God of Israel came in by the way of the east: and his voice was like the noise of many waters, and the earth shone with his majesty.",
        "3 And I saw the vision according to the appearance which I had seen when he came to destroy the city: and the appearance was according to the vision which I had seen by the river Chobar: and I fell upon my face.",
        "4 And the majesty of the Lord went into the temple by the way of the gate that looked to the east.",
        "5 And the spirit lifted me up and brought me into the inner court: and behold the house was filled with the glory of the Lord.",
        "6 And I heard one speaking to me out of the house, and the man that stood by me,",
        "7ab Said to me: Son of man, the place of my throne, and the place of the soles of my feet, where I dwell in the midst of the children of Israel for ever."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 85: 9ab and 10, 11-12, 13-14",
      "reference": "Psalms 85: 9ab and 10, 11-12, 13-14",
      "verses": [
        "R. (10b) The glory of the Lord will dwell in our land.",
        "9ab I will hear what the Lord God will speak in me: for he will speak peace unto his people.",
        "10 Surely his salvation is near to them that fear him: that glory may dwell in our land.",
        "R. The glory of the Lord will dwell in our land.",
        "11 Mercy and truth have met each other: justice and peace have kissed.",
        "12 Truth is sprung out of the earth: and justice hath looked down from heaven.",
        "R. The glory of the Lord will dwell in our land.",
        "13 For the Lord will give goodness: and our earth shall yield her fruit.",
        "14 Justice shall walk before him: and shall set his steps in the way.",
        "R. The glory of the Lord will dwell in our land."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 23: 9b, 10b",
      "reference": "Matthew 23: 9b, 10b",
      "verses": [
        "R. Alleluia, alleluia.",
        "9b, 10b You have but one Father in heaven; you have but one master, the Christ.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 23: 1-12",
      "reference": "Matthew 23: 1-12",
      "verses": [
        "1 Then Jesus spoke to the multitudes and to his disciples,",
        "2 Saying: The scribes and the Pharisees have sitten on the chair of Moses.",
        "3 All things therefore whatsoever they shall say to you, observe and do: but according to their works do ye not; for they say, and do not.",
        "4 For they bind heavy and insupportable burdens, and lay them on men’s shoulders; but with a finger of their own they will not move them.",
        "5 And all their works they do for to be seen of men. For they make their phylacteries broad, and enlarge their fringes.",
        "6 And they love the first places at feasts, and the first chairs in the synagogues,",
        "7 And salutations in the market place, and to be called by men, Rabbi.",
        "8 But be not you called Rabbi. For one is your master; and all you are brethren.",
        "9 And call none your father upon earth; for one is your father, who is in heaven.",
        "10 Neither be ye called masters; for one is your master, Christ.",
        "11 He that is the greatest among you shall be your servant.",
        "12 And whosoever shall exalt himself shall be humbled: and he that shall humble himself shall be exalted."
      ]
    }
  ]
}