{
  "date": "2026-08-29",
  "url": "https://www.catholicgallery.org/mass-reading/290826/",
  "title": "Daily Mass Readings for Saturday, 29 August 2026",
  "feast": "Martyrdom of John the Baptist Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Corinthians 1: 26-31",
      "reference": "First Corinthians 1: 26-31",
      "verses": [
        "26 For see your vocation, brethren, that there are not many wise according to the flesh, not many mighty, not many noble:",
        "27 But the foolish things of the world hath God chosen, that he may confound the wise; and the weak things of the world hath God chosen, that he may confound the strong.",
        "28 And the base things of the world, and the things that are contemptible, hath God chosen, and things that are not, that he might bring to nought things that are:",
        "29 That no flesh should glory in his sight.",
        "30 But of him are you in Christ Jesus, who of God is made unto us wisdom, and justice, and sanctification, and redemption:",
        "31 That, as it is written: He that glorieth, may glory in the Lord."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 33: 12-13, 18-19, 20-21",
      "reference": "Psalms 33: 12-13, 18-19, 20-21",
      "verses": [
        "R. (12) Blessed the people the Lord has chosen to be his own.",
        "12 Blessed is the nation whose God is the Lord: the people whom he hath chosen for his inheritance.",
        "13 The Lord hath looked from heaven: he hath beheld all the sons of men.",
        "R. Blessed the people the Lord has chosen to be his own.",
        "18 Behold the eyes of the Lord are on them that fear him: and on them that hope in his mercy.",
        "19 To deliver their souls from death; and feed them in famine.",
        "R. Blessed the people the Lord has chosen to be his own.",
        "20 Our soul waiteth for the Lord: for he is our helper and protector.",
        "21 For in him our heart shall rejoice: and in his holy name we have trusted.",
        "R. Blessed the people the Lord has chosen to be his own."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 5: 10",
      "reference": "Matthew 5: 10",
      "verses": [
        "R. Alleluia, alleluia.",
        "10 Blessed are those who are persecuted for the sake of righteousness, for theirs is the Kingdom of heaven.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 6: 17-29",
      "reference": "Mark 6: 17-29",
      "verses": [
        "17 For Herod himself had sent and apprehended John, and bound him in prison for the sake of Herodias the wife of Philip his brother, because he had married her.",
        "18 For John said to Herod: It is not lawful for thee to have thy brother’s wife.",
        "19 Now Herodias laid snares for him: and was desirous to put him to death, and could not.",
        "20 For Herod feared John, knowing him to be a just and holy man: and kept him, and when he heard him, did many things: and he heard him willingly.",
        "21 And when a convenient day was come, Herod made a supper for his birthday, for the princes, and tribunes, and chief men of Galilee.",
        "22 And when the daughter of the same Herodias had come in, and had danced, and pleased Herod, and them that were at table with him, the king said to the damsel: Ask of me what thou wilt, and I will give it thee.",
        "23 And he swore to her: Whatsoever thou shalt ask I will give thee, though it be the half of my kingdom.",
        "24 Who when she was gone out, said to her mother, What shall I ask? But she said: The head of John the Baptist.",
        "25 And when she was come in immediately with haste to the king, she asked, saying: I will that forthwith thou give me in a dish, the head of John the Baptist.",
        "26 And the king was struck sad. Yet because of his oath, and because of them that were with him at table, he would not displease her:",
        "27 But sending an executioner, he commanded that his head should be brought in a dish.",
        "28 And he beheaded him in the prison, and brought his head in a dish: and gave it to the damsel, and the damsel gave it to her mother.",
        "29 Which his disciples hearing came, and took his body, and laid it in a tomb."
      ]
    }
  ]
}