{
  "date": "2026-08-23",
  "url": "https://www.catholicgallery.org/mass-reading/230826/",
  "title": "Daily Mass Readings for Sunday, 23 August 2026",
  "feast": "Twenty-first Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 22: 19-23",
      "reference": "Isaiah 22: 19-23",
      "verses": [
        "19 And I will drive thee out From thy station, and depose thee from thy ministry.",
        "20 And it shall come to pass in that day, that I will call my servant Eliacim the son of Helcias,",
        "21 And I will clothe him with thy robe, and will strengthen him with thy girdle, and will give thy power into his hand: and he shall be as a father to the inhabitants of Jerusalem, and to the house of Juda.",
        "22 And I will lay the key of the house of David upon his shoulder: and he shall open, and none shall shut: and he shall shut, and none shall open.",
        "23 And I will fasten him as a peg in a sure place, and he shall be for a throne of glory to the house of his father."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 138: 1-2a, 2bc-3, 6, 8",
      "reference": "Psalms 138: 1-2a, 2bc-3, 6, 8",
      "verses": [
        "R. (8bc) Lord, your love is eternal; do not forsake the work of your hands.",
        "1 I will praise thee, O lord, with my whole heart: for thou hast heard the words of my mouth. I will sing praise to thee in the sight of his angels:",
        "2a I will worship towards thy holy temple.",
        "R. Lord, your love is eternal; do not forsake the work of your hands.",
        "2bc I will give glory to thy name. For thy mercy, and for thy truth.",
        "3 In what day soever I shall call upon thee, hear me: thou shall multiply strength in my soul.",
        "R. Lord, your love is eternal; do not forsake the work of your hands.",
        "6 For the Lord is high, and looketh on the low: and the high he knoweth afar off.",
        "8 The Lord will repay for me: thy mercy, O Lord, endureth for ever: O despise not the work of thy hands.",
        "R. Lord, your love is eternal; do not forsake the work of your hands."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Romans 11: 33-36",
      "reference": "Romans 11: 33-36",
      "verses": [
        "33 O the depth of the riches of the wisdom and of the knowledge of God! How incomprehensible are his judgments, and how unsearchable his ways!",
        "34 For who hath known the mind of the Lord? Or who hath been his counsellor?",
        "35 Or who hath first given to him, and recompense shall be made him?",
        "36 For of him, and by him, and in him, are all things: to him be glory for ever. Amen."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 16: 18",
      "reference": "Matthew 16: 18",
      "verses": [
        "R. Alleluia, alleluia.",
        "18 You are Peter and upon this rock I will build my Church and the gates of the netherworld shall not prevail against it.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 16: 13-20",
      "reference": "Matthew 16: 13-20",
      "verses": [
        "13 And Jesus came into the quarters of Caesarea Philippi: and he asked his disciples, saying: Whom do men say that the Son of man is?",
        "14 But they said: Some John the Baptist, and other some Elias, and others Jeremias, or one of the prophets.",
        "15 Jesus saith to them: But whom do you say that I am?",
        "16 Simon Peter answered and said: Thou art Christ, the Son of the living God.",
        "17 And Jesus answering, said to him: Blessed art thou, Simon Bar-Jona: because flesh and blood hath not revealed it to thee, but my Father who is in heaven.",
        "18 And I say to thee: That thou art Peter; and upon this rock I will build my church, and the gates of hell shall not prevail against it.",
        "19 And I will give to thee the keys of the kingdom of heaven. And whatsoever thou shalt bind upon earth, it shall be bound also in heaven: and whatsoever thou shalt loose upon earth, it shall be loosed also in heaven.",
        "20 Then he commanded his disciples, that they should tell no one that he was Jesus the Christ."
      ]
    }
  ]
}