{
  "date": "2026-08-04",
  "url": "https://www.catholicgallery.org/mass-reading/040826/",
  "title": "Daily Mass Readings for Tuesday, 4 August 2026",
  "feast": "John Mary Vianney, Priest Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Jeremiah 30: 1-2, 12-15, 18-22",
      "reference": "Jeremiah 30: 1-2, 12-15, 18-22",
      "verses": [
        "1 This is the word that came to Jeremias from the Lord, saying:",
        "2 Thus saith the Lord, the God of Israel, saying: Write thee all the words that I have spoken to thee, in a book.",
        "12 For thus saith the Lord: Thy bruise is incurable, thy wound is very grievous.",
        "13 There is none to judge thy judgment to bind it up: thou hast no healing medicines.",
        "14 All thy lovers have forgotten thee, and will not seek after thee: for I have wounded thee with the wound of an enemy, with a cruel chastisement: by reason of the multitude of thy iniquities, thy sins are hardened.",
        "15 Why criest thou for thy affliction? thy sorrow is incurable: for the multitude of thy iniquity, and for thy hardened sins I have done these things to thee.",
        "18 Thus saith the Lord: Behold I will bring back the captivity of the pavilions of Jacob, and will have pity on his houses, and the city shall be built in her high place, and the temple shall be founded according to the order thereof.",
        "19 And out of them shall come forth praise, and the voice of them that play: and I will multiply them, and they shall not be made few: and I will glorify them, and they shall not be lessened.",
        "20 And their children shall be as from the beginning, and their assembly shall be permanent before me: and I will visit against all that afflict them.",
        "21 And their leader shall be of themselves: and their prince shall come forth from the midst of them: and I will bring him near, and he shall come to me: for who is this that setteth his heart to approach to me, saith the Lord?",
        "22 And you shall be my people: and I will be your God."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 102: 16-18, 19-21, 29 and 22-23",
      "reference": "Psalms 102: 16-18, 19-21, 29 and 22-23",
      "verses": [
        "R. (17) The Lord will build up Zion again, and appear in all his glory.",
        "16 And the Gentiles shall fear thy name, O Lord, and all the kings of the earth thy glory.",
        "17 For the Lord hath built up Sion: and he shall be seen in his glory.",
        "18 He hath had regard to the prayer of the humble: and he hath not despised their petition.",
        "R. The Lord will build up Zion again, and appear in all his glory.",
        "19 Let these things be written unto another generation: and the people that shall be created shall praise the Lord:",
        "20 Because he hath looked forth from his high sanctuary: from heaven the Lord hath looked upon the earth.",
        "21 That he might hear the groans of them that are in fetters: that he might release the children of the slain:",
        "R. The Lord will build up Zion again, and appear in all his glory.",
        "29 The children of thy servants shall continue: and their seed shall be directed for ever.",
        "22 That they may declare the name of the Lord in Sion: and his praise in Jerusalem;",
        "23 When the people assemble together, and kings, to serve the Lord.",
        "R. The Lord will build up Zion again, and appear in all his glory."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 1: 49b",
      "reference": "John 1: 49b",
      "verses": [
        "R. Alleluia, alleluia.",
        "49b Rabbi, you are the Son of God; you are the King of Israel.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 14: 22-36 or Matthew 15: 1-2, 10-14",
      "reference": "Matthew 14: 22-36 or Matthew 15: 1-2, 10-14",
      "verses": [
        "22 And forthwith Jesus obliged his disciples to go up into the boat, and to go before him over the water, till he dismissed the people.",
        "23 And having dismissed the multitude, he went into a mountain alone to pray. And when it was evening, he was there alone.",
        "24 But the boat in the midst of the sea was tossed with the waves: for the wind was contrary.",
        "25 And in the fourth watch of the night, he came to them walking upon the sea.",
        "26 And they seeing him walk upon the sea, were troubled, saying: It is an apparition. And they cried out for fear.",
        "27 And immediately Jesus spoke to them, saying: Be of good heart: it is I, fear ye not.",
        "28 And Peter making answer, said: Lord, if it be thou, bid me come to thee upon the waters.",
        "29 And he said: Come. And Peter going down out of the boat, walked upon the water to come to Jesus.",
        "30 But seeing the wind strong, he was afraid: and when he began to sink, he cried out, saying: Lord, save me.",
        "31 And immediately Jesus stretching forth his hand took hold of him, and said to him: O thou of little faith, why didst thou doubt?",
        "32 And when they were come up into the boat, the wind ceased.",
        "33 And they that were in the boat came and adored him, saying: Indeed thou art the Son of God.",
        "34 And having passed the water, they came into the country of Genesar.",
        "35 And when the men of that place had knowledge of him, they sent into all that country, and brought to him all that were diseased.",
        "36 And they besought him that they might touch but the hem of his garment. And as many as touched, were made whole.",
        "Or",
        "1 Then came to him from Jerusalem scribes and Pharisees, saying:",
        "2 Why do thy disciples transgress the tradition of the ancients? For they wash not their hands when they eat bread.",
        "10 And having called together the multitudes unto him, he said to them: Hear ye and understand.",
        "11 Not that which goeth into the mouth defileth a man: but what cometh out of the mouth, this defileth a man.",
        "12 Then came his disciples, and said to him: Dost thou know that the Pharisees, when they heard this word, were scandalized?",
        "13 But he answering them, said: Every plant which my heavenly Father hath not planted, shall be rooted up.",
        "14 Let them alone: they are blind, and leaders of the blind. And if the blind lead the blind, both will fall into the pit."
      ]
    }
  ]
}