{
  "date": "2026-08-21",
  "url": "https://www.catholicgallery.org/mass-reading/210826/",
  "title": "Daily Mass Readings for Friday, 21 August 2026",
  "feast": "Pius X, Pope Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ezekiel 37: 1-14",
      "reference": "Ezekiel 37: 1-14",
      "verses": [
        "1 The hand of the Lord was upon me, and brought me forth in the spirit of the Lord: and set me down in the midst of a plain that was full of bones.",
        "2 And he led me about through them on every side: now they were very many upon the face of the plain, and they were exceeding dry.",
        "3 And he said to me: Son of man, dost thou think these bones shall live? And I answered: O Lord God, thou knowest.",
        "4 And he said to me: Prophesy concerning these bones; and say to them: Ye dry bones, hear the word of the Lord.",
        "5 Thus saith the Lord God to these bones: Behold, I will send spirit into you, and you shall live.",
        "6 And I will lay sinews upon you, and will cause flesh to grow over you, and will cover you with skin: and I will give you spirit and you shall live, and you shall know that I am the Lord.",
        "7 And I prophesied as he had commanded me: and as I prophesied there was a noise, and behold a commotion: and the bones came together, each one to its joint.",
        "8 And I saw, and behold the sinews, and the flesh came up upon them: and the skin was stretched out over them, but there was no spirit in them.",
        "9 And he said to me: Prophesy to the spirit, prophesy, O son of man, and say to the spirit: Thus saith the Lord God: Come, spirit, from the four winds, and blow upon these slain, and let them live again.",
        "10 And I prophesied as he had commanded me: and the spirit came into them, and they lived: and they stood up upon their feet, an exceeding great army.",
        "11 And he said to me: Son of man: All these bones are the house of Israel: they say: Our bones are dried up, and our hope is lost, and we are cut off.",
        "12 Therefore prophesy, and say to them: Thus saith the Lord God: Behold I will open your graves, and will bring you out of your sepulchres, O my people: and will bring you into the land of Israel.",
        "13 And you shall know that I am the Lord, when I shall have opened your sepulchres, and shall have brought you out of your graves, O my people:",
        "14 And shall have put my spirit in you, and you shall live, and I shall make you rest upon your own land: and you shall know that I the Lord have spoken, and done it, saith the Lord God:"
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 107: 2-3, 4-5, 6-7, 8-9",
      "reference": "Psalms 107: 2-3, 4-5, 6-7, 8-9",
      "verses": [
        "R. (1) Give thanks to the Lord; his love is everlasting.",
        "2 Let them say so that have been redeemed by the Lord, whom he hath redeemed from the hand of the enemy: and gathered out of the countries.",
        "3 From the rising and the setting of the sun, from the north and from the sea.",
        "R. Give thanks to the Lord; his love is everlasting.",
        "4 They wandered in a wilderness, in a place without water: they found not the way of a city for their habitation.",
        "5 They were hungry and thirsty: their soul fainted in them.",
        "R. Give thanks to the Lord; his love is everlasting.",
        "6 And they cried to the Lord in their tribulation: and he delivered them out of their distresses.",
        "7 And he led them into the right way: that they might go to a city of habitation.",
        "R. Give thanks to the Lord; his love is everlasting.",
        "8 Let the mercies of the Lord give glory to him: and his wonderful works to the children of men.",
        "9 For he hath satisfied the empty soul, and hath filled the hungry soul with good things.",
        "R. Give thanks to the Lord; his love is everlasting."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Psalms 25: 4b, 5a",
      "reference": "Psalms 25: 4b, 5a",
      "verses": [
        "R. Alleluia, alleluia.",
        "4b, 5a Teach me your paths, my God, guide me in your truth.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 22: 34-40",
      "reference": "Matthew 22: 34-40",
      "verses": [
        "34 But the Pharisees hearing that he had silenced the Sadducees, came together:",
        "35 And one of them, a doctor of the law, asking him, tempting him:",
        "36 Master, which is the greatest commandment in the law?",
        "37 Jesus said to him: Thou shalt love the Lord thy God with thy whole heart, and with thy whole soul, and with thy whole mind.",
        "38 This is the greatest and the first commandment.",
        "39 And the second is like to this: Thou shalt love thy neighbour as thyself.",
        "40 On these two commandments dependeth the whole law and the prophets."
      ]
    }
  ]
}