{
  "id": "angels-9",
  "title": "Angels 9",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/angels/angels_lower.png"
    },
    {
      "type": "heading",
      "value": "The Closest to Humanity"
    },
    {
      "type": "text",
      "value": "The Angels, sometimes called the ninth choir or simply \"Angels,\" are the lowest order in the celestial hierarchy, but they are the closest to humanity. These are the angels most frequently sent to interact directly with individual human beings."
    },
    {
      "type": "heading",
      "value": "Guardian Angels"
    },
    {
      "type": "text",
      "value": "The most familiar role of this choir is that of Guardian Angels. Catholic teaching holds that every person has a Guardian Angel assigned to them from the moment of their conception until death. These angels protect us from spiritual and physical dangers, inspire good thoughts, guide us toward heaven, and present our prayers to God."
    },
    {
      "type": "text",
      "value": "Jesus Himself affirmed the existence of Guardian Angels, saying of children: \"See that you do not despise one of these little ones, for I say to you that their angels in heaven always look upon the face of my heavenly Father\" (Matthew 18:10)."
    },
    {
      "type": "heading",
      "value": "Other Missions"
    },
    {
      "type": "text",
      "value": "Beyond serving as guardians, this choir of angels carries out various tasks: delivering messages from God to individuals, protecting the faithful in times of danger, inspiring holy thoughts and desires, assisting at the hour of death, and presenting our prayers and good works to God."
    },
    {
      "type": "heading",
      "value": "Our Relationship with Angels"
    },
    {
      "type": "text",
      "value": "We should cultivate a relationship with our Guardian Angel through prayer and awareness of their presence. The traditional Guardian Angel prayer reflects this devotion: \"Angel of God, my guardian dear, to whom God's love commits me here, ever this day be at my side, to light and guard, to rule and guide. Amen.\""
    },
    {
      "type": "text",
      "value": "The ninth choir of Angels teaches us humility and faithfulness in small things. Though lowest in the angelic hierarchy, they faithfully serve God by serving us. They remind us that no act of loving service is too small if it is done for God."
    },
    {
      "type": "text",
      "value": "Feastday October 2nd (Feast of the Guardian Angels)."
    }
  ]
}