{
  "id": "guardian-angels",
  "title": "Guardian Angels",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/angels/guardian_angels.png"
    },
    {
      "type": "heading",
      "value": "God's Gift of Protection"
    },
    {
      "type": "text",
      "value": "Guardian Angels are angels from the ninth choir assigned by God to watch over, protect, and guide individual human beings throughout their earthly life. The existence and role of Guardian Angels is a defined teaching of the Catholic Church, rooted in Sacred Scripture and Sacred Tradition."
    },
    {
      "type": "heading",
      "value": "Biblical Foundation"
    },
    {
      "type": "text",
      "value": "Scripture provides clear evidence of Guardian Angels:\n- In Matthew 18:10, Jesus says: \"See that you do not despise one of these little ones, for I say to you that their angels in heaven always look upon the face of my heavenly Father.\"\n- Psalm 91:11-12 states: \"For he commands his angels with regard to you, to guard you wherever you go. With their hands they shall support you, lest you strike your foot against a stone.\"\n- In Acts 12:15, when Peter was miraculously freed from prison, the disciples said, \"It is his angel,\" showing belief in personal guardian angels."
    },
    {
      "type": "heading",
      "value": "The Mission of Guardian Angels"
    },
    {
      "type": "text",
      "value": "Our Guardian Angels have several important roles:\n1. Protection: They protect us from physical dangers and spiritual harm, particularly from demonic attacks and temptations.\n2. Guidance: They inspire good thoughts, holy desires, and wise decisions.\n3. Intercession: They present our prayers, good works, and needs to God.\n4. Assistance: They help us in our spiritual battles and in our journey toward heaven.\n5. Comfort: They console us in times of suffering and accompany us at the hour of death."
    },
    {
      "type": "text",
      "value": "St. Thomas Aquinas taught that Guardian Angels are assigned to us at the moment of our conception and remain with us until we enter eternity. They cannot force us to do good, as they must respect our free will, but they constantly work to inspire and guide us toward holiness."
    },
    {
      "type": "heading",
      "value": "How to Honor Your Guardian Angel"
    },
    {
      "type": "text",
      "value": "1. Prayer: Develop a daily habit of praying to your Guardian Angel. The traditional prayer is: \"Angel of God, my guardian dear, to whom God's love commits me here, ever this day be at my side, to light and guard, to rule and guide. Amen.\"\n2. Awareness: Cultivate awareness of your angel's presence throughout the day.\n3. Gratitude: Thank your Guardian Angel for their constant protection and guidance.\n4. Obedience: Listen to the inspirations and warnings your angel gives you.\n5. Cooperation: Work with your Guardian Angel by avoiding sin and pursuing holiness."
    },
    {
      "type": "heading",
      "value": "Saints and Guardian Angels"
    },
    {
      "type": "text",
      "value": "Many saints had profound relationships with their Guardian Angels:\n- St. Padre Pio frequently communicated with his Guardian Angel and advised others to send their Guardian Angel to him with prayer requests.\n- St. Gemma Galgani had visible interactions with her Guardian Angel, who would help her pray and correct her faults.\n- St. Thomas Aquinas wrote extensively about angelic nature and their role as guardians.\n- St. Frances of Rome could see her Guardian Angel and described him as a radiant figure."
    },
    {
      "type": "heading",
      "value": "The Power of Guardian Angels"
    },
    {
      "type": "text",
      "value": "While we may not always perceive their presence, our Guardian Angels are constantly active in our lives. They have incredible power—a single angel destroyed 185,000 Assyrian soldiers in one night (2 Kings 19:35). Yet they use their power gently and respectfully, never overriding our free will."
    },
    {
      "type": "text",
      "value": "Our Guardian Angels know us intimately—our struggles, temptations, and spiritual needs. They rejoice when we do good and grieve when we sin. They are our faithful companions who will never abandon us."
    },
    {
      "type": "heading",
      "value": "A Relationship for Eternity"
    },
    {
      "type": "text",
      "value": "Our relationship with our Guardian Angel doesn't end at death. When we die, our Guardian Angel accompanies our soul to particular judgment and, if we are saved, escorts us to heaven. There, we will finally see our Guardian Angel face to face and thank them for their faithful service throughout our earthly life."
    },
    {
      "type": "text",
      "value": "Feastday October 2nd (Feast of the Guardian Angels)."
    }
  ]
}