{
  "id": "judas-iscariot",
  "title": "Judas Iscariot",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/apostles/judas.jpeg"
    },
    {
      "type": "heading",
      "value": "The Betrayer"
    },
    {
      "type": "text",
      "value": "Judas Iscariot was one of the twelve apostles of Jesus Christ. Judas was in charge of the apostles' funds. His surname \"Iscariot\" may indicate that he was from a town called Kerioth."
    },
    {
      "type": "heading",
      "value": "The Betrayal"
    },
    {
      "type": "text",
      "value": "Judas is especially noted for the fact that he betrayed Jesus Christ to the Jewish authorities. According to the Gospel accounts, after the Last Supper, Judas Iscariot led soldiers to the Garden of Gethsemane, where he kissed Jesus on the cheek, identifying him to the soldiers who then arrested Jesus."
    },
    {
      "type": "heading",
      "value": "The Price"
    },
    {
      "type": "text",
      "value": "According to the Gospel of Matthew, Judas betrayed Jesus for thirty pieces of silver. When Judas came to realize what he had done, he returned the silver to the chief priests. Matthew states that, overcome with guilt, Judas hanged himself. However, the Book of Acts tells a slightly different story. It states that Judas fell headlong and his body burst open and his intestines spilled out. The Field in which this is said to have occurred is called Hakeldama, \"The Field of Blood.\""
    },
    {
      "type": "heading",
      "value": "The Mystery"
    },
    {
      "type": "text",
      "value": "As for why Judas betrayed Jesus, the Gospel of John says that he was possessed by the devil. The Gospel of Luke says that Satan entered him. For centuries, biblical scholars and readers of the scriptures have pondered Judas' motives; most of these speculations focus on greed or disappointment in Jesus's ministry. In the end, the mystery of Judas's betrayal remains."
    }
  ]
}