{
  "id": "st-carlo-acutis",
  "title": "St. Carlo Acutis",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/child_saints/carlo_acutis.jpg"
    },
    {
      "type": "heading",
      "value": "The Cyber Apostle of the Eucharist"
    },
    {
      "type": "text",
      "value": "Carlo Acutis was born in London on May 3, 1991, to Italian parents, and grew up in Milan, Italy. From a young age, Carlo demonstrated extraordinary love for the Eucharist and the Blessed Mother. Although his parents were not particularly religious, Carlo developed an intense faith on his own, attending daily Mass and praying the Rosary regularly from the age of seven."
    },
    {
      "type": "heading",
      "value": "Using Technology for God"
    },
    {
      "type": "text",
      "value": "Carlo had a natural talent for computer programming and used his skills to serve God. At the age of 11, he began creating a website cataloging Eucharistic miracles from around the world. His website documented these miracles with detailed information, photographs, and historical research. This project, which he completed before his death, has since become an international exhibition that travels the world, inspiring countless people to deepen their faith in the Real Presence of Jesus in the Eucharist."
    },
    {
      "type": "heading",
      "value": "Life of Virtue"
    },
    {
      "type": "text",
      "value": "Despite living in the modern world with all its distractions, Carlo lived a life of profound holiness. He was known for his kindness to the poor and marginalized, his defense of children with disabilities who were bullied, and his deep love for Jesus in the Eucharist. He called the Eucharist \"my highway to heaven\" and considered it the greatest source of strength in his life. Carlo had a special devotion to Our Lady and prayed the Rosary daily."
    },
    {
      "type": "heading",
      "value": "Death and Beatification"
    },
    {
      "type": "text",
      "value": "In 2006, at the age of 15, Carlo was diagnosed with acute leukemia. He offered his sufferings for the Pope and the Church, saying, \"I offer all the suffering I will have to suffer for the Lord, for the Pope, and the Church.\" Carlo died on October 12, 2006. His cause for canonization was opened in 2013, and he was beatified on October 10, 2020, by Cardinal Agostino Vallini in Assisi, Italy. His body, which is displayed in Assisi, shows minimal signs of decay."
    },
    {
      "type": "heading",
      "value": "Legacy and Message"
    },
    {
      "type": "text",
      "value": "Blessed Carlo is often called the \"Patron Saint of the Internet\" and the \"Cyber Apostle of the Eucharist.\" His life shows that holiness is possible in the modern age and that technology can be used as a tool for evangelization. He is especially popular among young people. One of his most famous quotes is: \"To always be close to Jesus, that's my life plan.\""
    },
    {
      "type": "text",
      "value": "Feastday October 12th."
    }
  ]
}