{
  "id": "st-clare",
  "title": "St. Clare",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/saints/clare.jpg"
    },
    {
      "type": "heading",
      "value": "The Follower of St. Francis"
    },
    {
      "type": "text",
      "value": "St. Clare of Assisi was born in 1194 to a wealthy noble family in Assisi, Italy. At the age of 18, inspired by the preaching of St. Francis of Assisi, Clare left her family and consecrated her life to God. She cut off her hair and received a rough habit from Francis, beginning a life of radical poverty and prayer."
    },
    {
      "type": "heading",
      "value": "Foundress of the Poor Clares"
    },
    {
      "type": "text",
      "value": "Clare founded the Order of Poor Ladies (now known as the Poor Clares), the second order of the Franciscan movement. She and her sisters lived in complete poverty, owning no possessions and depending entirely on God's providence. They devoted themselves to prayer, particularly praying for the missions and the needs of the Church. Clare served as abbess of her community for over 40 years."
    },
    {
      "type": "heading",
      "value": "Defender of the Faith"
    },
    {
      "type": "text",
      "value": "On two occasions, Clare miraculously defended her convent from attack. When soldiers approached to ransack the convent, Clare, though ill, went to meet them holding the Blessed Sacrament. The soldiers fled in fear. Her deep faith in the Eucharist and her courage saved her community."
    },
    {
      "type": "heading",
      "value": "Death and Legacy"
    },
    {
      "type": "text",
      "value": "Clare died on August 11, 1253. She was canonized by Pope Alexander IV in 1255, just two years after her death. St. Clare is the patron saint of television (because she reportedly saw and heard Mass from her sickbed) and eye disease. Her unwavering commitment to poverty and prayer continues to inspire countless religious sisters worldwide."
    },
    {
      "type": "text",
      "value": "Feastday August 11th."
    }
  ]
}