{
  "id": "st-francis-xavier",
  "title": "St. Francis Xavier",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/saints/xavier.jpg"
    },
    {
      "type": "heading",
      "value": "Early Life"
    },
    {
      "type": "text",
      "value": "Francis Xavier was born in 1506 in the Kingdom of Navarre (located in present-day Spain). He came from a noble family and was educated at the University of Paris. While there he met St. Ignatius Loyola and St. Peter Faber. The three became close friends. Together with Ignatius and four other students, Francis Xavier took a vow of poverty, chastity, and dedication to go as missionaries wherever the Pope would send them. Together they became the first members of the Society of Jesus (the Jesuits)."
    },
    {
      "type": "heading",
      "value": "The Greatest Missionary Since St. Paul"
    },
    {
      "type": "text",
      "value": "In 1541, King John III of Portugal asked Francis Xavier to go to the Portuguese colonies in India as a missionary. Francis spent most of the rest of his life traveling around Asia, preaching the Gospel, baptizing, and establishing churches and missions. Starting in Goa, India, he journeyed to the Pearl Fishery Coast, Malacca, the Moluccas Islands, and eventually to Japan, where he worked for over two years."
    },
    {
      "type": "text",
      "value": "During these years, Francis showed incredible zeal for souls and outstanding dedication to the work of evangelization. He learned local languages, adapted to local customs, and spent countless hours teaching the faith to those who had never heard the Gospel. Francis is believed to have baptized over 30,000 people during his missionary work."
    },
    {
      "type": "heading",
      "value": "Death"
    },
    {
      "type": "text",
      "value": "In 1552, Francis set off for China, hoping to bring the Gospel to that great nation. However, he fell ill and died on the island of Sancian (off the coast of China) on December 3, 1552, at the age of 46, before he could reach the Chinese mainland."
    },
    {
      "type": "text",
      "value": "His body was taken back to Goa, India, where it remains to this day in the Basilica of Bom Jesus. The body was found to be incorrupt. Francis Xavier was canonized by Pope Gregory XV in 1622, and he is considered one of the greatest missionaries in the history of the Catholic Church. He is the patron saint of missionaries and of the Propagation of the Faith."
    },
    {
      "type": "text",
      "value": "Feastday December 3rd."
    }
  ]
}