{
  "id": "st-james-major",
  "title": "St. James Major",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/apostles/james_major.jpeg"
    },
    {
      "type": "heading",
      "value": "Son of Thunder"
    },
    {
      "type": "text",
      "value": "James Major is the son of Zebedee and Salome and brother of John the disciple. The title \"the Greater\" was added to St. James' name to help distinguish him from the Apostle James \"the Less,\" who is believed to have been shorter than James \"the Greater.\" Saint James the Greater was one of Jesus' first disciples."
    },
    {
      "type": "heading",
      "value": "The Call"
    },
    {
      "type": "text",
      "value": "James was fishing with his father and John the Apostle when Jesus came to the shores of the Sea of Galilee and called for the fisherman, who were unable to catch any fish that day, to dip their nets in the water once again. When the fishermen followed Jesus' instructions, they found their nets full, and after emptying the fish on board, the boats nearly sank from their weight."
    },
    {
      "type": "heading",
      "value": "Ministry"
    },
    {
      "type": "text",
      "value": "Later, James was one of only three called by Jesus to witness his Transfiguration, and when he and his brother wanted to call fire upon a Samaritan town, both were rebuked by Jesus. Following Christ's Ascension, James spread the Gospel across Israel and the Roman kingdom as well. He traveled and spread the Word for nearly forty years in Spain. It is said that one day, as he prayed, The Blessed Virgin Mary appeared to him and asked him to build her a church, which he did."
    },
    {
      "type": "heading",
      "value": "Martyrdom"
    },
    {
      "type": "text",
      "value": "Later, James returned to Jerusalem but was martyred for his faith by King Herod, who decapitated him. Saint James the Greater is known as the first apostle to die. As he was not allowed to be buried following his martyrdom, his remains were taken to Compostela, Spain, by some of his followers, who buried him. In the ninth century his remains were discovered and moved to a tomb in Santiago de Compostela. Today, his remains can still be found in the Cathedral of Santiago. As Santiago de Compostela is the most frequently visited place pilgrims migrate to following Rome and Jerusalem, Pope Leo declared it a shrine.\n\nFeastday July 25th."
    }
  ]
}