{
  "id": "st-john",
  "title": "St. John",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/apostles/john.jpeg"
    },
    {
      "type": "heading",
      "value": "The Beloved Disciple"
    },
    {
      "type": "text",
      "value": "John was the youngest Apostle and brother of James the Greater. He is the same John who wrote the fourth Gospel and the one who writes in the book of Revelation. He was also the last Apostle to die. John was a son of Zebedee and Salome. However, according to Church tradition, his mother Salome was the Virgin Mary's sister, making John and his brother first cousins of Jesus, though the Bible makes no mention of this."
    },
    {
      "type": "heading",
      "value": "Early Life"
    },
    {
      "type": "text",
      "value": "As a Galilean fisherman, he was a disciple of John the Baptist before Jesus called him. Later, Jesus appointed John the Baptist as one of the Twelve Apostles and became part of his inner circle. He was present for the raising of Jairus' daughter, the Transfiguration, and witnessed Jesus' agony in the garden of Gethsemane.\n\nThe Gospels refer to John, James, and Peter as \"the pillars of the Church.\" The gospels do not tell us the exact moment that Jesus called John and his brother James to be disciples, but it is very likely they knew Jesus and his ministry prior to being called; they most likely saw him baptized by John the Baptist and witnessed many of his preachings and healings. (cf. John 1:35-40.)"
    },
    {
      "type": "heading",
      "value": "Ministry and Care for Mary"
    },
    {
      "type": "text",
      "value": "During the Last Supper, John sat next to Jesus and leaned against him. He was standing by Jesus' mother at the foot of the cross when he died and there, the Lord gave her into his care (John 19:25-27). It is the oldest tradition of the church that after the Lord's Ascension, John lived at Ephesus with Mary, the Mother of the Lord until her dormition or assumption, which is a term used to describe her death."
    },
    {
      "type": "heading",
      "value": "Final Years"
    },
    {
      "type": "text",
      "value": "Under Domitian, John was forced into exile on the island of Patmos. Upon his return to Ephesus, tradition holds he remained there until his death, when he was nearly 100 years old and the last living apostle. He likely wrote his gospel and epistles in Ephesus, as well as the Apocalypse on Patmos.\n\nFeastday December 27th."
    }
  ]
}