{
  "id": "st-matthew",
  "title": "St. Matthew",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/apostles/matthew.jpeg"
    },
    {
      "type": "heading",
      "value": "The Tax Collector"
    },
    {
      "type": "text",
      "value": "Matthew, who was also called Levi, worked as a tax collector in Capernaum. He was later called by Jesus to be one of the Twelve Apostles. In Chapter 9 of the Gospel that carries his name, Jesus walked by the tax office of Matthew and saw him sitting there. Jesus called out to him, \"Follow me\". And Matthew did. He then gave Jesus a feast in his home. The scribes and the Pharisees were very upset with Jesus because he sat and ate with \"tax collectors and sinners\"."
    },
    {
      "type": "heading",
      "value": "The Gospel Writer"
    },
    {
      "type": "text",
      "value": "Matthew, of course, wrote the first Gospel. The Gospel of Matthew is the first of the four Gospels in the New Testament. The early Church fathers all agreed that the Gospel was written by Matthew the Apostle, who worked as a tax collector."
    },
    {
      "type": "text",
      "value": "The Gospel of Matthew is the first Gospel in the New Testament and the first Gospel account written. The Gospel was written for Jewish Christians who had to deal with a hostile Jewish community. The Gospel of Matthew emphasizes Jesus as the fulfillment of the Old Testament. Matthew is the only evangelist who uses the expression \"Church\". His Gospel contains much of Jesus' instruction to the apostles on how the Church on earth will function. His Gospel makes quite clear that Jesus is the new Moses; Jesus is the giver of the New Law of Love."
    },
    {
      "type": "heading",
      "value": "Ministry and Martyrdom"
    },
    {
      "type": "text",
      "value": "Like the other Apostles, Matthew spread the word of the Gospel throughout the then-known world. He preached throughout Judea for many years. Tradition states that Matthew died the death of a martyr in Ethiopia."
    },
    {
      "type": "text",
      "value": "Feastday September 21st."
    }
  ]
}