{
  "id": "st-philip",
  "title": "St. Philip",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/apostles/philip.jpeg"
    },
    {
      "type": "heading",
      "value": "The Call"
    },
    {
      "type": "text",
      "value": "Philip was from Bethsaida, the home of Andrew and Peter. Jesus called Philip directly and said to him \"Follow me\". One of the first acts Philip did was find Nathanael (Bartholomew) and tell him \"We have found the one Moses wrote about in the Law, and about whom the prophets also wrote—Jesus of Nazareth, the son of Joseph.\""
    },
    {
      "type": "heading",
      "value": "Test of Faith"
    },
    {
      "type": "text",
      "value": "At one point, when Jesus looked at a vast crowd he asked Philip \"Where shall we buy bread for these people to eat?\" In his response to Christ, Philip showed how very human the Apostles were. Philip answered, \"It would take more than half a year's wages to buy enough bread for each one to have a bite!\" It is obvious Philip had been thinking only materially. He saw no further than the human means at his disposal. After the multiplication of the bread and fish which were used to feed 5,000 people, Philip realized the divinity of Jesus and was inspired to follow him. According to tradition, many years later, Philip returned to this area to preach the gospel and eventually died as a martyr in Hierapolis, Turkey."
    },
    {
      "type": "heading",
      "value": "The Last Supper"
    },
    {
      "type": "text",
      "value": "At the Last Supper, Jesus told the apostles that he was going to prepare a place for them, and that when he left, they would know the way they were to follow. Thomas replied to Jesus that they did not know the way. Jesus answered, \"I am the way, the truth and the life.\""
    },
    {
      "type": "text",
      "value": "Philip said, \"Lord, show us the Father and that will be enough for us.\""
    },
    {
      "type": "text",
      "value": "Jesus answered: \"Don't you know me, Philip, even after I have been among you such a long time? Anyone who has seen me has seen the Father. How can you say, 'Show us the Father'? Don't you believe that I am in the Father, and that the Father is in me? The words I say to you I do not speak on my own authority. Rather, it is the Father, living in me, who is doing his work. Believe me when I say that I am in the Father and the Father is in me; or at least believe on the evidence of the works themselves.\" (John 14:1-11)"
    },
    {
      "type": "heading",
      "value": "Final Years"
    },
    {
      "type": "text",
      "value": "Saint Philip was one of the first followers of Christ and remained so until His passion. He preached the gospel in Greece until he died, likely as a martyr."
    },
    {
      "type": "text",
      "value": "Feastday May 3rd."
    }
  ]
}