{
  "id": "st-padre-pio",
  "title": "St. Padre Pio",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/saints/padre_pio.jpg"
    },
    {
      "type": "heading",
      "value": "Early Life and Priesthood"
    },
    {
      "type": "text",
      "value": "St. Padre Pio (Francesco Forgione) was born in 1887 in Pietrelcina, Italy. From a young age, he felt called to the priesthood and joined the Capuchin Franciscan Order in 1903, taking the name Pio. He was ordained a priest in 1910."
    },
    {
      "type": "heading",
      "value": "The Stigmata"
    },
    {
      "type": "text",
      "value": "In 1918, while praying before a crucifix, Padre Pio received the stigmata—the wounds of Christ—on his hands, feet, and side. These wounds bled continuously for 50 years until his death and caused him great pain, yet he bore them with humility and patience. He is one of the few priests in history to bear the stigmata."
    },
    {
      "type": "heading",
      "value": "Ministry and Spiritual Gifts"
    },
    {
      "type": "text",
      "value": "Padre Pio spent most of his priestly life at the monastery of San Giovanni Rotondo in Italy. He was known for his extraordinary spiritual gifts, including the ability to read hearts in confession, bilocation (being in two places at once), healing, prophecy, and the ability to smell the \"odor of sanctity\" or sin. People traveled from all over the world to attend his Masses, which often lasted several hours, and to go to confession to him."
    },
    {
      "type": "text",
      "value": "Padre Pio emphasized the importance of prayer, especially the Rosary, and the power of suffering united to Christ. He founded prayer groups and established the Casa Sollievo della Sofferenza (Home for the Relief of Suffering), a hospital that continues to serve the sick today."
    },
    {
      "type": "heading",
      "value": "Death and Canonization"
    },
    {
      "type": "text",
      "value": "Padre Pio died on September 23, 1968, at the age of 81. He was canonized by Pope John Paul II on June 16, 2002. He is the patron saint of civil defense volunteers, adolescents, and stress relief."
    },
    {
      "type": "text",
      "value": "Feastday September 23rd."
    }
  ]
}