{
  "id": "st-paul",
  "title": "St. Paul",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/saints/paul_.jpg"
    },
    {
      "type": "heading",
      "value": "The Persecutor"
    },
    {
      "type": "text",
      "value": "Paul, who was originally known as Saul of Tarsus, was a fierce persecutor of Christians. As a Roman citizen who held a high position in the Jewish community, Saul was a passionate follower of Jewish law. He believed that Christians were blasphemers and was present at the stoning of St. Stephen. After the stoning, Saul went from house to house to capture Christians and have them imprisoned. While on the road to Damascus to persecute Christians there, Saul encountered Christ."
    },
    {
      "type": "heading",
      "value": "Conversion"
    },
    {
      "type": "text",
      "value": "As Saul was nearing Damascus on his journey, a bright light from heaven suddenly blazed around him. He fell to the ground and heard a voice saying, \"Saul, Saul! Why do you persecute me?\" Saul replied, \"Who are you, Lord?\" The voice answered, \"I am Jesus whom you are persecuting.\" Saul asked \"What do you want me to do?\" Jesus told him to go into the city where he would be told what to do. Saul got up from the ground but discovered he was blind. The men traveling with Saul led him by the hand to Damascus, where Saul remained blind for three days and did not eat or drink."
    },
    {
      "type": "text",
      "value": "There was a disciple in Damascus named Ananias and the Lord spoke to him. He told Ananias to go to Saul. Ananias protested \"Lord, I have heard many reports about this man and all the harm he has done to your holy people in Jerusalem.\" But the Lord replied that Saul was his chosen instrument and would carry the Lord's name before the Gentiles and their kings and before the people of Israel. The Lord said that Saul would suffer for his Name's sake."
    },
    {
      "type": "text",
      "value": "Ananias obeyed and placed his hands on Saul telling him that he was sent by the Lord so that Saul might see and be filled with the Holy Spirit. Immediately something fell from Saul's eyes and he could see again. Saul was baptized. He spent the rest of his life preaching and teaching the Christian faith."
    },
    {
      "type": "heading",
      "value": "The Apostle to the Gentiles"
    },
    {
      "type": "text",
      "value": "Paul, as he was now called, wrote many of the New Testament books that are called Epistles. Most notably he wrote letters to the Romans, Corinthians, Galatians, Ephesians, Philippians, Colossians, Thessalonians, as well as letters to Timothy, Titus and Philemon. Paul's letters are considered some of the most profound and influential writings in all of Christian literature. St. Paul was a brilliant scholar and a great preacher. He made three missionary journeys throughout much of the Roman Empire, covering over ten thousand miles. St. Paul wrote much of the Scriptures. He was an incredible man! And what is truly incredible is that he did this all in roughly twenty-five years!"
    },
    {
      "type": "heading",
      "value": "Martyrdom"
    },
    {
      "type": "text",
      "value": "In Rome, Paul was arrested and held under house arrest. Tradition states that Paul was eventually beheaded by Nero in Rome and buried outside the walls of Rome along the Ostian Way. Today, a beautiful Church stands over his tomb. It is called Saint Paul Outside the Walls."
    },
    {
      "type": "text",
      "value": "Feastday June 29th."
    }
  ]
}