{
  "id": "st-thaddeus",
  "title": "St. Thaddeus",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/apostles/thaddeus.jpeg"
    },
    {
      "type": "heading",
      "value": "The Apostle"
    },
    {
      "type": "text",
      "value": "St. Jude Thaddeus, also known simply as St. Jude or St. Thaddeus, was one of the Twelve Apostles of Jesus Christ. He is believed to have been born in Galilee and was possibly a cousin of Jesus."
    },
    {
      "type": "heading",
      "value": "His Ministry"
    },
    {
      "type": "text",
      "value": "Jude Thaddeus served Jesus during His public ministry and remained loyal to Him even during the difficult time of the Passion. After the Ascension and Pentecost, he is believed to have preached the Gospel in Judea, Samaria, Idumaea, Syria, Mesopotamia, and Libya. According to tradition, he was martyred alongside Simon the Zealot in Persia (modern-day Iran), where they were killed by pagan priests."
    },
    {
      "type": "heading",
      "value": "The Author"
    },
    {
      "type": "text",
      "value": "St. Jude is the author of the Epistle of Jude in the New Testament. In this brief letter, he warns Christians against false teachers and urges them to remain faithful to the teachings of Jesus and the Apostles. He emphasizes the importance of building oneself up in faith, praying in the Holy Spirit, and staying in the love of God."
    },
    {
      "type": "heading",
      "value": "At the Last Supper"
    },
    {
      "type": "text",
      "value": "At the Last Supper, St. Jude famously asked Jesus, \"Lord, how is it that you will manifest yourself to us, and not to the world?\" (John 14:22). Jesus responded by speaking about the relationship between love, obedience, and divine indwelling—explaining that those who love Him and keep His word will be loved by the Father, and both He and the Father will come and make their home with them."
    },
    {
      "type": "heading",
      "value": "Patron Saint"
    },
    {
      "type": "text",
      "value": "St. Jude is widely known as the patron saint of lost causes and desperate situations. Many believers pray to him in times of great need, trusting in his powerful intercession. Despite sometimes being confused with Judas Iscariot (the betrayer), St. Jude Thaddeus is honored as a faithful and courageous apostle."
    },
    {
      "type": "text",
      "value": "Feastday October 28th."
    }
  ]
}