{
  "id": "st-thomas",
  "title": "St. Thomas",
  "blocks": [
    {
      "type": "image",
      "value": "https://pub-d710eb3cff894ba7871b5e3d68581196.r2.dev/assets/images/apostles/thomas.jpeg"
    },
    {
      "type": "heading",
      "value": "The Apostle of Doubt"
    },
    {
      "type": "text",
      "value": "Thomas is perhaps best known for his lack of faith, as told in the book of John. After Jesus was crucified and rose from the grave, all the apostles but Thomas saw the risen Lord. Upon hearing this Thomas replied that he would not believe it unless he saw the wounds of crucifixion. Eight days later, Jesus showed Himself to the apostles, including Thomas. When Jesus showed Thomas his wounds and invited him to touch them, Thomas said \"My Lord and my God!\" Upon hearing this Jesus said, \"Because you have seen me, you have believed; blessed are those who have not seen and yet have believed.\""
    },
    {
      "type": "heading",
      "value": "Mission to India"
    },
    {
      "type": "text",
      "value": "According to tradition St. Thomas traveled outside of the Roman Empire to preach the Gospel, traveling as far as India. He is believed to have founded the Christian churches in India. In 1517, the Portuguese reached Mylapore, in India, and found a large community of Christians. These Christians were called the Christians of St. Thomas. They claimed their origins to the Apostle Thomas."
    },
    {
      "type": "heading",
      "value": "Courage and Faith"
    },
    {
      "type": "text",
      "value": "Thomas is also known for the courage he showed at the end of Jesus' ministry when he joined Jesus in traveling to Bethany, knowing that such a journey might put Jesus' life in danger. Upon being told that Lazarus was dead, Thomas told the other Apostles: \"Let us also go, that we might die with him.\""
    },
    {
      "type": "heading",
      "value": "Martyrdom"
    },
    {
      "type": "text",
      "value": "According to the tradition of the Syrian Christians, in 72 AD, St Thomas the Apostle established seven churches in Kerala, India: Kodungallur, Niranam, Nilakkal (Chayal), Kollam, Kokkamangalam, Kottakkayal (Paravoor), Palayoor (Chattukulangara) and Thiruvithamcode (Arappally). Some believe that in 72 AD St. Thomas was martyred on St. Thomas Mount, in Chennai, India, and was interred in Mylapore, India. Other details state that Thomas was martyred at Ortona (Italy), as well."
    },
    {
      "type": "text",
      "value": "Feastday July 3rd."
    }
  ]
}