{
  "date": "2026-11-10",
  "url": "https://www.catholicgallery.org/mass-reading/101126/",
  "title": "Daily Mass Readings for Tuesday, 10 November 2026",
  "feast": "Leo the Great, Pope, Doctor Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Titus 2: 1-8, 11-14",
      "reference": "Titus 2: 1-8, 11-14",
      "verses": [
        "1 But speak thou the things that become sound doctrine:",
        "2 That the aged men be sober, chaste, prudent, sound in faith, in love, in patience.",
        "3 The aged women, in like manner, in holy attire, not false accusers, not given to much wine, teaching well:",
        "4 That they may teach the young women to be wise, to love their husbands, to love their children,",
        "5 To be discreet, chaste, sober, having a care of the house, gentle, obedient to their husbands, that the word of God be not blasphemed.",
        "6 Young men, in like manner, exhort that they be sober.",
        "7 In all things shew thyself an example of good works, in doctrine, in integrity, in gravity,",
        "8 The sound word that can not be blamed: that he, who is on the contrary part, may be afraid, having no evil to say of us.",
        "11 For the grace of God our Saviour hath appeared to all men;",
        "12 Instructing us, that, denying ungodliness and worldly desires, we should live soberly, and justly, and godly in this world,",
        "13 Looking for the blessed hope and coming of the glory of the great God and our Saviour Jesus Christ,",
        "14 Who gave himself for us, that he might redeem us from all iniquity, and might cleanse to himself a people acceptable, a pursuer of good works."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 37: 3-4, 18 and 23, 27 and 29",
      "reference": "Psalms 37: 3-4, 18 and 23, 27 and 29",
      "verses": [
        "R. (39a) The salvation of the just comes from the Lord.",
        "3 Trust in the Lord, and do good, and dwell in the land, and thou shalt be fed with its riches.",
        "4 Delight in the Lord, and he will give thee the requests of thy heart.",
        "R. The salvation of the just comes from the Lord.",
        "18 The Lord knoweth the days of undefiled; and their inheritance shall be for ever.",
        "23 With the Lord shall the steps of a man be directed, and he shall like well his way.",
        "R. The salvation of the just comes from the Lord.",
        "27 Decline from evil and do good, and dwell for ever and ever.",
        "29 But the just shall inherit the land, and shall dwell therein for evermore.",
        "R. The salvation of the just comes from the Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 23",
      "reference": "John 14: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Whoever loves me will keep my word, and my Father will love him, and we will come to him.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 17: 7-10",
      "reference": "Luke 17: 7-10",
      "verses": [
        "7 But which of you having a servant ploughing, or feeding cattle, will say to him, when he is come from the field: Immediately go, sit down to meat:",
        "8 And will not rather say to him: Make ready my supper, and gird thyself, and serve me, whilst I eat and drink, and afterwards thou shalt eat and drink?",
        "9 Doth he thank that servant, for doing the things which he commanded him?",
        "10 I think not. So you also, when you shall have done all these things that are commanded you, say: We are unprofitable servants; we have done that which we ought to do."
      ]
    }
  ]
}