{
  "date": "2026-11-29",
  "url": "https://www.catholicgallery.org/mass-reading/291126/",
  "title": "Daily Mass Readings for Sunday, 29 November 2026",
  "feast": "First Sunday of Advent",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 63: 16b-17, 19b; 64: 2-7",
      "reference": "Isaiah 63: 16b-17, 19b; 64: 2-7",
      "verses": [
        "16 For thou art our father, and Abraham hath not known us, and Israel hath been ignorant of us: thou, O Lord, art our father, our redeemer, from everlasting is thy name.",
        "17 Why hast thou made us to err, O Lord, from thy ways: why hast thou hardened our heart, that we should not fear thee? return for the sake of thy servants, the tribes of thy inheritance.",
        "19 We are become as in the beginning, when thou didst not rule over us, and when we were not called by thy name.",
        "64:2 When thou shalt do wonderful things, we shall not bear them: thou didst come down, and at thy presence the mountains melted away.",
        "3 From the beginning of the world they have not heard, nor perceived with the ears: the eye hath not seen, O God, besides thee, what things thou hast prepared for them that wait for thee.",
        "4 Thou hast met him that rejoiceth, and doth justice: in thy ways they shall remember thee: behold thou art angry, and we have sinned: in them we have been always, and we shall be saved.",
        "5 And we are all become as one unclean, and all our justices as the rag of a menstruous woman: and we have all fallen as a leaf, and our iniquities, like the wind, have taken us away.",
        "6 There is none that calleth upon thy name: that riseth up, and taketh hold of thee: thou hast hid thy face from us, and hast crushed us in the hand of our iniquity.",
        "7 And now, O Lord, thou art our father, and we are clay: and thou art our maker, and we all are the works of thy hands."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 80: 2-3, 15-16, 18-19",
      "reference": "Psalms 80: 2-3, 15-16, 18-19",
      "verses": [
        "R. (4) Lord, make us turn to you; let us see your face and we shall be saved.",
        "2 Give ear, O thou that rulest Israel: thou that leadest Joseph like a sheep. Thou that sittest upon the cherubims, shine forth",
        "3 Before Ephraim, Benjamin, and Manasses. Stir up thy might, and come to save us.",
        "R. Lord, make us turn to you; let us see your face and we shall be saved.",
        "15 Turn again, O God of hosts, look down from heaven, and see, and visit this vineyard:",
        "16 And perfect the same which thy right hand hath planted: and upon the son of man whom thou hast confirmed for thyself.",
        "R. Lord, make us turn to you; let us see your face and we shall be saved.",
        "18 Let thy hand be upon the man of thy right hand: and upon the son of man whom thou hast confirmed for thyself.",
        "19 And we depart not from thee, thou shalt quicken us: and we will call upon thy name.",
        "R. Lord, make us turn to you; let us see your face and we shall be saved."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First Corinthians 1: 3-9",
      "reference": "First Corinthians 1: 3-9",
      "verses": [
        "3 Grace to you, and peace from God our Father, and from the Lord Jesus Christ.",
        "4 I give thanks to my God always for you, for the grace of God that is given you in Christ Jesus,",
        "5 That in all things you are made rich in him, in all utterance, and in all knowledge;",
        "6 As the testimony of Christ was confirmed in you,",
        "7 So that nothing is wanting to you in any grace, waiting for the manifestation of our Lord Jesus Christ.",
        "8 Who also will confirm you unto the end without crime, in the day of the coming of our Lord Jesus Christ.",
        "9 God is faithful: by whom you are called unto the fellowship of his Son Jesus Christ our Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Psalms 85: 8",
      "reference": "Psalms 85: 8",
      "verses": [
        "R. Alleluia, alleluia.",
        "8 Show us Lord, your love; and grant us your salvation.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 13: 33-37",
      "reference": "Mark 13: 33-37",
      "verses": [
        "33 Take ye heed, watch and pray. For ye know not when the time is.",
        "34 Even as a man who going into a far country, left his house; and gave authority to his servants over every work, and commanded the porter to watch.",
        "35 Watch ye therefore, (for you know not when the lord of the house cometh: at even, or at midnight, or at the cockcrowing, or in the morning,)",
        "36 Lest coming on a sudden, he find you sleeping.",
        "37 And what I say to you, I say to all: Watch."
      ]
    }
  ]
}