{
  "date": "2026-11-20",
  "url": "https://www.catholicgallery.org/mass-reading/201126/",
  "title": "Daily Mass Readings for Friday, 20 November 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Revelation 10: 8-11",
      "reference": "Revelation 10: 8-11",
      "verses": [
        "8 And I heard a voice from heaven again speaking to me, and saying: Go, and take the book that is open, from the hand of the angel who standeth upon the sea, and upon the earth.",
        "9 And I went to the angel, saying unto him, that he should give me the book. And he said to me: Take the book, and eat it up: and it shall make thy belly bitter, but in thy mouth it shall be sweet as honey.",
        "10 And I took the book from the hand of the angel, and ate it up: and it was in my mouth, sweet as honey: and when I had eaten it, my belly was bitter.",
        "11 And he said to me: Thou must prophesy again to many nations, and peoples, and tongues, and kings."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 119: 14, 24, 72, 103, 111, 131",
      "reference": "Psalms 119: 14, 24, 72, 103, 111, 131",
      "verses": [
        "R. (103a) How sweet to my taste is your promise!",
        "14 I have been delighted in the way of thy testimonies, as in all riches.",
        "R. How sweet to my taste is your promise!",
        "24 For thy testimonies are my meditation: and thy justifications my counsel.",
        "R. How sweet to my taste is your promise!",
        "72 The law of thy mouth is good to me, above thousands of gold and silver.",
        "R. How sweet to my taste is your promise!",
        "103 How sweet are thy words to my palate! more than honey to my mouth.",
        "R. How sweet to my taste is your promise!",
        "111 I have purchased thy testimonies for an inheritance for ever: because they are a joy to my heart.",
        "R. How sweet to my taste is your promise!",
        "131 I opened my mouth and panted: because I longed for thy commandments.",
        "R. How sweet to my taste is your promise!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 10: 27",
      "reference": "John 10: 27",
      "verses": [
        "R. Alleluia, alleluia.",
        "27 My sheep hear my voice, says the Lord; I know them, and they follow me.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 19: 45-48",
      "reference": "Luke 19: 45-48",
      "verses": [
        "45 And entering into the temple, he began to cast out them that sold therein, and them that bought.",
        "46 Saying to them: It is written: My house is the house of prayer. But you have made it a den of thieves.",
        "47 And he was teaching daily in the temple. And the chief priests and the scribes and the rulers of the people sought to destroy him:",
        "48 And they found not what to do to him: for all the people were very attentive to hear him."
      ]
    }
  ]
}