{
  "date": "2026-11-16",
  "url": "https://www.catholicgallery.org/mass-reading/161126/",
  "title": "Daily Mass Readings for Monday, 16 November 2026",
  "feast": "Ordinary Weekday/ Margaret of Scotland, Married Woman/ Gertrude the Great, Virgin, Religious",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Revelation 1: 1-4; 2: 1-5",
      "reference": "Revelation 1: 1-4; 2: 1-5",
      "verses": [
        "1 The Revelation of Jesus Christ, which God gave unto him, to make known to his servants the things which must shortly come to pass: and signified, sending by his angel to his servant John,",
        "2 Who hath given testimony to the word of God, and the testimony of Jesus Christ, what things soever he hath seen.",
        "3 Blessed is he, that readeth and heareth the words of this prophecy; and keepeth those things which are written in it; for the time is at hand.",
        "4 John to the seven churches which are in Asia. Grace be unto you and peace from him that is, and that was, and that is to come, and from the seven spirits which are before his throne,",
        "2:1 Unto the angel of the church of Ephesus write: These things saith he, who holdeth the seven stars in his right hand, who walketh in the midst of the seven golden candlesticks:",
        "2 I know thy works, and thy labour, and thy patience, and how thou canst not bear them that are evil, and thou hast tried them, who say they are apostles, and are not, and hast found them liars:",
        "3 And thou hast patience, and hast endured for my name, and hast not fainted.",
        "4 But I have somewhat against thee, because thou hast left thy first charity.",
        "5 Be mindful therefore from whence thou art fallen: and do penance, and do the first works. Or else I come to thee, and will move thy candlestick out of its place, except thou do penance."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 1: 1-2, 3, 4 and 6",
      "reference": "Psalms 1: 1-2, 3, 4 and 6",
      "verses": [
        "R. (Rev. 2:17) Those who are victorious I will feed from the tree of life.",
        "1 Blessed is the man who hath not walked in the counsel of the ungodly, nor stood in the way of sinners, nor sat in the chair of pestilence.",
        "2 But his will is in the law of the Lord, and on his law he shall meditate day and night.",
        "R. Those who are victorious I will feed from the tree of life.",
        "3 And he shall be like a tree which is planted near the running waters, which shall bring forth its fruit, in due season. And his leaf shall not fall off: and all whatsoever he shall do shall prosper.",
        "R. Those who are victorious I will feed from the tree of life.",
        "4 Not so the wicked, not so: but like the dust, which the wind driveth from the face of the earth.",
        "6 For the Lord knoweth the way of the just: and the way of the wicked shall perish.",
        "R. Those who are victorious I will feed from the tree of life."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 8: 12",
      "reference": "John 8: 12",
      "verses": [
        "R. Alleluia, alleluia.",
        "12 I am the light of the world, says the Lord; whoever follows me will have the light of life.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 18: 35-43",
      "reference": "Luke 18: 35-43",
      "verses": [
        "35 Now it came to pass, when he drew nigh to Jericho, that a certain blind man sat by the way side, begging.",
        "36 And when he heard the multitude passing by, he asked what this meant.",
        "37 And they told him, that Jesus of Nazareth was passing by.",
        "38 And he cried out, saying: Jesus, son of David, have mercy on me.",
        "39 And they that went before, rebuked him, that he should hold his peace: but he cried out much more: Son of David, have mercy on me.",
        "40 And Jesus standing, commanded him to be brought unto him. And when he was come near, he asked him,",
        "41 Saying: What wilt thou that I do to thee? But he said: Lord, that I may see.",
        "42 And Jesus said to him: Receive thy sight: thy faith hath made thee whole.",
        "43 And immediately he saw, and followed him, glorifying God. And all the people, when they saw it, gave praise to God."
      ]
    }
  ]
}