{
  "date": "2026-11-14",
  "url": "https://www.catholicgallery.org/mass-reading/141126/",
  "title": "Daily Mass Readings for Saturday, 14 November 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Third John 1: 5-8",
      "reference": "Third John 1: 5-8",
      "verses": [
        "5 Dearly beloved, thou dost faithfully whatever thou dost for the brethren, and that for strangers,",
        "6 Who have given testimony to thy charity in the sight of the church: whom thou shalt do well to bring forward on their way in a manner worthy of God.",
        "7 Because, for his name they went out, taking nothing of the Gentiles.",
        "8 We therefore ought to receive such, that we may be fellow helpers of the truth."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 112: 1-2, 3-4, 5-6",
      "reference": "Psalms 112: 1-2, 3-4, 5-6",
      "verses": [
        "R. (1a) Blessed the man who fears the Lord.",
        "or",
        "R. Alleluia.",
        "1 Blessed is the man that feareth the Lord: he shall delight exceedingly in his commandments.",
        "2 His seed shall be mighty upon earth: the generation of the righteous shall be blessed.",
        "R. Blessed the man who fears the Lord.",
        "or",
        "R. Alleluia.",
        "3 Glory and wealth shall be in his house: and his justice remaineth for ever and ever.",
        "4 To the righteous a light is risen up in darkness: he is merciful, and compassionate and just.",
        "R. Blessed the man who fears the Lord.",
        "or",
        "R. Alleluia.",
        "5 Acceptable is the man that sheweth mercy and lendeth: he shall order his words with judgment:",
        "6 Because he shall not be moved for ever.",
        "R. Blessed the man who fears the Lord.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Second Thessalonians 2: 14",
      "reference": "Second Thessalonians 2: 14",
      "verses": [
        "R. Alleluia, alleluia.",
        "14 God has called us through the Gospel, to possess the glory of our Lord Jesus Christ.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 18: 1-8",
      "reference": "Luke 18: 1-8",
      "verses": [
        "1 And he spoke also a parable to them, that we ought always to pray, and not to faint,",
        "2 Saying: There was a judge in a certain city, who feared not God, nor regarded man.",
        "3 And there was a certain widow in that city, and she came to him, saying: Avenge me of my adversary.",
        "4 And he would not for a long time. But afterwards he said within himself: Although I fear not God, nor regard man,",
        "5 Yet because this widow is troublesome to me, I will avenge her, lest continually coming she weary me.",
        "6 And the Lord said: Hear what the unjust judge saith.",
        "7 And will not God revenge his elect who cry to him day and night: and will he have patience in their regard?",
        "8 I say to you, that he will quickly revenge them. But yet the Son of man, when he cometh, shall he find, think you, faith on earth?"
      ]
    }
  ]
}