{
  "date": "2026-11-12",
  "url": "https://www.catholicgallery.org/mass-reading/121126/",
  "title": "Daily Mass Readings for Thursday, 12 November 2026",
  "feast": "Josaphat, Bishop, Religious, Martyr Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Philemon 1: 7-20",
      "reference": "Philemon 1: 7-20",
      "verses": [
        "7 For I have had great joy and consolation in thy charity, because the bowels of the saints have been refreshed by thee, brother.",
        "8 Wherefore though I have much confidence in Christ Jesus, to command thee that which is to the purpose:",
        "9 For charity sake I rather beseech, whereas thou art such a one, as Paul an old man, and now a prisoner also of Jesus Christ.",
        "10 I beseech thee for my son, whom I have begotten in my bands, Onesimus,",
        "11 Who hath been heretofore unprofitable to thee, but now is profitable both to me and thee,",
        "12 Whom I have sent back to thee. And do thou receive him as my own bowels.",
        "13 Whom I would have retained with me, that in thy stead he might have ministered to me in the bands of the gospel:",
        "14 But without thy counsel I would do nothing: that thy good deed might not be as it were of necessity, but voluntary.",
        "15 For perhaps he therefore departed for a season from thee, that thou mightest receive him again for ever:",
        "16 Not now as a servant, but instead of a servant, a most dear brother, especially to me: but how much more to thee both in the flesh and in the Lord?",
        "17 If therefore thou count me a partner, receive him as myself.",
        "18 And if he hath wronged thee in any thing, or is in thy debt, put that to my account.",
        "19 I Paul have written it with my own hand: I will repay it: not to say to thee, that thou owest me thy own self also.",
        "20 Yea, brother. May I enjoy thee in the Lord. Refresh my bowels in the Lord."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 146: 7, 8-9a, 9bc-10",
      "reference": "Psalms 146: 7, 8-9a, 9bc-10",
      "verses": [
        "R. (5a) Blessed is he whose help is the God of Jacob.",
        "or",
        "R. Alleluia.",
        "7 Who keepeth truth for ever: who executeth judgment for them that suffer wrong: who giveth food to the hungry. The Lord looseth them that are fettered:",
        "R. Blessed is he whose help is the God of Jacob.",
        "or",
        "R. Alleluia.",
        "8 The Lord enlighteneth the blind. The Lord lifteth up them that are cast down: the Lord loveth the just.",
        "9a The Lord keepeth the strangers.",
        "R. Blessed is he whose help is the God of Jacob.",
        "or",
        "R. Alleluia.",
        "9bc He will support the fatherless and the widow: and the ways of sinners he will destroy.",
        "10 The Lord shall reign for ever: thy God, O Sion, unto generation and generation.",
        "R. Blessed is he whose help is the God of Jacob.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 15: 5",
      "reference": "John 15: 5",
      "verses": [
        "R. Alleluia, alleluia.",
        "5 I am the vine, you are the branches, says the Lord: whoever remains in me and I in him will bear much fruit.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 17: 20-25",
      "reference": "Luke 17: 20-25",
      "verses": [
        "20 And being asked by the Pharisees, when the kingdom of God should come? he answered them, and said: The kingdom of God cometh not with observation:",
        "21 Neither shall they say: Behold here, or behold there. For lo, the kingdom of God is within you.",
        "22 And he said to his disciples: The days will come, when you shall desire to see one day of the Son of man; and you shall not see it.",
        "23 And they will say to you: See here, and see there. Go ye not after, nor follow them:",
        "24 For as the lightening that lighteneth from under heaven, shineth unto the parts that are under heaven, so shall the Son of man be in his day.",
        "25 But first he must suffer many things, and be rejected by this generation."
      ]
    }
  ]
}