{
  "date": "2026-11-21",
  "url": "https://www.catholicgallery.org/mass-reading/211126/",
  "title": "Daily Mass Readings for Saturday, 21 November 2026",
  "feast": "Presentation of the Blessed Virgin Mary Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Revelation 11: 4-12",
      "reference": "Revelation 11: 4-12",
      "verses": [
        "4 These are the two olive trees, and the two candlesticks, that stand before the Lord of the earth.",
        "5 And if any man will hurt them, fire shall come out of their mouths, and shall devour their enemies. And if any man will hurt them, in this manner must he be slain.",
        "6 These have power to shut heaven, that it rain not in the days of their prophecy: and they have power over waters to turn them into blood, and to strike the earth with all plagues as often as they will.",
        "7 And when they shall have finished their testimony, the beast, that ascendeth out of the abyss, shall make war against them, and shall overcome them, and kill them.",
        "8 And their bodies shall lie in the streets of the great city, which is called spiritually, Sodom and Egypt, where their Lord also was crucified.",
        "9 And they of the tribes, and peoples, and tongues, and nations, shall see their bodies for three days and a half: and they shall not suffer their bodies to be laid in sepulchres.",
        "10 And they that dwell upon the earth shall rejoice over them, and make merry: and shall send gifts one to another, because these two prophets tormented them that dwelt upon the earth.",
        "11 And after three days and a half, the spirit of life from God entered into them. And they stood upon their feet, and great fear fell upon them that saw them.",
        "12 And they heard a great voice from heaven, saying to them: Come up hither. And they went up to heaven in a cloud: and their enemies saw them."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 144: 1, 2, 9-10",
      "reference": "Psalms 144: 1, 2, 9-10",
      "verses": [
        "R. (1a) Blessed be the Lord, my Rock!",
        "1 Blessed be the Lord my God, who teacheth my hands to fight, and my fingers to war.",
        "R. Blessed be the Lord, my Rock!",
        "2 My mercy, and my refuge: my support, and my deliverer: My protector, and I have hoped in him: who subdueth my people under me.",
        "R. Blessed be the Lord, my Rock!",
        "9 To thee, O God, I will sing a new canticle: on the psaltery and an instrument of ten strings I will sing praises to thee.",
        "10 Who givest salvation to kings: who hast redeemed thy servant David from the malicious sword.",
        "R. Blessed be the Lord, my Rock!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Second Timothy 1: 10",
      "reference": "Second Timothy 1: 10",
      "verses": [
        "R. Alleluia, alleluia.",
        "10 Our Savior Jesus Christ has destroyed death and brought life to light through the Gospel.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 20: 27-40",
      "reference": "Luke 20: 27-40",
      "verses": [
        "27 And there came to him some of the Sadducees, who deny that there is any resurrection, and they asked him,",
        "28 Saying: Master, Moses wrote unto us, If any man’s brother die, having a wife, and he leave no children, that his brother should take her to wife, and raise up seed unto his brother.",
        "29 There were therefore seven brethren: and the first took a wife, and died without children.",
        "30 And the next took her to wife, and he also died childless.",
        "31 And the third took her. And in like manner all the seven, and they left no children, and died.",
        "32 Last of all the woman died also.",
        "33 In the resurrection therefore, whose wife of them shall she be? For all the seven had her to wife.",
        "34 And Jesus said to them: The children of this world marry, and are given in marriage:",
        "35 But they that shall be accounted worthy of that world, and of the resurrection from the dead, shall neither be married, nor take wives.",
        "36 Neither can they die any more: for they are equal to the angels, and are the children of God, being the children of the resurrection.",
        "37 Now that the dead rise again, Moses also shewed, at the bush, when he called the Lord, The God of Abraham, and the God of Isaac, and the God of Jacob;",
        "38 For he is not the God of the dead, but of the living: for all live to him.",
        "39 And some of the scribes answering, said to him: Master, thou hast said well.",
        "40 And after that they durst not ask him any more questions."
      ]
    }
  ]
}