{
  "date": "2026-11-07",
  "url": "https://www.catholicgallery.org/mass-reading/071126/",
  "title": "Daily Mass Readings for Saturday, 7 November 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Philippians 4: 10-19",
      "reference": "Philippians 4: 10-19",
      "verses": [
        "10 Now I rejoice in the Lord exceedingly, that now at length your thought for me hath flourished again, as you did also think; but you were busied.",
        "11 I speak not as it were for want. For I have learned, in whatsoever state I am, to be content therewith.",
        "12 I know both how to be brought low, and I know how to abound: (everywhere, and in all things I am instructed) both to be full, and to be hungry; both to abound, and to suffer need.",
        "13 I can do all these things in him who strengtheneth me.",
        "14 Nevertheless you have done well in communicating to my tribulation.",
        "15 And you also know, O Philippians, that in the beginning of the gospel, when I departed from Macedonia, no church communicated with me as concerning giving and receiving, but you only:",
        "16 For unto Thessalonica also you sent once and again for my use.",
        "17 Not that I seek the gift, but I seek the fruit that may abound to your account.",
        "18 But I have all, and abound: I am filled, having received from Epaphroditus the things you sent, an odour of sweetness, an acceptable sacrifice, pleasing to God.",
        "19 And may my God supply all your want, according to his riches in glory in Christ Jesus."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 112: 1b-2, 5-6, 8a and 9",
      "reference": "Psalms 112: 1b-2, 5-6, 8a and 9",
      "verses": [
        "R. (1a) Blessed the man who fears the Lord.",
        "or",
        "R. Alleluia.",
        "1 Blessed is the man that feareth the Lord: he shall delight exceedingly in his commandments.",
        "2 His seed shall be mighty upon earth: the generation of the righteous shall be blessed.",
        "R. Blessed the man who fears the Lord.",
        "or",
        "R. Alleluia.",
        "5 Acceptable is the man that sheweth mercy and lendeth: he shall order his words with judgment:",
        "6 Because he shall not be moved for ever.",
        "R. Blessed the man who fears the Lord.",
        "or",
        "R. Alleluia.",
        "8 His heart is strengthened, he shall not be moved until he look over his enemies.",
        "9 He hath distributed, he hath given to the poor: his justice remaineth for ever and ever: his horn shall be exalted in glory.",
        "R. Blessed the man who fears the Lord.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Second Corinthians 8: 9",
      "reference": "Second Corinthians 8: 9",
      "verses": [
        "R. Alleluia, alleluia.",
        "9 Jesus Christ became poor although he was rich, So that by his poverty you might become rich.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 16: 9-15",
      "reference": "Luke 16: 9-15",
      "verses": [
        "9 And I say to you: Make unto you friends of the mammon of iniquity; that when you shall fail, they may receive you into everlasting dwellings.",
        "10 He that is faithful in that which is least, is faithful also in that which is greater: and he that is unjust in that which is little, is unjust also in that which is greater.",
        "11 If then you have not been faithful in the unjust mammon; who will trust you with that which is the true?",
        "12 And if you have not been faithful in that which is another’s; who will give you that which is your own?",
        "13 No servant can serve two masters: for either he will hate the one, and love the other; or he will hold to the one, and despise the other. You cannot serve God and mammon.",
        "14 Now the Pharisees, who were covetous, heard all these things: and they derided him.",
        "15 And he said to them: You are they who justify yourselves before men, but God knoweth your hearts; for that which is high to men, is an abomination before God."
      ]
    }
  ]
}