{
  "date": "2026-11-30",
  "url": "https://www.catholicgallery.org/mass-reading/301126/",
  "title": "Daily Mass Readings for Monday, 30 November 2026",
  "feast": "Andrew, Apostle Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Romans 10: 9-18",
      "reference": "Romans 10: 9-18",
      "verses": [
        "9 For if thou confess with thy mouth the Lord Jesus, and believe in thy heart that God hath raised him up from the dead, thou shalt be saved.",
        "10 For, with the heart, we believe unto justice; but, with the mouth, confession is made unto salvation.",
        "11 For the scripture saith: Whosoever believeth in him, shall not be confounded.",
        "12 For there is no distinction of the Jew and the Greek: for the same is Lord over all, rich unto all that call upon him.",
        "13 For whosoever shall call upon the name of the Lord, shall be saved.",
        "14 How then shall they call on him, in whom they have not believed? Or how shall they believe him, of whom they have not heard? And how shall they hear, without a preacher?",
        "15 And how shall they preach unless they be sent, as it is written: How beautiful are the feet of them that preach the gospel of peace, of them that bring glad tidings of good things!",
        "16 But all do not obey the gospel. For Isaias saith: Lord, who hath believed our report?",
        "17 Faith then cometh by hearing; and hearing by the word of Christ.",
        "18 But I say: Have they not heard? Yes, verily, their sound hath gone forth into all the earth, and their words unto the ends of the whole world."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 19: 8, 9, 10, 11",
      "reference": "Psalms 19: 8, 9, 10, 11",
      "verses": [
        "R. (10) The judgments of the Lord are true, and all of them are just.",
        "or",
        "R. (John 6:63) Your words, Lord, are Spirit and life.",
        "8 The law of the Lord is unspotted, converting souls: the testimony of the Lord is faithful, giving wisdom to little ones.",
        "R. The judgments of the Lord are true, and all of them are just.",
        "or",
        "R. Your words, Lord, are Spirit and life.",
        "9 The justices of the Lord are right, rejoicing hearts: the commandment of the Lord is lightsome, enlightening the eyes.",
        "R. The judgments of the Lord are true, and all of them are just.",
        "or",
        "R. Your words, Lord, are Spirit and life.",
        "10 The fear of the Lord is holy, enduring for ever and ever: the judgments of the Lord are true, justified in themselves.",
        "R. The judgments of the Lord are true, and all of them are just.",
        "or",
        "R. Your words, Lord, are Spirit and life.",
        "11 More to be desired than gold and many precious stones: and sweeter than honey and the honeycomb.",
        "R. The judgments of the Lord are true, and all of them are just.",
        "or",
        "R. Your words, Lord, are Spirit and life."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 4: 19",
      "reference": "Matthew 4: 19",
      "verses": [
        "R. Alleluia, alleluia.",
        "19 Come after me, says the Lord, and I will make you fishers of men.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 4: 18-22",
      "reference": "Matthew 4: 18-22",
      "verses": [
        "18 And Jesus walking by the sea of Galilee, saw two brethren, Simon who is called Peter, and Andrew his brother, casting a net into the sea (for they were fishers).",
        "19 And he saith to them: Come ye after me, and I will make you to be fishers of men.",
        "20 And they immediately leaving their nets, followed him.",
        "21 And going on from thence, he saw other two brethren, James the son of Zebedee, and John his brother, in a ship with Zebedee their father, mending their nets: and he called them.",
        "22 And they forthwith left their nets and father, and followed him."
      ]
    }
  ]
}