{
  "date": "2026-11-13",
  "url": "https://www.catholicgallery.org/mass-reading/131126/",
  "title": "Daily Mass Readings for Friday, 13 November 2026",
  "feast": "Frances Xavier Cabrini, Virgin, Religious Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Second John 1: 4-9",
      "reference": "Second John 1: 4-9",
      "verses": [
        "4 I was exceeding glad, that I found of thy children walking in truth, as we have received a commandment from the Father.",
        "5 And now I beseech thee, lady, not as writing a new commandment to thee, but that which we have had from the beginning, that we love one another.",
        "6 And this is charity, that we walk according to his commandments. For this is the commandment, that, as you have heard from the beginning, you should walk in the same:",
        "7 For many seducers are gone out into the world, who confess not that Jesus Christ is come in the flesh: this is a seducer and an antichrist.",
        "8 Look to yourselves, that you lose not the things which you have wrought: but that you may receive a full reward.",
        "9 Whosoever revolteth, and continueth not in the doctrine of Christ, hath not God. He that continueth in the doctrine, the same hath both the Father and the Son."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 119: 1, 2, 10, 11, 17, 18",
      "reference": "Psalms 119: 1, 2, 10, 11, 17, 18",
      "verses": [
        "R. (1b) Blessed are they who follow the law of the Lord!",
        "1 ALEPH. Blessed are the undefiled in the way, who walk in the law of the Lord.",
        "R. Blessed are they who follow the law of the Lord!",
        "2 Blessed are they who search his testimonies: that seek him with their whole heart.",
        "R. Blessed are they who follow the law of the Lord!",
        "10 With my whole heart have I sought after thee: let me not stray from thy commandments.",
        "R. Blessed are they who follow the law of the Lord!",
        "11 Thy words have I hidden in my heart, that I may not sin against thee.",
        "R. Blessed are they who follow the law of the Lord!",
        "17 GIMEL. Give bountifully to thy servant, enliven me: and I shall keep thy words.",
        "R. Blessed are they who follow the law of the Lord!",
        "18 Open thou my eyes: and I will consider the wondrous things of thy law.",
        "R. Blessed are they who follow the law of the Lord!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 21: 28",
      "reference": "Luke 21: 28",
      "verses": [
        "R. Alleluia, alleluia.",
        "28 Stand erect and raise your heads because your redemption is at hand.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 17: 26-37",
      "reference": "Luke 17: 26-37",
      "verses": [
        "26 And as it came to pass in the days of Noe, so shall it be also in the days of the Son of man.",
        "27 They did eat and drink, they married wives, and were given in marriage, until the day that Noe entered into the ark: and the flood came and destroyed them all.",
        "28 Likewise as it came to pass, in the days of Lot: they did eat and drink, they bought and sold, they planted and built.",
        "29 And in the day that Lot went out of Sodom, it rained fire and brimstone from heaven, and destroyed them all.",
        "30 Even thus shall it be in the day when the Son of man shall be revealed.",
        "31 In that hour, he that shall be on the housetop, and his goods in the house, let him not go down to take them away: and he that shall be in the field, in like manner, let him not return back.",
        "32 Remember Lot’s wife.",
        "33 Whosoever shall seek to save his life, shall lose it: and whosoever shall lose it, shall preserve it.",
        "34 I say to you: in that night there shall be two men in one bed; the one shall be taken, and the other shall be left.",
        "35 Two women shall be grinding together: the one shall be taken, and the other shall be left: two men shall be in the field; the one shall be taken, and the other shall be left.",
        "36 They answering, say to him: Where, Lord?",
        "37 Who said to them: Wheresoever the body shall be, thither will the eagles also be gathered together."
      ]
    }
  ]
}