{
  "date": "2026-11-25",
  "url": "https://www.catholicgallery.org/mass-reading/251126/",
  "title": "Daily Mass Readings for Wednesday, 25 November 2026",
  "feast": "Ordinary Weekday/ Catherine of Alexandria, Virgin, Martyr",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Revelation 15: 1-4",
      "reference": "Revelation 15: 1-4",
      "verses": [
        "1 And I saw another sign in heaven, great and wonderful: seven angels having the seven last plagues. For in them is filled up the wrath of God.",
        "2 And I saw as it were a sea of glass mingled with fire, and them that had overcome the beast, and his image, and the number of his name, standing on the sea of glass, having the harps of God:",
        "3 And singing the canticle of Moses, the servant of God, and the canticle of the Lamb, saying: Great and wonderful are thy works, O Lord God Almighty; just and true are thy ways, O King of ages.",
        "4 Who shall not fear thee, O Lord, and magnify thy name? For thou only art holy: for all nations shall come, and shall adore in thy sight, because thy judgments are manifest."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 98: 1, 2-3ab, 7-8, 9",
      "reference": "Psalms 98: 1, 2-3ab, 7-8, 9",
      "verses": [
        "R. (Rev. 15: 3b) Great and wonderful are all your works, Lord, mighty God!",
        "1 Sing ye to the Lord a new canticle: because he hath done wonderful things. His right hand hath wrought for him salvation, and his arm is holy.",
        "R. Great and wonderful are all your works, Lord, mighty God!",
        "2 The Lord hath made known his salvation: he hath revealed his justice in the sight of the Gentiles.",
        "3ab He hath remembered his mercy his truth toward the house of Israel.",
        "R. Great and wonderful are all your works, Lord, mighty God!",
        "7 Let the sea be moved and the fulness thereof: the world and they that dwell therein.",
        "8 The rivers shall clap their hands, the mountains shall rejoice together",
        "R. Great and wonderful are all your works, Lord, mighty God!",
        "9 At the presence of the Lord: because he cometh to judge the earth. He shall judge the world with justice, and the people with equity.",
        "R. Great and wonderful are all your works, Lord, mighty God!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Revelation 2: 10c",
      "reference": "Revelation 2: 10c",
      "verses": [
        "R. Alleluia, alleluia.",
        "10c Remain faithful until death, and I will give you the crown of life.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 21: 12-19",
      "reference": "Luke 21: 12-19",
      "verses": [
        "12 But before all these things, they will lay their hands upon you, and persecute you, delivering you up to the synagogues and into prisons, dragging you before kings and governors, for my name’s sake.",
        "13 And it shall happen unto you for a testimony.",
        "14 Lay it up therefore into your hearts, not to meditate before how you shall answer:",
        "15 For I will give you a mouth and wisdom, which all your adversaries shall not be able to resist and gainsay.",
        "16 And you shall be betrayed by your parents and brethren, and kinsmen and friends; and some of you they will put to death.",
        "17 And you shall be hated by all men for my name’s sake.",
        "18 But a hair of your head shall not perish.",
        "19 In your patience you shall possess your souls."
      ]
    }
  ]
}