{
  "date": "2026-11-09",
  "url": "https://www.catholicgallery.org/mass-reading/091126/",
  "title": "Daily Mass Readings for Monday, 9 November 2026",
  "feast": "Dedication of the Lateran Basilica in Rome Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ezekiel 47: 1-2, 8-9, 12",
      "reference": "Ezekiel 47: 1-2, 8-9, 12",
      "verses": [
        "1 And he brought me again to the gate of the house, and behold waters issued out from under the threshold of the house toward the east: for the forefront, of the house looked toward the east: but the waters came down to the right side of the temple to the south part of the altar.",
        "2 And he led me out by the way of the north gate, and he caused me to turn to the way without the outward gate to the way that looked toward the east: and behold there ran out waters on the right side.",
        "8 And he said to me: These waters that issue forth toward the hillocks of sand to the east, and go down to the plains of the desert, shall go into the sea, and shall go out, and the waters shall be healed.",
        "9 And every living creature that creepeth whithersoever the torrent shall come, shall live: and there shall be fishes in abundance after these waters shall come thither, and they shall be healed, and all things shall live to which the torrent shall come.",
        "12 And by the torrent on the banks thereof on both sides shall grow all trees that bear fruit: their leaf shall not fall off, and their fruit shall not fail: every month shall they bring forth firstfruits, because the waters thereof shall issue out of the sanctuary: and the fruits thereof shall be for food, and the leaves thereof for medicine."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 46: 2-3, 5-6, 8-9",
      "reference": "Psalms 46: 2-3, 5-6, 8-9",
      "verses": [
        "R. (5) The waters of the river gladden the city of God, the holy dwelling of the Most High!",
        "2 Our God is our refuge and strength: a helper in troubles, which have found us exceedingly.",
        "3 Therefore we will not fear, when the earth shall be troubled; and the mountains shall be removed into the heart of the sea.",
        "R. The waters of the river gladden the city of God, the holy dwelling of the Most High!",
        "5 The stream of the river maketh the city of God joyful: the most High hath sanctified his own tabernacle.",
        "6 God is in the midst thereof, it shall not be moved: God will help it in the morning early.",
        "R. The waters of the river gladden the city of God, the holy dwelling of the Most High!",
        "8 The Lord of armies is with us: the God of Jacob is our protector.",
        "9 Come and behold ye the works of the Lord: what wonders he hath done upon earth,",
        "R. The waters of the river gladden the city of God, the holy dwelling of the Most High!"
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First Corinthians 3: 9c-11, 16-17",
      "reference": "First Corinthians 3: 9c-11, 16-17",
      "verses": [
        "9c You are God’s husbandry; you are God’s building.",
        "10 According to the grace of God that is given to me, as a wise architect, I have laid the foundation; and another buildeth thereon. But let every man take heed how he buildeth thereupon.",
        "11 For other foundation no man can lay, but that which is laid; which is Christ Jesus.",
        "16 Know you not, that you are the temple of God, and that the Spirit of God dwelleth in you?",
        "17 But if any man violate the temple of God, him shall God destroy. For the temple of God is holy, which you are."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Second Chronicles 7: 16",
      "reference": "Second Chronicles 7: 16",
      "verses": [
        "R. Alleluia, alleluia.",
        "16 I have chosen and consecrated this house, says the Lord, that my name may be there forever.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 2: 13-22",
      "reference": "John 2: 13-22",
      "verses": [
        "13 And the pasch of the Jews was at hand, and Jesus went up to Jerusalem.",
        "14 And he found in the temple them that sold oxen and sheep and doves, and the changers of money sitting.",
        "15 And when he had made, as it were, a scourge of little cords, he drove them all out of the temple, the sheep also and the oxen, and the money of the changers he poured out, and the tables he overthrew.",
        "16 And to them that sold doves he said: Take these things hence, and make not the house of my Father a house of traffic.",
        "17 And his disciples remembered, that it was written: The zeal of thy house hath eaten me up.",
        "18 The Jews, therefore, answered, and said to him: What sign dost thou shew unto us, seeing thou dost these things?",
        "19 Jesus answered, and said to them: Destroy this temple, and in three days I will raise it up.",
        "20 The Jews then said: Six and forty years was this temple in building; and wilt thou raise it up in three days?",
        "21 But he spoke of the temple of his body.",
        "22 When therefore he was risen again from the dead, his disciples remembered, that he had said this, and they believed the scripture, and the word that Jesus had said."
      ]
    }
  ]
}