{
  "date": "2026-01-14",
  "title": "FEASTS OF THE DAY",
  "patronage": null,
  "prayer": "St. Devasahayam, For the love of Christ you have willingly and patiently underwent torments and tortures for three years, and willingly sacrificed your life and obtained the joy of eternal life and the veneration at the alters as God's great reward. We praise and thank God for blessing you with this glorious life.",
  "biography": "The devotion to the Holy Child Jesus has long been a tradition of the Catholic Church for a very long time. This devotion is a veneration of our Lord's sacred Infancy. Many saints had a very strong devotion to the Divine Child, notably St. Therese of the Child Jesus, St. Francis of Assisi, St. Anthony of Padua, and St. Teresa of Avila.\n\nPrague is the capitol city of the Czech Republic, which is at the very central of Europe with Germany, Poland, Russia and Austria as its neighbours. The history of the Infant Jesus of Prague started in the 17th century when a statue of the Infant Jesus was brought into Bohemia (now Czech Republic) and eventually was given to the Discalced Carmelites in Prague. Since then, the statue has remained in Prague and has drawn many devotees worldwide to go and honor the Holy Child. Many graces, blessings, favors and miraculous healings have been received by many who petitioned before the Infant Jesus.\n\nThe exact origin of the Infant Jesus statue was not truly known, but historical sources point to a small 28cm high sculpture of the Holy Child with a bird in his right hand carved in around the year 1340. Many other Infant Jesus sculptures were also carved by famous masters throughout Europe in the Middle Ages.\n\nThe popularity of the Child Jesus grew in the Baroque period in Spain which may have been caused by the visions of St. Teresa of Avila. A number of sculptures made in Spain eventually found their way to Prague. These sculptures were made of wax, ivory, and bronze and were dressed in garments reflecting the aristocratic fashion of that period.\n\nIt is unknown to this date which of those early sculptures that got to Prague was the exact origin of the Infant Jesus of Prague. It was speculated that it came from a monastery in Bohemia and from there it was obtained by Dona Isabella Manrique who gave it as a wedding gift to her daughter Marie Manrique who married a noble of the Czech kingdom. Later, the Holy Infant statue was again given to Marie's daughter Polyxena as a wedding gift in 1587. In 1628, Lady Polyxena presented the statue to the Carmelites at the Church of the Virgin Mary the Victorious in Mala Strana saying, \"I am giving you what I most esteem of my possessions. Keep the sculpture in reference and you will be well off\". This statue then became known as the Infant Jesus of Prague. It stands 47 cm high (includes a 2cm base) and has a long gown around the wax body.\n\nShortly after 1628, the Saxons and the Swedes took turns to invade Prague and the Carmelites had to flee and the veneration of the Holy Infant ceased. It was not until 1638 that a young priest named Fr. P. Cyril, a Matre Dei, returned to Prague and found the Holy Infant statue buried in the ruins of the Lady of Victory church. Fr. Cyril cleaned the statue and placed it in the oratory for worship. While he was praying before the Infant Jesus, he heard the Infant Jesus say, \"\n\n\"Have mercy on Me and I will have mercy on you.Give Me hands and I will give you peace.The more you honor Me, the more I will bless you.\"\n\nThe repairing of the statue's hand was a miracle since Fr. Cyril and his peers did not have the financial resources nor the know — how to repair it. Through prayer, Fr. Cyril asked the Blessed Virgin Mary in several occassions to to provide the necessary funds for fixing the Infant statue. The Divine Infant spoke to him again, \"Place Me near the entrance of the sacristy and you will receive aid\". Fr. Cyril then did what he was told and in a few days time, the statue was fixed by a man who came to the sacristy to offer help.\n\nSince the statue was fixed, Many miracles have occurred through intercession to the Divine Infant. During one invasion, all the children of the city were taken to the Church for protection—praying to the Infant, they were all saved. For almost four centuries, this promise of protection and blessing has inspired devotion and love of the Infant Jesus of Prague. The word began to spread, resulting in a large increase of veneration to the Holy Child. This includes the Czech nobles as well. These early miracles were recorded in a book by P. Emerich a St Stephano, published in German in 1736 and in Czech in 1749.\n\nIn 1641, an altar was built for the Infant Jesus in the church, and in 1644 a chapel was built, but was not completed until 1654. Many nobles of the time had greatly supported the Infant Jesus, among them were Lady Polyxena, King Ferdinard (Czech), King Charles Gustav(Sweden), and Bernard Ignatius of the Lords of Martinic. It is interesting to note that the crown over the Divine Infant's head came from Bernard Ignatius, who presented the Infant statue with a little gold crown set with precious stones and jewels on January 14, 1651 during a procession that carried the Infant Jesus statue from the Lady of Victory church to other Prague churches. The Infant Jesus was solemnly coronated on April 4, 1655 by the Archbishop Josef Corta acting for Cardinal Harrach III who was sick.\n\nAfter that period, Prague went through more wars and unrest but the church and the Infant Jesus chapel was miraculously protected. In 1776 the altar was rebuilt using marble and two huge sculptures of the Blessed Virgin Mary and St. Joseph were placed to the left and right sides of the altar. The Holy Infant was kept in a glass case standing on a pedestal engraved with crystals, and surrounding the Infant were twenty angels in gold.\n\nSince then copies of the Infant Jesus were made and distributed throughout European churches. The Spanish colonial efforts later brought the Infant Jesus to the Philippines and to central America. And since then, the devotion has kept spreading to all parts of the world.\n\nPRAYER OF THANKSGIVING: Divine Infant Jesus, I know you love me and would never leave me. I thank you for your close presence in my life. Miraculous Infant, I believe in your promise of peace, blessings, and freedom from want. I place every need and care in your hands. Lord Jesus, may I always trust in your generous mercy and love. I want to honor and praise you, now and forever. Amen._\n\nMARTYR\n\n(23 April 1712 - 14 January 1752)\n\nDevasahayam Pillai (named Neelakanda Pillai at birth) was born into an affluent Nair-caste family at Nattalam in the present-day Kanyakumari District, on 23 April 1712. In the Nair matriarchal traditions of the day, Devasahayam Pillai was raised by his maternal uncle, and was inculcated with Hindu beliefs and traditions early on.\n\nDevasahayam's family had much influence in the royal palace of Maharaja Marthanda Varma, king of Travancore, and Devasahayam went into the service of the royal palace as a young man. His capabilities and enthusiasm did not go unnoticed in the palace, as he was soon put in charge of state affairs as an official under Ramayyan Dalawa, the Dewan of Travancore.\n\nCONVERSION TO CHRISTIANITY: In 1741, Captain Eustachius De Lannoy, a Dutch naval commander, was sent on command of a Dutch naval expedition by the Dutch East India Company to capture Colachel, a port under the control of Travancore, and establish a trading post there. In the battle (Battle of Colachel) that followed between the Travancore forces and De Lannoy's men, the Dutch forces were defeated and the men were either killed or captured. Eustachius De Lannoy, his assistant Donadi and a few other Dutch soldiers were captured and imprisoned.\n\nDe Lannoy and the Dutchmen were later pardoned by the king, on condition that they serve in the Travancore army. De Lannoy later earned the trust of the king and went on to become the commander of the Travancore armed forces, winning many battles and annexing various neighbouring territories to Travancore.\n\nIt was during their influential roles under the King of Travancore that Devasahayam Pillai and De Lannoy became well acquainted. De Lannoy's Christian faith interested Devasahayam and De Lannoy enlightened him on the faith, leading to his conversion in 1745.\n\nBAPTISM: On Devasahayam's acceptance of the Christian faith, he was baptized at the Roman Catholic Latin Rite church at Vadakkankulam village (in the present Tirunelveli District of Tamil Nadu), where the Jesuits had a mission under Rev. Fr. R. Bouttari Italus S.J. Neelakanda Pillai, his name at birth, was then changed to Lazar, although he is more widely known by the Tamil & Malayalam translation Devasahayam (meaning God's help). Pillai was married by this time to Bargavi Ammal of Travancore. She was also persuaded and converted to Christianity by her husband. His wife was given the baptismal name of Gnanapoo Ammaal (equivalent to Theresa in Tamil & Malayalam). Fearing reprisal in Travancore against her religious conversion, she chose to be a migrated-resident of this village. Some of Devasahayam Pillai's immediate family members also received baptism later, after being converted to Christianity.\n\nChurch chroniclers say that the Brahmin chief priest of the kingdom, the feudal lords, members of the royal household and the Nair community brought false charges on Devasahayam to the Dewan, Ramayyan Dalawa. Pillai was divested of his portfolio in the administration and was later accused of treason and of divulging state secrets to rivals and Europeans. He was later arrested and tortured for three years.\n\nOTHER TRADITIONS AND BELIEFS: Devasahayam Pillai was marched from Padmanabhapuram Palace to Aralvaimozhy by soldiers, over the period of a few days. Pillai was treated like a criminal and as was customary in those days for criminals, his body was painted with red and black spots, and was intentionally marched through populated areas, sitting backward on top of a water buffalo (the mythical vehicle or vahana of Yama, the lord of death in Hinduism) through the streets of South Travancore. As a method of torture, he was beaten every day with eighty stripes, pepper rubbed in his wounds and nostrils, exposed to the sun, and given only stagnant water to drink.\n\nWhile halting at Puliyoorkurichi, not far away from the Padmanabhapuram Palace of the Travancore king, it is believed by Christians that God quenched his thirst by letting water gush through a small hole on a rock, the very place where he knelt to pray. The water hole is still found in the compound of a church at Puliyoorkurichi, about 15 km from Nagercoil.\n\nIt is also believed that the leaves of a neem (Margosa) tree in the village of Peruvilai, to which he had been tied while being marched to Aralvaimozhy, cured illnesses of sick people in the village and around. Many more miracles are attributed to Devasahayam Pillai.\n\nDEATH: In 1752, the original order of the King and his Dewan was to deport him from Travancore, into the Pandya country, at Aralvaimozhy. He was let off in the forested hills near Aralvaimozhy. There, he is believed to have begun deep meditations, and the people from the adjacent villages began visiting the holy man. Christian sources allege that at this time, high caste Hindus plotted to do away with Devasahayam.\n\nSome people believe that the soldiers went up the forested hills and tried to shoot Devasahayam, but were unable to fire; after which he took the gun in his hands, blessed it and gave it back to the soldiers to shoot him to death, if they wished to. The soldiers took the gun back and fired at him five times. His body was then carelessly thrown out near the foothills at Kattadimalai.\n\nIt was at Kattadimali in Kanyakumari district that Devasahayam Pillai died on 14 January 1752. His mortal remains were interred near the altar inside St. Xavier's Church, Kottar, Nagercoil, which is now the diocesan Cathedral.\n\nSince the days of the interment of the mortal remains of Devesahayam Pillai many Christian pilgrims visited his tomb and offered prayers.\n\nBEATIFICATION AND DECLARATION AS A MARTYR: Devasahayam Pillai was declared a Martyr and Blessed on 2 December 2012, at a solemn ceremony held in the Diocese of Kottar at Carmel Higher Secondary School Grounds, Nagercoil, near the place of his burial. The Prefect of the Congregation for the Causes of Saints, Angelo Cardinal Amato presided at the function as Delegate of Pope Benedict XVI.\n\nOn 21 February 2020, Pope Francis recognized a miracle attributed to the intercession of Devasahayam, clearing his way to canonization (sainthood). He was canonized as a saint of the church by Pope Francis on 15 May 2022.\n\nYou set apart your whole life for preaching on the Kingdom of God, leaving behind all the worldly pleasures of wealth, status, name, fame and glory. You as a true Disciple of Christ faithfully put into practice the values of the Gospel, the equality and Fraternity of all people on earth.\n\nAssist us to follow you in leaving behind all the worldly pleasures and help us to live as children of the kingdom of God and put into practice faithfully the values of the Gospel so that we may one day enter into eternal life to be with God and your company forever and ever. Amen.\n\nO! St. Devasahayam, Glorious Martyr! Pray For Us!",
  "blocks": [
    {
      "type": "heading",
      "value": "FEASTS OF THE DAY"
    },
    {
      "type": "heading",
      "value": "Biography"
    },
    {
      "type": "text",
      "value": "The devotion to the Holy Child Jesus has long been a tradition of the Catholic Church for a very long time. This devotion is a veneration of our Lord's sacred Infancy. Many saints had a very strong devotion to the Divine Child, notably St. Therese of the Child Jesus, St. Francis of Assisi, St. Anthony of Padua, and St. Teresa of Avila."
    },
    {
      "type": "text",
      "value": "Prague is the capitol city of the Czech Republic, which is at the very central of Europe with Germany, Poland, Russia and Austria as its neighbours. The history of the Infant Jesus of Prague started in the 17th century when a statue of the Infant Jesus was brought into Bohemia (now Czech Republic) and eventually was given to the Discalced Carmelites in Prague. Since then, the statue has remained in Prague and has drawn many devotees worldwide to go and honor the Holy Child. Many graces, blessings, favors and miraculous healings have been received by many who petitioned before the Infant Jesus."
    },
    {
      "type": "text",
      "value": "The exact origin of the Infant Jesus statue was not truly known, but historical sources point to a small 28cm high sculpture of the Holy Child with a bird in his right hand carved in around the year 1340. Many other Infant Jesus sculptures were also carved by famous masters throughout Europe in the Middle Ages."
    },
    {
      "type": "text",
      "value": "The popularity of the Child Jesus grew in the Baroque period in Spain which may have been caused by the visions of St. Teresa of Avila. A number of sculptures made in Spain eventually found their way to Prague. These sculptures were made of wax, ivory, and bronze and were dressed in garments reflecting the aristocratic fashion of that period."
    },
    {
      "type": "text",
      "value": "It is unknown to this date which of those early sculptures that got to Prague was the exact origin of the Infant Jesus of Prague. It was speculated that it came from a monastery in Bohemia and from there it was obtained by Dona Isabella Manrique who gave it as a wedding gift to her daughter Marie Manrique who married a noble of the Czech kingdom. Later, the Holy Infant statue was again given to Marie's daughter Polyxena as a wedding gift in 1587. In 1628, Lady Polyxena presented the statue to the Carmelites at the Church of the Virgin Mary the Victorious in Mala Strana saying, \"I am giving you what I most esteem of my possessions. Keep the sculpture in reference and you will be well off\". This statue then became known as the Infant Jesus of Prague. It stands 47 cm high (includes a 2cm base) and has a long gown around the wax body."
    },
    {
      "type": "text",
      "value": "Shortly after 1628, the Saxons and the Swedes took turns to invade Prague and the Carmelites had to flee and the veneration of the Holy Infant ceased. It was not until 1638 that a young priest named Fr. P. Cyril, a Matre Dei, returned to Prague and found the Holy Infant statue buried in the ruins of the Lady of Victory church. Fr. Cyril cleaned the statue and placed it in the oratory for worship. While he was praying before the Infant Jesus, he heard the Infant Jesus say, \""
    },
    {
      "type": "text",
      "value": "\"Have mercy on Me and I will have mercy on you.Give Me hands and I will give you peace.The more you honor Me, the more I will bless you.\""
    },
    {
      "type": "text",
      "value": "The repairing of the statue's hand was a miracle since Fr. Cyril and his peers did not have the financial resources nor the know — how to repair it. Through prayer, Fr. Cyril asked the Blessed Virgin Mary in several occassions to to provide the necessary funds for fixing the Infant statue. The Divine Infant spoke to him again, \"Place Me near the entrance of the sacristy and you will receive aid\". Fr. Cyril then did what he was told and in a few days time, the statue was fixed by a man who came to the sacristy to offer help."
    },
    {
      "type": "text",
      "value": "Since the statue was fixed, Many miracles have occurred through intercession to the Divine Infant. During one invasion, all the children of the city were taken to the Church for protection—praying to the Infant, they were all saved. For almost four centuries, this promise of protection and blessing has inspired devotion and love of the Infant Jesus of Prague. The word began to spread, resulting in a large increase of veneration to the Holy Child. This includes the Czech nobles as well. These early miracles were recorded in a book by P. Emerich a St Stephano, published in German in 1736 and in Czech in 1749."
    },
    {
      "type": "text",
      "value": "In 1641, an altar was built for the Infant Jesus in the church, and in 1644 a chapel was built, but was not completed until 1654. Many nobles of the time had greatly supported the Infant Jesus, among them were Lady Polyxena, King Ferdinard (Czech), King Charles Gustav(Sweden), and Bernard Ignatius of the Lords of Martinic. It is interesting to note that the crown over the Divine Infant's head came from Bernard Ignatius, who presented the Infant statue with a little gold crown set with precious stones and jewels on January 14, 1651 during a procession that carried the Infant Jesus statue from the Lady of Victory church to other Prague churches. The Infant Jesus was solemnly coronated on April 4, 1655 by the Archbishop Josef Corta acting for Cardinal Harrach III who was sick."
    },
    {
      "type": "text",
      "value": "After that period, Prague went through more wars and unrest but the church and the Infant Jesus chapel was miraculously protected. In 1776 the altar was rebuilt using marble and two huge sculptures of the Blessed Virgin Mary and St. Joseph were placed to the left and right sides of the altar. The Holy Infant was kept in a glass case standing on a pedestal engraved with crystals, and surrounding the Infant were twenty angels in gold."
    },
    {
      "type": "text",
      "value": "Since then copies of the Infant Jesus were made and distributed throughout European churches. The Spanish colonial efforts later brought the Infant Jesus to the Philippines and to central America. And since then, the devotion has kept spreading to all parts of the world."
    },
    {
      "type": "text",
      "value": "PRAYER OF THANKSGIVING: Divine Infant Jesus, I know you love me and would never leave me. I thank you for your close presence in my life. Miraculous Infant, I believe in your promise of peace, blessings, and freedom from want. I place every need and care in your hands. Lord Jesus, may I always trust in your generous mercy and love. I want to honor and praise you, now and forever. Amen._"
    },
    {
      "type": "text",
      "value": "MARTYR"
    },
    {
      "type": "text",
      "value": "(23 April 1712 - 14 January 1752)"
    },
    {
      "type": "text",
      "value": "Devasahayam Pillai (named Neelakanda Pillai at birth) was born into an affluent Nair-caste family at Nattalam in the present-day Kanyakumari District, on 23 April 1712. In the Nair matriarchal traditions of the day, Devasahayam Pillai was raised by his maternal uncle, and was inculcated with Hindu beliefs and traditions early on."
    },
    {
      "type": "text",
      "value": "Devasahayam's family had much influence in the royal palace of Maharaja Marthanda Varma, king of Travancore, and Devasahayam went into the service of the royal palace as a young man. His capabilities and enthusiasm did not go unnoticed in the palace, as he was soon put in charge of state affairs as an official under Ramayyan Dalawa, the Dewan of Travancore."
    },
    {
      "type": "text",
      "value": "CONVERSION TO CHRISTIANITY: In 1741, Captain Eustachius De Lannoy, a Dutch naval commander, was sent on command of a Dutch naval expedition by the Dutch East India Company to capture Colachel, a port under the control of Travancore, and establish a trading post there. In the battle (Battle of Colachel) that followed between the Travancore forces and De Lannoy's men, the Dutch forces were defeated and the men were either killed or captured. Eustachius De Lannoy, his assistant Donadi and a few other Dutch soldiers were captured and imprisoned."
    },
    {
      "type": "text",
      "value": "De Lannoy and the Dutchmen were later pardoned by the king, on condition that they serve in the Travancore army. De Lannoy later earned the trust of the king and went on to become the commander of the Travancore armed forces, winning many battles and annexing various neighbouring territories to Travancore."
    },
    {
      "type": "text",
      "value": "It was during their influential roles under the King of Travancore that Devasahayam Pillai and De Lannoy became well acquainted. De Lannoy's Christian faith interested Devasahayam and De Lannoy enlightened him on the faith, leading to his conversion in 1745."
    },
    {
      "type": "text",
      "value": "BAPTISM: On Devasahayam's acceptance of the Christian faith, he was baptized at the Roman Catholic Latin Rite church at Vadakkankulam village (in the present Tirunelveli District of Tamil Nadu), where the Jesuits had a mission under Rev. Fr. R. Bouttari Italus S.J. Neelakanda Pillai, his name at birth, was then changed to Lazar, although he is more widely known by the Tamil & Malayalam translation Devasahayam (meaning God's help). Pillai was married by this time to Bargavi Ammal of Travancore. She was also persuaded and converted to Christianity by her husband. His wife was given the baptismal name of Gnanapoo Ammaal (equivalent to Theresa in Tamil & Malayalam). Fearing reprisal in Travancore against her religious conversion, she chose to be a migrated-resident of this village. Some of Devasahayam Pillai's immediate family members also received baptism later, after being converted to Christianity."
    },
    {
      "type": "text",
      "value": "Church chroniclers say that the Brahmin chief priest of the kingdom, the feudal lords, members of the royal household and the Nair community brought false charges on Devasahayam to the Dewan, Ramayyan Dalawa. Pillai was divested of his portfolio in the administration and was later accused of treason and of divulging state secrets to rivals and Europeans. He was later arrested and tortured for three years."
    },
    {
      "type": "text",
      "value": "OTHER TRADITIONS AND BELIEFS: Devasahayam Pillai was marched from Padmanabhapuram Palace to Aralvaimozhy by soldiers, over the period of a few days. Pillai was treated like a criminal and as was customary in those days for criminals, his body was painted with red and black spots, and was intentionally marched through populated areas, sitting backward on top of a water buffalo (the mythical vehicle or vahana of Yama, the lord of death in Hinduism) through the streets of South Travancore. As a method of torture, he was beaten every day with eighty stripes, pepper rubbed in his wounds and nostrils, exposed to the sun, and given only stagnant water to drink."
    },
    {
      "type": "text",
      "value": "While halting at Puliyoorkurichi, not far away from the Padmanabhapuram Palace of the Travancore king, it is believed by Christians that God quenched his thirst by letting water gush through a small hole on a rock, the very place where he knelt to pray. The water hole is still found in the compound of a church at Puliyoorkurichi, about 15 km from Nagercoil."
    },
    {
      "type": "text",
      "value": "It is also believed that the leaves of a neem (Margosa) tree in the village of Peruvilai, to which he had been tied while being marched to Aralvaimozhy, cured illnesses of sick people in the village and around. Many more miracles are attributed to Devasahayam Pillai."
    },
    {
      "type": "text",
      "value": "DEATH: In 1752, the original order of the King and his Dewan was to deport him from Travancore, into the Pandya country, at Aralvaimozhy. He was let off in the forested hills near Aralvaimozhy. There, he is believed to have begun deep meditations, and the people from the adjacent villages began visiting the holy man. Christian sources allege that at this time, high caste Hindus plotted to do away with Devasahayam."
    },
    {
      "type": "text",
      "value": "Some people believe that the soldiers went up the forested hills and tried to shoot Devasahayam, but were unable to fire; after which he took the gun in his hands, blessed it and gave it back to the soldiers to shoot him to death, if they wished to. The soldiers took the gun back and fired at him five times. His body was then carelessly thrown out near the foothills at Kattadimalai."
    },
    {
      "type": "text",
      "value": "It was at Kattadimali in Kanyakumari district that Devasahayam Pillai died on 14 January 1752. His mortal remains were interred near the altar inside St. Xavier's Church, Kottar, Nagercoil, which is now the diocesan Cathedral."
    },
    {
      "type": "text",
      "value": "Since the days of the interment of the mortal remains of Devesahayam Pillai many Christian pilgrims visited his tomb and offered prayers."
    },
    {
      "type": "text",
      "value": "BEATIFICATION AND DECLARATION AS A MARTYR: Devasahayam Pillai was declared a Martyr and Blessed on 2 December 2012, at a solemn ceremony held in the Diocese of Kottar at Carmel Higher Secondary School Grounds, Nagercoil, near the place of his burial. The Prefect of the Congregation for the Causes of Saints, Angelo Cardinal Amato presided at the function as Delegate of Pope Benedict XVI."
    },
    {
      "type": "text",
      "value": "On 21 February 2020, Pope Francis recognized a miracle attributed to the intercession of Devasahayam, clearing his way to canonization (sainthood). He was canonized as a saint of the church by Pope Francis on 15 May 2022."
    },
    {
      "type": "text",
      "value": "You set apart your whole life for preaching on the Kingdom of God, leaving behind all the worldly pleasures of wealth, status, name, fame and glory. You as a true Disciple of Christ faithfully put into practice the values of the Gospel, the equality and Fraternity of all people on earth."
    },
    {
      "type": "text",
      "value": "Assist us to follow you in leaving behind all the worldly pleasures and help us to live as children of the kingdom of God and put into practice faithfully the values of the Gospel so that we may one day enter into eternal life to be with God and your company forever and ever. Amen."
    },
    {
      "type": "text",
      "value": "O! St. Devasahayam, Glorious Martyr! Pray For Us!"
    },
    {
      "type": "heading",
      "value": "Prayer"
    },
    {
      "type": "text",
      "value": "St. Devasahayam, For the love of Christ you have willingly and patiently underwent torments and tortures for three years, and willingly sacrificed your life and obtained the joy of eternal life and the veneration at the alters as God's great reward. We praise and thank God for blessing you with this glorious life."
    }
  ],
  "source": "jesusreignsmarianmovement.faith",
  "lastUpdated": "2026-01-11T16:33:18.200Z"
}