{
  "date": "2026-01-25",
  "calendar": "general_roman",
  "source": "marian_calendar",
  "observance": {
    "title": "CONVERSION OF SAINT PAUL",
    "type": "saint",
    "rank": "memorial",
    "color": "white",
    "season": "Ordinary Time",
    "isSunday": true,
    "isTransferred": false
  },
  "saints": [
    "CONVERSION OF SAINT PAUL"
  ],
  "suppressedObservances": [],
  "summary": "St. Paul was born at Tarsus, Cilicia, of Jewish parents who were descended from the tribe of Benjamin. He was a Roman citizen from birth. As he was \"a young man\" at the stoning of Stephen and \"an old man\" when writing to Philemon, about the year 63, he was probably born around the beginning of the Christian era.",
  "blocks": [
    {
      "type": "heading",
      "value": "CONVERSION OF SAINT PAUL"
    },
    {
      "type": "text",
      "value": "SUNDAY, 25 JANUARY, 2026"
    },
    {
      "type": "text",
      "value": "St. Paul was born at Tarsus, Cilicia, of Jewish parents who were descended from the tribe of Benjamin. He was a Roman citizen from birth. As he was \"a young man\" at the stoning of Stephen and \"an old man\" when writing to Philemon, about the year 63, he was probably born around the beginning of the Christian era."
    },
    {
      "type": "text",
      "value": "To complete his schooling, St. Paul was sent to Jerusalem, where he sat at the feet of the learned Gamaliel and was educated in the strict observance of the ancestral Law. Here he also acquired a good knowledge of exegesis and was trained in the practice of disputation. As a convinced and zealous Pharisee, he returned to Tarsus before the public life of Christ opened in Palestine."
    },
    {
      "type": "text",
      "value": "Some time after the death of Our Lord, St. Paul returned to Palestine. His profound conviction made his zeal develop to a religious fanaticism against the infant Church. He took part in the stoning of the first martyr, St. Stephen, and in the fierce persecution of the Christians that followed."
    },
    {
      "type": "heading",
      "value": "Prayer"
    },
    {
      "type": "text",
      "value": "O God, who taught the whole world through the preaching of the blessed Apostle Paul, draw us, we pray, nearer to you through the example of him whose conversion we celebrate today, and so make us witnesses to your truth in the world. Through our Lord Jesus Christ, your Son, who lives and reigns with you in the unity of the Holy Spirit, one God, for ever and ever. Amen."
    }
  ],
  "lastUpdated": "2026-01-10T11:15:46.672Z"
}