{
  "date": "2025-01-24",
  "calendar": "general_roman",
  "source": "marian_calendar",
  "observance": {
    "title": "SAINT FRANCIS DE SALES",
    "type": "saint",
    "rank": "memorial",
    "color": "white",
    "season": "Ordinary Time",
    "isSunday": false,
    "isTransferred": false
  },
  "saints": [
    "SAINT FRANCIS DE SALES"
  ],
  "suppressedObservances": [],
  "summary": "Francis was born on August 21, 1567, and ordained to the priesthood in 1593. From 1594 to 1598 he labored at the difficult and dangerous task of preaching to the Protestants of Chablais and effected the return of some 70,000 souls to the Catholic faith. In 1602 he became bishop of Genf. His zeal for souls is attested in 21,000 extant letters and 4,000 sermons which exemplify how he applied St. Paul's words: \"I have become all things to all men.\" You may epitomize his character in two words, kindliness and lovableness — virtues that were the secret of his success. His writings reflect his kindheartedness and sweet disposition.",
  "blocks": [
    {
      "type": "heading",
      "value": "SAINT FRANCIS DE SALES"
    },
    {
      "type": "text",
      "value": "SATURDAY, 24 JANUARY, 2026"
    },
    {
      "type": "text",
      "value": "Francis was born on August 21, 1567, and ordained to the priesthood in 1593. From 1594 to 1598 he labored at the difficult and dangerous task of preaching to the Protestants of Chablais and effected the return of some 70,000 souls to the Catholic faith. In 1602 he became bishop of Genf. His zeal for souls is attested in 21,000 extant letters and 4,000 sermons which exemplify how he applied St. Paul's words: \"I have become all things to all men.\" You may epitomize his character in two words, kindliness and lovableness — virtues that were the secret of his success. His writings reflect his kindheartedness and sweet disposition."
    },
    {
      "type": "text",
      "value": "Most widely known is the saint's Introduction to the Devout Life, which, with the Imitation of Christ, is rightly considered the finest outline of Christian perfection. Francis' Introduction proves to the world that true piety makes persons amiable, lovable and happy. A renowned and holy friendship existed between him and St. Frances de Chantal. In cooperation with her he founded the Visitation Nuns in 1610. Out of love for his own poor diocese, he refused opportunities for advancement, including the cardinalate. In recognition of the Introduction and his other writings, Francis has been declared a doctor of the Church."
    },
    {
      "type": "text",
      "value": "How Francis developed a gentle and amiable disposition is a story in itself; he was not born a saint. By nature his temperament was choleric, fiery; little was needed to throw him into a state of violent anger. It took years before he mastered his impatience, his unruly temper. Even after he became bishop, there were slips, as for instance, when someone rang a bell before he had finished preaching. The important point, of course, is that by constant perseverance he did in time attain perfect self-mastery. Wherein lies a lesson."
    },
    {
      "type": "heading",
      "value": "Prayer"
    },
    {
      "type": "text",
      "value": "O God, who for the salvation of souls willed that the Bishop Saint Francis de Sales become all things to all, graciously grant that, following his example, we may always display the gentleness of your charity in the service of our neighbor. Through our Lord Jesus Christ, your Son, who lives and reigns with you in the unity of the Holy Spirit, one God, for ever and ever. Amen."
    }
  ],
  "lastUpdated": "2026-01-10T10:37:25.081Z"
}