{
  "date": "2025-01-18",
  "calendar": "general_roman",
  "source": "marian_calendar",
  "observance": {
    "title": "SAINT PRISCA OF ROME",
    "type": "saint",
    "rank": "memorial",
    "color": "white",
    "season": "Ordinary Time",
    "isSunday": false,
    "isTransferred": false
  },
  "saints": [
    "SAINT PRISCA OF ROME"
  ],
  "suppressedObservances": [],
  "summary": "Prisca, who is also known as Priscilla, was a child martyr of the early Roman Church. Born to Christian parents of a noble family, Prisca was raised during the reign of the Roman emperor Claudius. While Claudius did not persecute Christians with the same fervor as other Roman emperors, Christians still did not practice their faith openly. In fact, Prisca's parents went to great lengths to conceal their faith, and thus they were not suspected of being Christians.",
  "blocks": [
    {
      "type": "heading",
      "value": "SAINT PRISCA OF ROME"
    },
    {
      "type": "text",
      "value": "SUNDAY, 18 JANUARY, 2026"
    },
    {
      "type": "text",
      "value": "Prisca, who is also known as Priscilla, was a child martyr of the early Roman Church. Born to Christian parents of a noble family, Prisca was raised during the reign of the Roman emperor Claudius. While Claudius did not persecute Christians with the same fervor as other Roman emperors, Christians still did not practice their faith openly. In fact, Prisca's parents went to great lengths to conceal their faith, and thus they were not suspected of being Christians."
    },
    {
      "type": "text",
      "value": "Prisca, however, did not feel the need to take precaution. The young girl openly professed her dedication to Christ, and eventually, she was reported to the emperor. Claudius had her arrested, and commanded her to make a sacrifice to Apollo, the pagan god of the sun."
    },
    {
      "type": "text",
      "value": "According to the legend, Prisca refused, and was tortured for disobeying. Then, suddenly, a bright, yellow light shone about her, and she appeared to be a little star."
    },
    {
      "type": "heading",
      "value": "Prayer"
    },
    {
      "type": "text",
      "value": "Grant, we pray You, almighty God, that as we celebrate the heavenly birthday of blessed Prisca, your virgin and martyr, so we may rejoice in her annual festival and profit by the example of her great faith. Through our Lord Jesus Christ, Your Son, who being God, lives and reigns with you in the unity of the Holy Spirit, for ever and ever. Amen."
    }
  ],
  "lastUpdated": "2026-01-10T10:37:17.997Z"
}