{
  "date": "2026-05-28",
  "url": "https://www.catholicgallery.org/mass-reading/280526/",
  "title": "Daily Mass Readings for Thursday, 28 May 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Peter 2: 2-5, 9-12",
      "reference": "First Peter 2: 2-5, 9-12",
      "verses": [
        "2 As newborn babes, desire the rational milk without guile, that thereby you may grow unto salvation:",
        "3 If so be you have tasted that the Lord is sweet.",
        "4 Unto whom coming, as to a living stone, rejected indeed by men, but chosen and made honourable by God:",
        "5 Be you also as living stones built up, a spiritual house, a holy priesthood, to offer up spiritual sacrifices, acceptable to God by Jesus Christ.",
        "9 But you are a chosen generation, a kingly priesthood, a holy nation, a purchased people: that you may declare his virtues, who hath called you out of darkness into his marvellous light:",
        "10 Who in time past were not a people: but are now the people of God. Who had not obtained mercy; but now have obtained mercy.",
        "11 Dearly beloved, I beseech you as strangers and pilgrims, to refrain yourselves from carnal desires which war against the soul,",
        "12 Having your conversation good among the Gentiles: that whereas they speak against you as evildoers, they may, by the good works, which they shall behold in you, glorify God in the day of visitation."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 100: 2, 3, 4, 5",
      "reference": "Psalms 100: 2, 3, 4, 5",
      "verses": [
        "R. (2c) Come with joy into the presence of the Lord.",
        "2 Sing joyfully to God, all the earth: serve ye the Lord with gladness. Come in before his presence with exceeding great joy.",
        "R. Come with joy into the presence of the Lord.",
        "3 Know ye that the Lord he is God: he made us, and not we ourselves. We are his people and the sheep of his pasture.",
        "R. Come with joy into the presence of the Lord.",
        "4 Go ye into his gates with praise, into his courts with hymns: and give glory to him. Praise ye his name:",
        "R. Come with joy into the presence of the Lord.",
        "5 For the Lord is sweet, his mercy endureth for ever, and his truth to generation and generation.",
        "R. Come with joy into the presence of the Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 8: 12",
      "reference": "John 8: 12",
      "verses": [
        "R. Alleluia, alleluia.",
        "12 I am the light of the world, says the Lord; whoever follows me will have the light of life.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 10: 46-52",
      "reference": "Mark 10: 46-52",
      "verses": [
        "46 And they came to Jericho: and as he went out of Jericho, with his disciples, and a very great multitude, Bartimeus the blind man, the son of Timeus, sat by the way side begging.",
        "47 Who when he had heard, that it was Jesus of Nazareth, began to cry out, and to say: Jesus son of David, have mercy on me.",
        "48 And many rebuked him, that he might hold his peace; but he cried a great deal the more: Son of David, have mercy on me.",
        "49 And Jesus, standing still, commanded him to be called. And they call the blind man, saying to him: Be of better comfort: arise, he calleth thee.",
        "50 Who casting off his garment leaped up, and came to him.",
        "51 And Jesus answering, said to him: What wilt thou that I should do to thee? And the blind man said to him: Rabboni, that I may see.",
        "52 And Jesus saith to him: Go thy way, thy faith hath made thee whole. And immediately he saw, and followed him in the way."
      ]
    }
  ]
}