{
  "date": "2026-05-26",
  "url": "https://www.catholicgallery.org/mass-reading/260526/",
  "title": "Daily Mass Readings for Tuesday, 26 May 2026",
  "feast": "Philip Neri, Priest Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Peter 1: 10-16",
      "reference": "First Peter 1: 10-16",
      "verses": [
        "10 Of which salvation the prophets have inquired and diligently searched, who prophesied of the grace to come in you.",
        "11 Searching what or what manner of time the Spirit of Christ in them did signify: when it foretold those sufferings that are in Christ, and the glories that should follow:",
        "12 To whom it was revealed, that not to themselves, but to you they ministered those things which are now declared to you by them that have preached the gospel to you, the Holy Ghost being sent down from heaven, on whom the angels desire to look.",
        "13 Wherefore having the loins of your mind girt up, being sober, trust perfectly in the grace which is offered you in the revelation of Jesus Christ,",
        "14 As children of obedience, not fashioned according to the former desires of your ignorance:",
        "15 But according to him that hath called you, who is holy, be you also in all manner of conversation holy:",
        "16 Because it is written: You shall be holy, for I am holy."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 98: 1, 2-3ab, 3cd-4",
      "reference": "Psalms 98: 1, 2-3ab, 3cd-4",
      "verses": [
        "R. (2a) The Lord has made known his salvation.",
        "1 Sing ye to the Lord anew canticle: because he hath done wonderful things. His right hand hath wrought for him salvation, and his arm is holy.",
        "R. The Lord has made known his salvation.",
        "2 The Lord hath made known his salvation: he hath revealed his justice in the sight of the Gentiles.",
        "3ab He hath remembered his mercy his truth toward the house of Israel.",
        "R. The Lord has made known his salvation.",
        "3cd All the ends of the earth have seen the salvation of our God.",
        "4 Sing joyfully to God, all the earth; make melody, rejoice and sing.",
        "R. The Lord has made known his salvation."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 11: 25",
      "reference": "Matthew 11: 25",
      "verses": [
        "R. Alleluia, alleluia.",
        "25 Blessed are you, Father, Lord of heaven and earth; you have revealed to little ones the mysteries of the Kingdom.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 10: 28-31",
      "reference": "Mark 10: 28-31",
      "verses": [
        "28 And Peter began to say unto him: Behold, we have left all things, and have followed thee.",
        "29 Jesus answering, said: Amen I say to you, there is no man who hath left house or brethren, or sisters, or father, or mother, or children, or lands, for my sake and for the gospel,",
        "30 Who shall not receive an hundred times as much, now in this time; houses, and brethren, and sisters, and mothers, and children, and lands, with persecutions: and in the world to come life everlasting.",
        "31 But many that are first, shall be last: and the last, first."
      ]
    }
  ]
}