{
  "date": "2026-05-12",
  "url": "https://www.catholicgallery.org/mass-reading/120526/",
  "title": "Daily Mass Readings for Tuesday, 12 May 2026",
  "feast": "Easter Weekday/ Nereus and Achilleus, Martyrs/ Pancras, Martyr",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 16: 22-34",
      "reference": "Acts 16: 22-34",
      "verses": [
        "22 And the people ran together against them; and the magistrates rending off their clothes, commanded them to be beaten with rods.",
        "23 And when they had laid many stripes upon them, they cast them into prison, charging the gaoler to keep them diligently.",
        "24 Who having received such a charge, thrust them into the inner prison, and made their feet fast in the stocks.",
        "25 And at midnight, Paul and Silas praying, praised God. And they that were in prison, heard them.",
        "26 And suddenly there was a great earthquake, so that the foundations of the prison were shaken. And immediately all the doors were opened, and the bands of all were loosed.",
        "27 And the keeper of the prison, awaking out of his sleep, and seeing the doors of the prison open, drawing his sword, would have killed himself, supposing that the prisoners had been fled.",
        "28 But Paul cried with a loud voice, saying: Do thyself no harm, for we all are here.",
        "29 Then calling for a light, he went in, and trembling, fell down at the feet of Paul and Silas.",
        "30 And bringing them out, he said: Masters, what must I do, that I may be saved?",
        "31 But they said: Believe in the Lord Jesus, and thou shalt be saved, and thy house.",
        "32 And they preached the word of the Lord to him and to all that were in his house.",
        "33 And he, taking them the same hour of the night, washed their stripes, and himself was baptized, and all his house immediately.",
        "34 And when he had brought them into his own house, he laid the table for them, and rejoiced with all his house, believing God."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 138: 1-2ab, 2cde-3, 7c-8",
      "reference": "Psalms 138: 1-2ab, 2cde-3, 7c-8",
      "verses": [
        "R. (7c) Your right hand saves me, O Lord.",
        "or",
        "R. Alleluia.",
        "1 I will praise thee, O lord, with my whole heart: for thou hast heard the words of my mouth. I will sing praise to thee in the sight of his angels:",
        "2ab I will worship towards thy holy temple, and I will give glory to thy name.",
        "R. Your right hand saves me, O Lord.",
        "or",
        "R. Alleluia.",
        "2cde For thy mercy, and for thy truth: for thou hast magnified thy holy name above all.",
        "3 In what day soever I shall call upon thee, hear me: thou shall multiply strength in my soul.",
        "R. Your right hand saves me, O Lord.",
        "or",
        "R. Alleluia.",
        "7c Thy right hand hath saved me.",
        "8 The Lord will repay for me: thy mercy, O Lord, endureth for ever: O despise not the work of thy hands.",
        "R. Your right hand saves me, O Lord.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 16: 7, 13",
      "reference": "John 16: 7, 13",
      "verses": [
        "R. Alleluia, alleluia.",
        "7, 13 I will send to you the Spirit of truth, says the Lord; he will guide you to all truth.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 16: 5-11",
      "reference": "John 16: 5-11",
      "verses": [
        "5 But I told you not these things from the beginning, because I was with you. And now I go to him that sent me, and none of you asketh me: Whither goest thou?",
        "6 But because I have spoken these things to you, sorrow hath filled your heart.",
        "7 But I tell you the truth: it is expedient to you that I go: for if I go not, the Paraclete will not come to you; but if I go, I will send him to you.",
        "8 And when he is come, he will convince the world of sin, and of justice, and of judgment.",
        "9 Of sin: because they believed not in me.",
        "10 And of justice: because I go to the Father; and you shall see me no longer.",
        "11 And of judgment: because the prince of this world is already judged."
      ]
    }
  ]
}