{
  "date": "2026-05-09",
  "url": "https://www.catholicgallery.org/mass-reading/090526/",
  "title": "Daily Mass Readings for Saturday, 9 May 2026",
  "feast": "Easter Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 16: 1-10",
      "reference": "Acts 16: 1-10",
      "verses": [
        "1 And he came to Derbe and Lystra. And behold, there was a certain disciple there named Timothy, the son of a Jewish woman that believed; but his father was a Gentile.",
        "2 To this man the brethren that were in Lystra and Iconium, gave a good testimony.",
        "3 Him Paul would have to go along with him: and taking him he circumcised him, because of the Jews who were in those places. For they all knew that his father was a Gentile.",
        "4 And as they passed through the cities, they delivered unto them the decrees for to keep, that were decreed by the apostles and ancients who were at Jerusalem.",
        "5 And the churches were confirmed in faith, and increased in number daily.",
        "6 And when they had passed through Phrygia, and the country of Galatia, they were forbidden by the Holy Ghost to preach the word in Asia.",
        "7 And when they were come into Mysia, they attempted to go into Bythynia, and the Spirit of Jesus suffered them not.",
        "8 And when they had passed through Mysia, they went down to Troas.",
        "9 And a vision was shewed to Paul in the night, which was a man of Macedonia standing and beseeching him, and saying: Pass over into Macedonia, and help us.",
        "10 And as soon as he had seen the vision, immediately we sought to go into Macedonia, being assured that God had called us to preach the gospel to them."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 100: 2, 3, 5",
      "reference": "Psalms 100: 2, 3, 5",
      "verses": [
        "R. (2a) Let all the earth cry out to God with joy.",
        "or",
        "R. Alleluia.",
        "2 Sing joyfully to God, all the earth: serve ye the Lord with gladness. Come in before his presence with exceeding great joy.",
        "R. Let all the earth cry out to God with joy.",
        "or",
        "R. Alleluia.",
        "3 Know ye that the Lord he is God: he made us, and not we ourselves. We are his people and the sheep of his pasture.",
        "R. Let all the earth cry out to God with joy.",
        "or",
        "R. Alleluia.",
        "5 For the Lord is sweet, his mercy endureth for ever, and his truth to generation and generation.",
        "R. Let all the earth cry out to God with joy.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Colossians 3: 1",
      "reference": "Colossians 3: 1",
      "verses": [
        "R. Alleluia, alleluia.",
        "1 If then you were raised with Christ, seek what is above, where Christ is seated at the right hand of God.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 15: 18-21",
      "reference": "John 15: 18-21",
      "verses": [
        "18 If the world hate you, know ye, that it hath hated me before you.",
        "19 If you had been of the world, the world would love its own: but because you are not of the world, but I have chosen you out of the world, therefore the world hateth you.",
        "20 Remember my word that I said to you: The servant is not greater than his master. If they have persecuted me, they will also persecute you: if they have kept my word, they will keep yours also.",
        "21 But all these things they will do to you for my name’s sake: because they know not him who sent me."
      ]
    }
  ]
}