{
  "date": "2026-05-22",
  "url": "https://www.catholicgallery.org/mass-reading/220526/",
  "title": "Daily Mass Readings for Friday, 22 May 2026",
  "feast": "Easter Weekday/ Rita of Cascia, Religious",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 25: 13b-21",
      "reference": "Acts 25: 13b-21",
      "verses": [
        "13b King Agrippa and Bernice came down to Caesarea to salute Festus.",
        "14 And as they tarried there many days, Festus told the king of Paul, saying: A certain man was left prisoner by Felix.",
        "15 About whom, when I was at Jerusalem, the chief priests, and the ancients of the Jews, came unto me, desiring condemnation against him.",
        "16 To whom I answered: It is not the custom of the Romans to condemn any man, before that he who is accused have his accusers present, and have liberty to make his answer, to clear himself of the things laid to his charge.",
        "17 When therefore they were come hither, without any delay, on the day following, sitting in the judgment seat, I commanded the man to be brought.",
        "18 Against whom, when the accusers stood up, they brought no accusation of things which I thought ill of:",
        "19 But had certain questions of their own superstition against him, and of one Jesus deceased, whom Paul affirmed to be alive.",
        "20 I therefore being in a doubt of this manner of question, asked him whether he would go to Jerusalem, and there be judged of these things.",
        "21 But Paul appealing to be reserved unto the hearing of Augustus, I commanded him to be kept, till I might send him to Caesar."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 103: 1-2, 11-12, 19-20ab",
      "reference": "Psalms 103: 1-2, 11-12, 19-20ab",
      "verses": [
        "R. (19a) The Lord has established his throne in heaven.",
        "or",
        "R. Alleluia.",
        "1 Bless the Lord, O my soul: and let all that is within me bless his holy name.",
        "2 Bless the Lord, O my soul, and never forget all he hath done for thee.",
        "R. The Lord has established his throne in heaven.",
        "or",
        "R. Alleluia.",
        "11 For according to the height of the heaven above the earth: he hath strengthened his mercy towards them that fear him.",
        "12 As far as the east is from the west, so far hath he removed our iniquities from us.",
        "R. The Lord has established his throne in heaven.",
        "or",
        "R. Alleluia.",
        "19 The Lord hath prepared his throne in heaven: and his kingdom shall rule over all.",
        "20ab Bless the Lord, all ye his angels: you that are mighty in strength, and execute his word.",
        "R. The Lord has established his throne in heaven.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 26",
      "reference": "John 14: 26",
      "verses": [
        "R. Alleluia, alleluia.",
        "26 The Holy Spirit will teach you everything and remind you of all I told you.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 21: 15-19",
      "reference": "John 21: 15-19",
      "verses": [
        "15 When therefore they had dined, Jesus saith to Simon Peter: Simon son of John, lovest thou me more than these? He saith to him: Yea, Lord, thou knowest that I love thee. He saith to him: Feed my lambs.",
        "16 He saith to him again: Simon, son of John, lovest thou me? He saith to him: Yea, Lord, thou knowest that I love thee. He saith to him: Feed my lambs.",
        "17 He said to him the third time: Simon, son of John, lovest thou me? Peter was grieved, because he had said to him the third time: Lovest thou me? And he said to him: Lord, thou knowest all things: thou knowest that I love thee. He said to him: Feed my sheep.",
        "18 Amen, amen I say to thee, when thou wast younger, thou didst gird thyself, and didst walk where thou wouldst. But when thou shalt be old, thou shalt stretch forth thy hands, and another shall gird thee, and lead thee whither thou wouldst not.",
        "19 And this he said, signifying by what death he should glorify God. And when he had said this, he saith to him: Follow me."
      ]
    }
  ]
}