{
  "date": "2026-05-10",
  "url": "https://www.catholicgallery.org/mass-reading/100526/",
  "title": "Daily Mass Readings for Sunday, 10 May 2026",
  "feast": "Sixth Sunday of Easter",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 8: 5-8, 14-17",
      "reference": "Acts 8: 5-8, 14-17",
      "verses": [
        "5 And Philip going down to the city of Samaria, preached Christ unto them.",
        "6 And the people with one accord were attentive to those things which were said by Philip, hearing, and seeing the miracles which he did.",
        "7 For many of them who had unclean spirits, crying with a loud voice, went out.",
        "8 And many, taken with the palsy, and that were lame, were healed.",
        "14 Now when the apostles, who were in Jerusalem, had heard that Samaria had received the word of God, they sent unto them Peter and John.",
        "15 Who, when they were come, prayed for them, that they might receive the Holy Ghost.",
        "16 For he was not as yet come upon any of them; but they were only baptized in the name of the Lord Jesus.",
        "17 Then they laid their hands upon them, and they received the Holy Ghost."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 66: 1-3, 4-5, 6-7, 16, 20",
      "reference": "Psalms 66: 1-3, 4-5, 6-7, 16, 20",
      "verses": [
        "R. (1) Let all the earth cry out to God with joy.",
        "or",
        "R. Alleluia.",
        "1 Shout with joy to God, all the earth,",
        "2 Sing ye a psalm to his name; give glory to his praise.",
        "3 Say unto God, How terrible are thy works, O Lord!",
        "R. Let all the earth cry out to God with joy.",
        "or",
        "R. Alleluia.",
        "4 Let all the earth adore thee, and sing to thee: let it sing a psalm to thy name.",
        "5 Come and see the works of God; who is terrible in his counsels over the sons of men.",
        "R. Let all the earth cry out to God with joy.",
        "or",
        "R. Alleluia.",
        "6 Who turneth the sea into dry land, in the river they shall pass on foot: there shall we rejoice in him.",
        "7 Who by his power ruleth for ever: his eyes behold the nations; let not them that provoke him he exalted in themselves.",
        "R. Let all the earth cry out to God with joy.",
        "or",
        "R. Alleluia.",
        "16 Come and hear, all ye that fear God, and I will tell you what great things he hath done for my soul.",
        "20 Blessed be God, who hath not turned away my prayer, nor his mercy from me.",
        "R. Let all the earth cry out to God with joy.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First Peter 3: 15-18",
      "reference": "First Peter 3: 15-18",
      "verses": [
        "15 But sanctify the Lord Christ in your hearts, being ready always to satisfy every one that asketh you a reason of that hope which is in you.",
        "16 But with modesty and fear, having a good conscience: that whereas they speak evil of you, they may be ashamed who falsely accuse your good conversation in Christ.",
        "17 For it is better doing well (if such be the will of God) to suffer, than doing ill.",
        "18 Because Christ also died once for our sins, the just for the unjust: that he might offer us to God, being put to death indeed in the flesh, but enlivened in the spirit,"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 23",
      "reference": "John 14: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Whoever loves me will keep my word, says the Lord, and my Father will love him and we will come to him.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 14: 15-21",
      "reference": "John 14: 15-21",
      "verses": [
        "15 If you love me, keep my commandments.",
        "16 And I will ask the Father, and he shall give you another Paraclete, that he may abide with you for ever.",
        "17 The spirit of truth, whom the world cannot receive, because it seeth him not, nor knoweth him: but you shall know him; because he shall abide with you, and shall be in you.",
        "18 I will not leave you orphans, I will come to you.",
        "19 Yet a little while: and the world seeth me no more. But you see me: because I live, and you shall live.",
        "20 In that day you shall know, that I am in my Father, and you in me, and I in you.",
        "21 He that hath my commandments, and keepeth them; he it is that loveth me. And he that loveth me, shall be loved of my Father: and I will love him, and will manifest myself to him."
      ]
    }
  ]
}