{
  "date": "2026-05-15",
  "url": "https://www.catholicgallery.org/mass-reading/150526/",
  "title": "Daily Mass Readings for Friday, 15 May 2026",
  "feast": "Easter Weekday/ Isidore the Farmer, Married Man",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 18: 9-18",
      "reference": "Acts 18: 9-18",
      "verses": [
        "9 And the Lord said to Paul in the night, by a vision: Do not fear, but speak; and hold not thy peace,",
        "10 Because I am with thee: and no man shall set upon thee, to hurt thee; for I have much people in this city.",
        "11 And he stayed there a year and six months, teaching among them the word of God.",
        "12 But when Gallio was proconsul of Achaia, the Jews with one accord rose up against Paul, and brought him to the judgment seat,",
        "13 Saying: This man persuadeth men to worship God contrary to the law.",
        "14 And when Paul was beginning to open his mouth, Gallio said to the Jews: If it were some matter of injustice, or an heinous deed, O Jews, I should with reason bear with you.",
        "15 But if they be questions of word and names, and of your law, look you to it: I will not be judge of such things.",
        "16 And he drove them from the judgment seat.",
        "17 And all laying hold on Sosthenes, the ruler of the synagogue, beat him before the judgment seat; and Gallio cared for none of those things.",
        "18 But Paul, when he had stayed yet many days, taking his leave of the brethren, sailed thence into Syria (and with him Priscilla and Aquila), having shorn his head in Cenchrae: for he had a vow."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 47: 2-3, 4-5, 6-7",
      "reference": "Psalms 47: 2-3, 4-5, 6-7",
      "verses": [
        "R. (8a) God is king of all the earth.",
        "or",
        "R. Alleluia.",
        "2 O clap your hands, all ye nations: shout unto God with the voice of Joy,",
        "3 For the Lord is high, terrible: a great king over all the earth.",
        "R. God is king of all the earth.",
        "or",
        "R. Alleluia.",
        "4 He hath subdued the people under us; and the nations under our feet.",
        "5 He hath chosen for us his inheritance the beauty of Jacob which he hath loved.",
        "R. God is king of all the earth.",
        "or",
        "R. Alleluia.",
        "6 God is ascended with jubilee, and the Lord with the sound of trumpet.",
        "7 Sing praises to our God, sing ye: sing praises to our king, sing ye.",
        "R. God is king of all the earth.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 24: 46, 26",
      "reference": "Luke 24: 46, 26",
      "verses": [
        "R. Alleluia, alleluia.",
        "46, 26 Christ had to suffer and to rise from the dead, and so enter into his glory.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 16: 20-23",
      "reference": "John 16: 20-23",
      "verses": [
        "20 Amen, amen I say to you, that you shall lament and weep, but the world shall rejoice; and you shall be made sorrowful, but your sorrow shall be turned into joy.",
        "21 A woman, when she is in labour, hath sorrow, because her hour is come; but when she hath brought forth the child, she remembereth no more the anguish, for joy that a man is born into the world.",
        "22 So also you now indeed have sorrow; but I will see you again, and your heart shall rejoice; and your joy no man shall take from you.",
        "23 And in that day you shall not ask me any thing. Amen, amen I say to you: if you ask the Father any thing in my name, he will give it you."
      ]
    }
  ]
}