{
  "date": "2026-05-30",
  "url": "https://www.catholicgallery.org/mass-reading/300526/",
  "title": "Daily Mass Readings for Saturday, 30 May 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Jude 1: 17, 20b-25",
      "reference": "Jude 1: 17, 20b-25",
      "verses": [
        "17 But you, my dearly beloved, be mindful of the words which have been spoken before by the apostles of our Lord Jesus Christ,",
        "20b Building yourselves upon your most holy faith, praying in the Holy Ghost,",
        "21 Keep yourselves in the love of God, waiting for the mercy of our Lord Jesus Christ, unto life everlasting.",
        "22 And some indeed reprove, being judged:",
        "23 But others save, pulling them out of the fire. And on others have mercy, in fear, hating also the spotted garment which is carnal.",
        "24 Now to him who is able to preserve you without sin, and to present you spotless before the presence of his glory with exceeding joy, in the coming of our Lord Jesus Christ,",
        "25 To the only God our Saviour through Jesus Christ our Lord, be glory and magnificence, empire and power, before all ages, and now, and for all ages of ages. Amen."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 63: 2, 3-4, 5-6",
      "reference": "Psalms 63: 2, 3-4, 5-6",
      "verses": [
        "R. (2b) My soul is thirsting for you, O Lord my God.",
        "2 O God, my God, to thee do I watch at break of day. For thee my soul hath thirsted; for thee my flesh, O how many ways!",
        "R. My soul is thirsting for you, O Lord my God.",
        "3 In a desert land, and where there is no way, and no water: so in the sanctuary have I come before thee, to see thy power and thy glory.",
        "4 For thy mercy is better than lives: thee my lips shall praise.",
        "R. My soul is thirsting for you, O Lord my God.",
        "5 Thus will I bless thee all my life long: and in thy name I will lift up my hands.",
        "6 Let my soul be filled as with marrow and fatness: and my mouth shall praise thee with joyful lips.",
        "R. My soul is thirsting for you, O Lord my God."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Colossians 3: 16a, 17c",
      "reference": "Colossians 3: 16a, 17c",
      "verses": [
        "R. Alleluia, alleluia.",
        "16a, 17c Let the word of Christ dwell in you richly; giving thanks to God the Father through him.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 11: 27-33",
      "reference": "Mark 11: 27-33",
      "verses": [
        "27 And they come again to Jerusalem. And when he was walking in the temple, there come to him the chief priests and the scribes and the ancients,",
        "28 And they say to him: By what authority dost thou these things? and who hath given thee this authority that thou shouldst do these things?",
        "29 And Jesus answering, said to them: I will also ask you one word, and answer you me, and I will tell you by what authority I do these things.",
        "30 The baptism of John, was it from heaven, or from men? Answer me.",
        "31 But they thought with themselves, saying: If we say, From heaven; he will say, Why then did you not believe him?",
        "32 If we say, From men, we fear the people. For all men counted John that he was a prophet indeed.",
        "33 And they answering, say to Jesus: We know not. And Jesus answering, saith to them: Neither do I tell you by what authority I do these things."
      ]
    }
  ]
}