{
  "date": "2026-05-31",
  "url": "https://www.catholicgallery.org/mass-reading/310526/",
  "title": "Daily Mass Readings for Sunday, 31 May 2026",
  "feast": "The Holy Trinity Solemnity",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Exodus 34: 4b-6, 8-9",
      "reference": "Exodus 34: 4b-6, 8-9",
      "verses": [
        "4b Rising very early he went up into the mount Sinai, as the Lord had commanded him, carrying with him the tables.",
        "5 And when the Lord was come down in a cloud, Moses stood with him, calling upon the name of the Lord.",
        "6 And when he passed before him, he said: O the Lord, the Lord God, merciful and gracious, patient and of much compassion, and true,",
        "8 And Moses making haste, bowed down prostrate unto the earth, and adoring,",
        "9 Said: If I have found grace in thy sight: O Lord, I beseech thee, that thou wilt go with us, (for it is a stiffnecked people,) and take away our iniquities and sin, and possess us."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Daniel 3: 52, 53, 54, 55, 56",
      "reference": "Daniel 3: 52, 53, 54, 55, 56",
      "verses": [
        "R. (52b) Glory and praise for ever!",
        "52 Blessed art thou, O Lord the God of our fathers: and worthy to be praised, and glorified, and exalted above all for ever: and blessed is the holy name of thy glory: and worthy to be praised, and exalted above all in all ages.",
        "R. Glory and praise for ever!",
        "53 Blessed art thou in the holy temple of thy glory: and exceedingly to be praised, and exceeding glorious for ever.",
        "R. Glory and praise for ever!",
        "54 Blessed art thou on the throne of thy kingdom, and exceedingly to be praised, and exalted above all for ever.",
        "R. Glory and praise for ever!",
        "55 Blessed art thou, that beholdest the depths, and sittest upon the cherubims: and worthy to be praised and exalted above all for ever.",
        "R. Glory and praise for ever!",
        "56 Blessed art thou in the firmament of heaven: and worthy of praise, and glorious for ever.",
        "R. Glory and praise for ever!"
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Second Corinthians 13: 11-13",
      "reference": "Second Corinthians 13: 11-13",
      "verses": [
        "11 For the rest, brethren, rejoice, be perfect, take exhortation, be of one mind, have peace; and the God of peace and of love shall be with you.",
        "12 Salute one another with a holy kiss. All the saints salute you.",
        "13 The grace of our Lord Jesus Christ, and the charity of God, and the communication of the Holy Ghost be with you all. Amen."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Revelation 1: 8",
      "reference": "Revelation 1: 8",
      "verses": [
        "R. Alleluia, alleluia.",
        "8 Glory to the Father, the Son, and the Holy Spirit; to God who is, who was, and who is to come.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 3: 16-18",
      "reference": "John 3: 16-18",
      "verses": [
        "16 For God so loved the world, as to give his only begotten Son; that whosoever believeth in him, may not perish, but may have life everlasting.",
        "17 For God sent not his Son into the world, to judge the world, but that the world may be saved by him.",
        "18 He that believeth in him is not judged. But he that doth not believe, is already judged: because he believeth not in the name of the only begotten Son of God."
      ]
    }
  ]
}