{
  "date": "2026-05-29",
  "url": "https://www.catholicgallery.org/mass-reading/290526/",
  "title": "Daily Mass Readings for Friday, 29 May 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Peter 4:  7-13",
      "reference": "First Peter 4: 7-13",
      "verses": [
        "7 But the end of all is at hand. Be prudent therefore, and watch in prayers.",
        "8 But before all things have a constant mutual charity among yourselves: for charity covereth a multitude of sins.",
        "9 Using hospitality one towards another, without murmuring,",
        "10 As every man hath received grace, ministering the same one to another: as good stewards of the manifold grace of God.",
        "11 If any man speak, let him speak, as the words of God. If any man minister, let him do it, as of the power, which God administereth: that in all things God may be honoured through Jesus Christ: to whom is glory and empire for ever and ever. Amen.",
        "12 Dearly beloved, think not strange the burning heat which is to try you, as if some new thing happened to you;",
        "13 But if you partake of the sufferings of Christ, rejoice that when his glory shall be revealed, you may also be glad with exceeding joy."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 96: 10, 11-12, 13",
      "reference": "Psalms 96: 10, 11-12, 13",
      "verses": [
        "R. (13b) The Lord comes to judge the earth.",
        "10 Say ye among the Gentiles, the Lord hath reigned. For he hath corrected the world, which shall not be moved: he will judge the people with justice.",
        "R. The Lord comes to judge the earth.",
        "11 Let the heavens rejoice, and let the earth be glad, let the sea be moved, and the fulness thereof:",
        "12 The fields and all things that are in them shall be joyful. Then shall all the trees of the woods rejoice",
        "R. The Lord comes to judge the earth.",
        "13 Before the face of the Lord, because he cometh: because he cometh to judge the earth. He shall judge the world with justice, and the people with his truth.",
        "R. The Lord comes to judge the earth."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 15: 16",
      "reference": "John 15: 16",
      "verses": [
        "R. Alleluia, alleluia.",
        "16 I have chosen you; and have appointed you, that you should go, and should bring forth fruit; and your fruit should remain.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 11: 11-26",
      "reference": "Mark 11: 11-26",
      "verses": [
        "11 And he entered into Jerusalem, into the temple: and having viewed all things round about, when now the eventide was come, he went out to Bethania with the twelve.",
        "12 And the next day when they came out from Bethania, he was hungry.",
        "13 And when he had seen afar off a fig tree having leaves, he came if perhaps he might find any thing on it. And when he was come to it, he found nothing but leaves. For it was not the time for figs.",
        "14 And answering he said to it: May no man hereafter eat fruit of thee any more for ever. And his disciples heard it.",
        "15 And they came to Jerusalem. And when he was entered into the temple, he began to cast out them that sold and bought in the temple, and overthrew the tables of the moneychangers, and the chairs of them that sold doves.",
        "16 And he suffered not that any man should carry a vessel through the temple;",
        "17 And he taught, saying to them: Is it not written, My house shall be called the house of prayer to all nations? But you have made it a den of thieves.",
        "18 Which when the chief priests and the scribes had heard, they sought how they might destroy him. For they feared him, because the whole multitude was in admiration at his doctrine.",
        "19 And when evening was come, he went forth out of the city.",
        "20 And when they passed by in the morning they saw the fig tree dried up from the roots.",
        "21 And Peter remembering, said to him: Rabbi, behold the fig tree, which thou didst curse, is withered away.",
        "22 And Jesus answering, saith to them: Have the faith of God.",
        "23 Amen I say to you, that whosoever shall say to this mountain, Be thou removed and be cast into the sea, and shall not stagger in his heart, but believe, that whatsoever he saith shall be done; it shall be done unto him.",
        "24 Therefore I say unto you, all things, whatsoever you ask when ye pray, believe that you shall receive; and they shall come unto you.",
        "25 And when you shall stand to pray, forgive, if you have aught against any man; that your Father also, who is in heaven, may forgive you your sins.",
        "26 But if you will not forgive, neither will your Father that is in heaven, forgive you your sins."
      ]
    }
  ]
}