{
  "date": "2026-05-01",
  "url": "https://www.catholicgallery.org/mass-reading/010526/",
  "title": "Daily Mass Readings for Friday, 1 May 2026",
  "feast": "Easter Weekday/ Joseph the Worker",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 13: 26-33",
      "reference": "Acts 13: 26-33",
      "verses": [
        "26 Men, brethren, children of the stock of Abraham, and whosoever among you fear God, to you the word of this salvation is sent.",
        "27 For they that inhabited Jerusalem, and the rulers thereof, not knowing him, nor the voices of the prophets, which are read every sabbath, judging him have fulfilled them.",
        "28 And finding no cause of death in him, they desired of Pilate, that they might kill him.",
        "29 And when they had fulfilled all things that were written of him, taking him down from the tree, they laid him in a sepulchre.",
        "30 But God raised him up from the dead the third day:",
        "31 Who was seen for many days, by them who came up with him from Galilee to Jerusalem, who to this present are his witnesses to the people.",
        "32 And we declare unto you, that the promise which was made to our fathers,",
        "33 This same God hath fulfilled to our children, raising up Jesus, as in the second psalm also is written: You are my Son; this day I have begotten you."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 2: 6-7, 8-9, 10-11ab",
      "reference": "Psalms 2: 6-7, 8-9, 10-11ab",
      "verses": [
        "R. (7bc) You are my Son; this day I have begotten you.",
        "or",
        "R. Alleluia.",
        "6 But I am appointed king by him over Sion his holy mountain, preaching his commandment.",
        "7 The Lord hath said to me: Thou art my son, this day have I begotten thee.",
        "R. You are my Son; this day I have begotten you.",
        "or",
        "R. Alleluia.",
        "8 Ask of me, and I will give thee the Gentiles for thy inheritance, and the utmost parts of the earth for thy possession.",
        "9 Thou shalt rule them with a rod of iron, and shalt break them in pieces like a potter’s vessel.",
        "R. You are my Son; this day I have begotten you.",
        "or",
        "R. Alleluia.",
        "10 And now, O ye kings, understand: receive instruction, you that judge the earth.",
        "11ab Serve ye the Lord with fear: and rejoice unto him with trembling.",
        "R. You are my Son; this day I have begotten you.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 6",
      "reference": "John 14: 6",
      "verses": [
        "R. Alleluia, alleluia.",
        "6 I am the way and the truth and the life, says the Lord; no one comes to the Father except through me.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 14: 1-6, Proper Gospel for Joseph: Matthew 13: 54-58",
      "reference": "John 14: 1-6, Proper Gospel for Joseph: Matthew 13: 54-58",
      "verses": [
        "1 Let not your heart be troubled. You believe in God, believe also in me.",
        "2 In my Father’s house there are many mansions. If not, I would have told you: because I go to prepare a place for you.",
        "3 And if I shall go, and prepare a place for you, I will come again, and will take you to myself; that where I am, you also may be.",
        "4 And whither I go you know, and the way you know.",
        "5 Thomas saith to him: Lord, we know not whither thou goest; and how can we know the way?",
        "6 Jesus saith to him: I am the way, and the truth, and the life. No man cometh to the Father, but by me."
      ]
    }
  ]
}