{
  "date": "2026-05-16",
  "url": "https://www.catholicgallery.org/mass-reading/160526/",
  "title": "Daily Mass Readings for Saturday, 16 May 2026",
  "feast": "Easter Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 18: 23-28",
      "reference": "Acts 18: 23-28",
      "verses": [
        "23 And after he had spent some time there, he departed, and went through the country of Galatia and Phrygia, in order, confirming all the disciples.",
        "24 Now a certain Jew, named Apollo, born at Alexandria, an eloquent man, came to Ephesus, one mighty in the scriptures.",
        "25 This man was instructed in the way of the Lord; and being fervent in spirit, spoke, and taught diligently the things that are of Jesus, knowing only the baptism of John.",
        "26 This man therefore began to speak boldly in the synagogue. Whom when Priscilla and Aquila had heard, they took him to them, and expounded to him the way of the Lord more diligently.",
        "27 And whereas he was desirous to go to Achaia, the brethren exhorting, wrote to the disciples to receive him. Who, when he was come, helped them much who had believed.",
        "28 For with much vigour he convinced the Jews openly, shewing by the scriptures, that Jesus is the Christ."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 47: 2-3, 8-9, 10",
      "reference": "Psalms 47: 2-3, 8-9, 10",
      "verses": [
        "R. (8a) God is king of all the earth.",
        "or",
        "R. Alleluia.",
        "2 O clap your hands, all ye nations: shout unto God with the voice of Joy,",
        "3 For the Lord is high, terrible: a great king over all the earth.",
        "R. God is king of all the earth.",
        "or",
        "R. Alleluia.",
        "8 For God is the king of all the earth: sing ye wisely.",
        "9 God shall reign over the nations: God sitteth on his holy throne.",
        "R. God is king of all the earth.",
        "or",
        "R. Alleluia.",
        "10 The princes of the people are gathered together, with the God of Abraham: for the strong gods of the earth are exceedingly exalted.",
        "R. God is king of all the earth.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 16: 28",
      "reference": "John 16: 28",
      "verses": [
        "R. Alleluia, alleluia.",
        "28 I came from the Father and have come into the world; now I am leaving the world and going back to the Father.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 16: 23b-28",
      "reference": "John 16: 23b-28",
      "verses": [
        "23b Amen, amen I say to you: if you ask the Father any thing in my name, he will give it you.",
        "24 Hitherto you have not asked any thing in my name. Ask, and you shall receive; that your joy may be full.",
        "25 These things I have spoken to you in proverbs. The hour cometh, when I will no more speak to you in proverbs, but will shew you plainly of the Father.",
        "26 In that day you shall ask in my name; and I say not to you, that I will ask the Father for you:",
        "27 For the Father himself loveth you, because you have loved me, and have believed that I came out from God.",
        "28 I came forth from the Father, and am come into the world: again I leave the world, and I go to the Father."
      ]
    }
  ]
}