{
  "date": "2026-05-11",
  "url": "https://www.catholicgallery.org/mass-reading/110526/",
  "title": "Daily Mass Readings for Monday, 11 May 2026",
  "feast": "Easter Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 16: 11-15",
      "reference": "Acts 16: 11-15",
      "verses": [
        "11 And sailing from Troas, we came with a straight course to Samothracia, and the day following to Neapolis;",
        "12 And from thence to Philippi, which is the chief city of part of Macedonia, a colony. And we were in this city some days conferring together.",
        "13 And upon the sabbath day, we went forth without the gate by a river side, where it seemed that there was prayer; and sitting down, we spoke to the women that were assembled.",
        "14 And a certain woman named Lydia, a seller of purple, of the city of Thyatira, one that worshipped God, did hear: whose heart the Lord opened to attend to those things which were said by Paul.",
        "15 And when she was baptized, and her household, she besought us, saying: If you have judged me to be faithful to the Lord, come into my house, and abide there. And she constrained us."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 149: 1b-2, 3-4, 5-6a and 9b",
      "reference": "Psalms 149: 1b-2, 3-4, 5-6a and 9b",
      "verses": [
        "R. (4a) The Lord takes delight in his people.",
        "or",
        "R. Alleluia.",
        "1b Sing ye to the Lord a new canticle: let his praise be in the church of the saints.",
        "2 Let Israel rejoice in him that made him: and let the children of Sion be joyful in their king.",
        "R. The Lord takes delight in his people.",
        "or",
        "R. Alleluia.",
        "3 Let them praise his name in choir: let them sing to him with the timbrel and the psaltery.",
        "4 For the Lord is well pleased with his people: and he will exalt the meek unto salvation.",
        "R. The Lord takes delight in his people.",
        "or",
        "R. Alleluia.",
        "5 The saints shall rejoice in glory: they shall be joyful in their beds.",
        "6a The high praise of God shall be in their mouth.",
        "9b This glory is to all his saints. Alleluia.",
        "R. The Lord takes delight in his people.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 15: 26b, 27a",
      "reference": "John 15: 26b, 27a",
      "verses": [
        "R. Alleluia, alleluia.",
        "26b, 27a The Spirit of truth will testify to me, says the Lord, and you also will testify.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 15: 26 – 16: 4",
      "reference": "John 15: 26 – 16: 4",
      "verses": [
        "26 But when the Paraclete cometh, whom I will send you from the Father, the Spirit of truth, who proceedeth from the Father, he shall give testimony of me.",
        "27 And you shall give testimony, because you are with me from the beginning.",
        "16:1 These things have I spoken to you, that you may not be scandalized.",
        "2 They will put you out of the synagogues: yea, the hour cometh, that whosoever killeth you, will think that he doth a service to God.",
        "3 And these things will they do to you; because they have not known the Father, nor me.",
        "4 But these things I have told you, that when the hour shall come, you may remember that I told you of them."
      ]
    }
  ]
}