{
  "date": "2026-05-27",
  "url": "https://www.catholicgallery.org/mass-reading/270526/",
  "title": "Daily Mass Readings for Wednesday, 27 May 2026",
  "feast": "Ordinary Weekday/ Augustine of Canterbury, Bishop, Religious, Missionary",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Peter 1: 18-25",
      "reference": "First Peter 1: 18-25",
      "verses": [
        "18 Knowing that you were not redeemed with corruptible things as gold or silver, from your vain conversation of the tradition of your fathers:",
        "19 But with the precious blood of Christ, as of a lamb unspotted and undefiled,",
        "20 Foreknown indeed before the foundation of the world, but manifested in the last times for you,",
        "21 Who through him are faithful in God, who raised him up from the dead, and hath given him glory, that your faith and hope might be in God.",
        "22 Purifying your souls in the obedience of charity, with a brotherly love, from a sincere heart love one another earnestly:",
        "23 Being born again not of corruptible seed, but incorruptible, by the word of God who liveth and remaineth for ever.",
        "24 For all flesh is as grass; and all the glory thereof as the flower of grass. The grass is withered, and the flower thereof is fallen away.",
        "25 But the word of the Lord endureth for ever. And this is the word which by the gospel hath been preached unto you."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 147: 12-13, 14-15, 19-20",
      "reference": "Psalms 147: 12-13, 14-15, 19-20",
      "verses": [
        "R. (12a) Praise the Lord, Jerusalem.",
        "or",
        "R. Alleluia.",
        "12 Praise the Lord, O Jerusalem: praise thy God, O Sion.",
        "13 Because he hath strengthened the bolts of thy gates, he hath blessed thy children within thee.",
        "R. Praise the Lord, Jerusalem.",
        "or",
        "R. Alleluia.",
        "14 Who hath placed peace in thy borders: and filleth thee with the fat of corn.",
        "15 Who sendeth forth his speech to the earth: his word runneth swiftly.",
        "R. Praise the Lord, Jerusalem.",
        "or",
        "R. Alleluia.",
        "19 Who declareth his word to Jacob: his justices and his judgments to Israel.",
        "20 He hath not done in like manner to every nation: and his judgments he hath not made manifest to them. Alleluia.",
        "R. Praise the Lord, Jerusalem.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Mark 10: 45",
      "reference": "Mark 10: 45",
      "verses": [
        "R. Alleluia, alleluia.",
        "45 The Son of Man came to serve, and to give his life as a ransom for many.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 10: 32-45",
      "reference": "Mark 10: 32-45",
      "verses": [
        "32 And they were in the way going up to Jerusalem: and Jesus went before them, and they were astonished; and following were afraid. And taking again the twelve, he began to tell them the things that should befall him.",
        "33 Saying: Behold we go up to Jerusalem, and the Son of man shall be betrayed to the chief priests, and to the scribes and ancients, and they shall condemn him to death, and shall deliver him to the Gentiles.",
        "34 And they shall mock him, and spit on him, and scourge him, and kill him: and the third day he shall rise again.",
        "35 And James and John the sons of Zebedee, come to him, saying: Master, we desire that whatsoever we shall ask, thou wouldst do it for us:",
        "36 But he said to them: What would you that I should do for you?",
        "37 And they said: Grant to us, that we may sit, one on thy right hand, and the other on thy left hand, in thy glory.",
        "38 And Jesus said to them: You know not what you ask. Can you drink of the chalice that I drink of: or be baptized with the baptism wherewith I am baptized?",
        "39 But they said to him: We can. And Jesus saith to them: You shall indeed drink of the chalice that I drink of: and with the baptism wherewith I am baptized, you shall be baptized.",
        "40 But to sit on my right hand, or on my left, is not mine to give to you, but to them for whom it is prepared.",
        "41 And the ten hearing it, began to be much displeased at James and John.",
        "42 But Jesus calling them, saith to them: You know that they who seem to rule over the Gentiles, lord it over them: and their princes have power over them.",
        "43 But it is not so among you: but whosoever will be greater, shall be your minister.",
        "44 And whosoever will be first among you, shall be the servant of all.",
        "45 For the Son of man also is not come to be ministered unto, but to minister, and to give his life a redemption for many."
      ]
    }
  ]
}