{
  "date": "2026-05-05",
  "url": "https://www.catholicgallery.org/mass-reading/050526/",
  "title": "Daily Mass Readings for Tuesday, 5 May 2026",
  "feast": "Easter Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 14: 19-28",
      "reference": "Acts 14: 19-28",
      "verses": [
        "19 Now there came thither certain Jews from Antioch, and Iconium: and persuading the multitude, and stoning Paul, drew him out of the city, thinking him to be dead.",
        "20 But as the disciples stood round about him, he rose up and entered into the city, and the next day he departed with Barnabas to Derbe.",
        "21 And when they had preached the gospel to that city, and had taught many, they returned again to Lystra, and to Iconium, and to Antioch:",
        "22 Confirming the souls of the disciples, and exhorting them to continue in the faith: and that through many tribulations we must enter into the kingdom of God.",
        "23 And when they had ordained to them priests in every church, and had prayed with fasting, they commended them to the Lord, in whom they believed.",
        "24 And passing through Pisidia, they came into Pamphylia.",
        "25 And having spoken the word of the Lord in Perge, they went down into Attalia:",
        "26 And thence they sailed to Antioch, from whence they had been delivered to the grace of God, unto the work which they accomplished.",
        "27 And when they were come, and had assembled the church, they related what great things God had done with them, and how he had opened the door of faith to the Gentiles.",
        "28 And they abode no small time with the disciples."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 145: 10-11, 12-13ab, 21",
      "reference": "Psalms 145: 10-11, 12-13ab, 21",
      "verses": [
        "R. (12) Your friends make known, O Lord, the glorious splendor of your kingdom.",
        "or",
        "R. Alleluia.",
        "10 Let all thy works, O lord, praise thee: and let thy saints bless thee.",
        "11 They shall speak of the glory of thy kingdom: and shall tell of thy power:",
        "R. Your friends make known, O Lord, the glorious splendor of your kingdom.",
        "or",
        "R. Alleluia.",
        "12 To make thy might known to the sons of men: and the glory of the magnificence of thy kingdom.",
        "13 Thy kingdom is a kingdom of all ages: and thy dominion endureth throughout all generations.",
        "R. Your friends make known, O Lord, the glorious splendor of your kingdom.",
        "or",
        "R. Alleluia.",
        "21 My mouth shall speak the praise of the Lord: and let all flesh bless thy holy name for ever; yea, for ever and ever.",
        "R. Your friends make known, O Lord, the glorious splendor of your kingdom.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 24: 46, 26",
      "reference": "Luke 24: 46, 26",
      "verses": [
        "R. Alleluia, alleluia.",
        "46, 26 Christ had to suffer and to rise from the dead, and so enter into his glory.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 14: 27-31a",
      "reference": "John 14: 27-31a",
      "verses": [
        "27 Peace I leave with you, my peace I give unto you: not as the world giveth, do I give unto you. Let not your heart be troubled, nor let it be afraid.",
        "28 You have heard that I said to you: I go away, and I come unto you. If you loved me, you would indeed be glad, because I go to the Father: for the Father is greater than I.",
        "29 And now I have told you before it comes to pass: that when it shall come to pass, you may believe.",
        "30 I will not now speak many things with you. For the prince of this world cometh, and in me he hath not any thing.",
        "31 But that the world may know, that I love the Father: and as the Father hath given me commandment."
      ]
    }
  ]
}