{
  "date": "2026-04-21",
  "url": "https://www.catholicgallery.org/mass-reading/210426/",
  "title": "Daily Mass Readings for Tuesday, 21 April 2026",
  "feast": "Easter Weekday/ Anselm, Bishop, Religious, Doctor",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 7: 51-60",
      "reference": "Acts 7: 51-60",
      "verses": [
        "51 You stiffnecked and uncircumcised in heart and ears, you always resist the Holy Ghost: as your fathers did, so do you also.",
        "52 Which of the prophets have not your fathers persecuted? And they have slain them who foretold of the coming of the Just One; of whom you have been now the betrayers and murderers:",
        "53 Who have received the law by the disposition of angels, and have not kept it.",
        "54 Now hearing these things, they were cut to the heart, and they gnashed with their teeth at him.",
        "55 But he, being full of the Holy Ghost, looking up steadfastly to heaven, saw the glory of God, and Jesus standing on the right hand of God.",
        "56 And he said: Behold, I see the heavens opened, and the Son of man standing on the right hand of God.",
        "57 And they crying out with a loud voice, stopped their ears, and with one accord ran violently upon him.",
        "58 And casting him forth without the city, they stoned him; and the witnesses laid down their garments at the feet of a young man, whose name was Saul.",
        "59 And they stoned Stephen, invoking, and saying: Lord Jesus, receive my spirit.",
        "60 And falling on his knees, he cried with a loud voice, saying: Lord, lay not this sin to their charge. And when he had said this, he fell asleep in the Lord. And Saul was consenting to his death."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 31: 3cd-4, 6 and 7b and 8a, 17 and 21ab",
      "reference": "Psalms 31: 3cd-4, 6 and 7b and 8a, 17 and 21ab",
      "verses": [
        "R. (6a) Into your hands, O Lord, I commend my spirit.",
        "or",
        "R. Alleluia.",
        "3cd Be thou unto me a God, a protector, and a house of refuge, to save me.",
        "4 For thou art my strength and my refuge; and for thy name’s sake thou wilt lead me, and nourish me.",
        "R. Into your hands, O Lord, I commend my spirit.",
        "or",
        "R. Alleluia.",
        "6 Into thy hands I commend my spirit: thou hast redeemed me, O Lord, the God of truth.",
        "7b But I have hoped in the Lord:",
        "8a I will be glad and rejoice in thy mercy.",
        "R. Into your hands, O Lord, I commend my spirit.",
        "or",
        "R. Alleluia.",
        "17 Make thy face to shine upon thy servant; save me in thy mercy.",
        "21ab Thou shalt hide them in the secret of thy face, from the disturbance of men.",
        "R. Into your hands, O Lord, I commend my spirit.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 6: 35ab",
      "reference": "John 6: 35ab",
      "verses": [
        "R. Alleluia, alleluia.",
        "35ab I am the bread of life, says the Lord; whoever comes to me will never hunger.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 6: 30-35",
      "reference": "John 6: 30-35",
      "verses": [
        "30 They said therefore to him: What sign therefore dost thou shew, that we may see, and may believe thee? What dost thou work?",
        "31 Our fathers did eat manna in the desert, as it is written: He gave them bread from heaven to eat.",
        "32 Then Jesus said to them: Amen, amen I say to you; Moses gave you not bread from heaven, but my Father giveth you the true bread from heaven.",
        "33 For the bread of God is that which cometh down from heaven, and giveth life to the world.",
        "34 They said therefore unto him: Lord, give us always this bread.",
        "35 And Jesus said to them: I am the bread of life: he that cometh to me shall not hunger: and he that believeth in me shall never thirst."
      ]
    }
  ]
}