{
  "date": "2026-04-12",
  "url": "https://www.catholicgallery.org/mass-reading/120426/",
  "title": "Daily Mass Readings for Sunday, 12 April 2026",
  "feast": "Second Sunday of Easter",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 2: 42-47",
      "reference": "Acts 2: 42-47",
      "verses": [
        "42 And they were persevering in the doctrine of the apostles, and in the communication of the breaking of bread, and in prayers.",
        "43 And fear came upon every soul: many wonders also and signs were done by the apostles in Jerusalem, and there was great fear in all.",
        "44 And all they that believed, were together, and had all things common.",
        "45 Their possessions and goods they sold, and divided them to all, according as every one had need.",
        "46 And continuing daily with one accord in the temple, and breaking bread from house to house, they took their meat with gladness and simplicity of heart;",
        "47 Praising God, and having favour with all the people. And the Lord increased daily together such as should be saved."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 118: 2-4, 13-15, 22-24",
      "reference": "Psalms 118: 2-4, 13-15, 22-24",
      "verses": [
        "R. (1) Give thanks to the LORD, for he is good, his love is everlasting.",
        "or",
        "R. Alleluia.",
        "2 Let Israel now say that he is good: that his mercy endureth for ever.",
        "3 Let the house of Aaron now say, that his mercy endureth for ever.",
        "4 Let them that fear the Lord now say, that his mercy endureth for ever.",
        "R. Give thanks to the LORD, for he is good, his love is everlasting.",
        "or",
        "R. Alleluia.",
        "13 Being pushed I was overturned that I might fall: but the Lord supported me.",
        "14 The Lord is my strength and my praise: and he is become my salvation.",
        "15 The voice of rejoicing and of salvation is in the tabernacles of the just.",
        "R. Give thanks to the LORD, for he is good, his love is everlasting.",
        "or",
        "R. Alleluia.",
        "22 The stone which the builders rejected; the same is become the head of the corner.",
        "23 This is the Lord’s doing: and it is wonderful in our eyes.",
        "24 This is the day which the Lord hath made: let us be glad and rejoice therein.",
        "R. Give thanks to the LORD, for he is good, his love is everlasting.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First Peter 1: 3-9",
      "reference": "First Peter 1: 3-9",
      "verses": [
        "3 Blessed be the God and Father of our Lord Jesus Christ, who according to his great mercy hath regenerated us unto a lively hope, by the resurrection of Jesus Christ from the dead,",
        "4 Unto an inheritance incorruptible, and undefiled, and that can not fade, reserved in heaven for you,",
        "5 Who, by the power of God, are kept by faith unto salvation, ready to be revealed in the last time.",
        "6 Wherein you shall greatly rejoice, if now you must be for a little time made sorrowful in divers temptations:",
        "7 That the trial of your faith (much more precious than gold which is tried by the fire) may be found unto praise and glory and honour at the appearing of Jesus Christ:",
        "8 Whom having not seen, you love: in whom also now, though you see him not, you believe: and believing shall rejoice with joy unspeakable and glorified;",
        "9 Receiving the end of your faith, even the salvation of your souls."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 20: 29",
      "reference": "John 20: 29",
      "verses": [
        "R. Alleluia, alleluia.",
        "29 You believe in me, Thomas, because you have seen me, says the Lord; blessed are they who have not seen me, but still believe!",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: John 20: 19-31",
      "reference": "John 20: 19-31",
      "verses": [
        "19 Now when it was late that same day, the first of the week, and the doors were shut, where the disciples were gathered together, for fear of the Jews, Jesus came and stood in the midst, and said to them: Peace be to you.",
        "20 And when he had said this, he shewed them his hands and his side. The disciples therefore were glad, when they saw the Lord.",
        "21 He said therefore to them again: Peace be to you. As the Father hath sent me, I also send you.",
        "22 When he had said this, he breathed on them; and he said to them: Receive ye the Holy Ghost.",
        "23 Whose sins you shall forgive, they are forgiven them; and whose sins you shall retain, they are retained.",
        "24 Now Thomas, one of the twelve, who is called Didymus, was not with them when Jesus came.",
        "25 The other disciples therefore said to him: We have seen the Lord. But he said to them: Except I shall see in his hands the print of the nails, and put my finger into the place of the nails, and put my hand into his side, I will not believe.",
        "26 And after eight days again his disciples were within, and Thomas with them. Jesus cometh, the doors being shut, and stood in the midst, and said: Peace be to you.",
        "27 Then he saith to Thomas: Put in thy finger hither, and see my hands; and bring hither thy hand, and put it into my side; and be not faithless, but believing.",
        "28 Thomas answered, and said to him: My Lord, and my God.",
        "29 Jesus saith to him: Because thou hast seen me, Thomas, thou hast believed: blessed are they that have not seen, and have believed.",
        "30 Many other signs also did Jesus in the sight of his disciples, which are not written in this book.",
        "31 But these are written, that you may believe that Jesus is the Christ, the Son of God: and that believing, you may have life in his name."
      ]
    }
  ]
}