{
  "date": "2026-04-19",
  "url": "https://www.catholicgallery.org/mass-reading/190426/",
  "title": "Daily Mass Readings for Sunday, 19 April 2026",
  "feast": "Third Sunday of Easter",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 2: 14, 22-33",
      "reference": "Acts 2: 14, 22-33",
      "verses": [
        "14 But Peter standing up with the eleven, lifted up his voice, and spoke to them: Ye men of Judea, and all you that dwell in Jerusalem, be this known to you, and with your ears receive my words.",
        "22 Ye men of Israel, hear these words: Jesus of Nazareth, a man approved of God among you, by miracles, and wonders, and signs, which God did by him, in the midst of you, as you also know:",
        "23 This same being delivered up, by the determinate counsel and foreknowledge of God, you by the hands of wicked men have crucified and slain.",
        "24 Whom God hath raised up, having loosed the sorrows of hell, as it was impossible that he should be holden by it.",
        "25 For David saith concerning him: I foresaw the Lord before my face: because he is at my right hand, that I may not be moved.",
        "26 For this my heart hath been glad, and my tongue hath rejoiced: moreover my flesh also shall rest in hope.",
        "27 Because thou wilt not leave my soul in hell, nor suffer thy Holy One to see corruption.",
        "28 Thou hast made known to me the ways of life: thou shalt make me full of joy with thy countenance.",
        "29 Ye men, brethren, let me freely speak to you of the patriarch David; that he died, and was buried; and his sepulchre is with us to this present day.",
        "30 Whereas therefore he was a prophet, and knew that God hath sworn to him with an oath, that of the fruit of his loins one should sit upon his throne.",
        "31 Foreseeing this, he spoke of the resurrection of Christ. For neither was he left in hell, neither did his flesh see corruption.",
        "32 This Jesus hath God raised again, whereof all we are witnesses.",
        "33 Being exalted therefore by the right hand of God, and having received of the Father the promise of the Holy Ghost, he hath poured forth this which you see and hear."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 16: 1-2, 5, 7-8, 9-10, 11",
      "reference": "Psalms 16: 1-2, 5, 7-8, 9-10, 11",
      "verses": [
        "R. (11a) Lord, you will show us the path of life.",
        "or",
        "R. Alleluia.",
        "1 Preserve me, O Lord, for I have put trust in thee.",
        "2 I have said to the Lord, thou art my God, for thou hast no need of my goods.",
        "5 The Lord is the portion of my inheritance and of my cup: it is thou that wilt restore my inheritance to me.",
        "R. Lord, you will show us the path of life.",
        "or",
        "R. Alleluia.",
        "7 I will bless the Lord, who hath given me understanding: moreover my reins also have corrected me even till night.",
        "8 I set the Lord always in my sight: for he is at my right hand, that I be not moved.",
        "R. Lord, you will show us the path of life.",
        "or",
        "R. Alleluia.",
        "9 Therefore my heart hath been glad, and my tongue hath rejoiced: moreover my flesh also shall rest in hope.",
        "10 Because thou wilt not leave my soul in hell; nor wilt then give thy holy one to see corruption.",
        "R. Lord, you will show us the path of life.",
        "or",
        "R. Alleluia.",
        "11 Thou hast made known to me the ways of life, thou shalt fill me with joy with thy countenance: at thy right hand are delights even to the end.",
        "R. Lord, you will show us the path of life.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First Peter 1: 17-21",
      "reference": "First Peter 1: 17-21",
      "verses": [
        "17 And if you invoke as Father him who, without respect of persons, judgeth according to every one’s work: converse in fear during the time of your sojourning here.",
        "18 Knowing that you were not redeemed with corruptible things as gold or silver, from your vain conversation of the tradition of your fathers:",
        "19 But with the precious blood of Christ, as of a lamb unspotted and undefiled,",
        "20 Foreknown indeed before the foundation of the world, but manifested in the last times for you,",
        "21 Who through him are faithful in God, who raised him up from the dead, and hath given him glory, that your faith and hope might be in God."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 24: 32",
      "reference": "Luke 24: 32",
      "verses": [
        "R. Alleluia, alleluia.",
        "32 Lord Jesus, open the Scriptures to us; make our hearts burn while you speak to us.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 24:13-35",
      "reference": "Luke 24:13-35",
      "verses": [
        "13 And behold, two of them went, the same day, to a town which was sixty furlongs from Jerusalem, named Emmaus.",
        "14 And they talked together of all these things which had happened.",
        "15 And it came to pass, that while they talked and reasoned with themselves, Jesus himself also drawing near, went with them.",
        "16 But their eyes were held, that they should not know him.",
        "17 And he said to them: What are these discourses that you hold one with another as you walk, and are sad?",
        "18 And the one of them, whose name was Cleophas, answering, said to him: Art thou only a stranger to Jerusalem, and hast not known the things that have been done there in these days?",
        "19 To whom he said: What things? And they said: Concerning Jesus of Nazareth, who was a prophet, mighty in work and word before God and all the people;",
        "20 And how our chief priests and princes delivered him to be condemned to death, and crucified him.",
        "21 But we hoped, that it was he that should have redeemed Israel: and now besides all this, today is the third day since these things were done.",
        "22 Yea and certain women also of our company affrighted us, who before it was light, were at the sepulchre,",
        "23 And not finding his body, came, saying, that they had also seen a vision of angels, who say that he is alive.",
        "24 And some of our people went to the sepulchre, and found it so as the women had said, but him they found not.",
        "25 Then he said to them: O foolish, and slow of heart to believe in all things which the prophets have spoken.",
        "26 Ought not Christ to have suffered these things, and so to enter into his glory?",
        "27 And beginning at Moses and all the prophets, he expounded to them in all the scriptures, the things that were concerning him.",
        "28 And they drew nigh to the town, whither they were going: and he made as though he would go farther.",
        "29 But they constrained him; saying: Stay with us, because it is towards evening, and the day is now far spent. And he went in with them.",
        "30 And it came to pass, whilst he was at table with them, he took bread, and blessed, and brake, and gave to them.",
        "31 And their eyes were opened, and they knew him: and he vanished out of their sight.",
        "32 And they said one to the other: Was not our heart burning within us, whilst he spoke in this way, and opened to us the scriptures?",
        "33 And rising up, the same hour, they went back to Jerusalem: and they found the eleven gathered together, and those that were staying with them,",
        "34 Saying: The Lord is risen indeed, and hath appeared to Simon.",
        "35 And they told what things were done in the way; and how they knew him in the breaking of the bread."
      ]
    }
  ]
}