{
  "date": "2026-04-25",
  "url": "https://www.catholicgallery.org/mass-reading/250426/",
  "title": "Daily Mass Readings for Saturday, 25 April 2026",
  "feast": "Mark, Evangelist Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Peter 5: 5b-14",
      "reference": "First Peter 5: 5b-14",
      "verses": [
        "5b Do you all insinuate humility one to another, for God resisteth the proud, but to the humble he giveth grace.",
        "6 Be you humbled therefore under the mighty hand of God, that he may exalt you in the time of visitation:",
        "7 Casting all your care upon him, for he hath care of you.",
        "8 Be sober and watch: because your adversary the devil, as a roaring lion, goeth about seeking whom he may devour.",
        "9 Whom resist ye, strong in faith: knowing that the same affliction befalls your brethren who are in the world.",
        "10 But the God of all grace, who hath called us into his eternal glory in Christ Jesus, after you have suffered a little, will himself perfect you, and confirm you, and establish you.",
        "11 To him be glory and empire for ever and ever. Amen.",
        "12 By Sylvanus, a faithful brother unto you, as I think, I have written briefly: beseeching and testifying that this is the true grace of God, wherein you stand.",
        "13 The church that is in Babylon, elected together with you, saluteth you: and so doth my son Mark.",
        "14 Salute one another with a holy kiss. Grace be to all you, who are in Christ Jesus. Amen."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 89: 2-3, 6-7, 16-17",
      "reference": "Psalms 89: 2-3, 6-7, 16-17",
      "verses": [
        "R. (2) For ever I will sing the goodness of the Lord.",
        "or",
        "R. Alleluia.",
        "2 The mercies of the Lord I will sing for ever. I will shew forth thy truth with my mouth to generation and generation.",
        "3 For thou hast said: Mercy shall be built up for ever in the heavens: thy truth shall be prepared in them.",
        "R. For ever I will sing the goodness of the Lord.",
        "or",
        "R. Alleluia.",
        "6 The heavens shall confess thy wonders, O Lord: and thy truth in the church of the saints.",
        "7 For who in the clouds can be compared to the Lord: or who among the sons of God shall be like to God?",
        "R. For ever I will sing the goodness of the Lord.",
        "or",
        "R. Alleluia.",
        "16 Blessed is the people that knoweth jubilation. They shall walk, O Lord, in the light of thy countenance:",
        "17 And in thy name they shall rejoice all the day, and in thy justice they shall be exalted.",
        "R. For ever I will sing the goodness of the Lord.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: First Corinthians 1: 23a, 24b",
      "reference": "First Corinthians 1: 23a, 24b",
      "verses": [
        "R. Alleluia, alleluia.",
        "23a, 24b We proclaim Christ crucified; he is the power of God and the wisdom of God.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 16: 15-20",
      "reference": "Mark 16: 15-20",
      "verses": [
        "15 And he said to them: Go ye into the whole world, and preach the gospel to every creature.",
        "16 He that believeth and is baptized, shall be saved: but he that believeth not shall be condemned.",
        "17 And these signs shall follow them that believe: In my name they shall cast out devils: they shall speak with new tongues.",
        "18 They shall take up serpents; and if they shall drink any deadly thing, it shall not hurt them: they shall lay their hands upon the sick, and they shall recover.",
        "19 And the Lord Jesus, after he had spoken to them, was taken up into heaven, and sitteth on the right hand of God.",
        "20 But they going forth preached everywhere: the Lord working withal, and confirming the word with signs that followed."
      ]
    }
  ]
}