{
  "date": "2026-10-06",
  "url": "https://www.catholicgallery.org/mass-reading/061026/",
  "title": "Daily Mass Readings for Tuesday, 6 October 2026",
  "feast": "Ordinary Weekday/ Bruno, Priest, Hermit, Religious Founder/ Blessed Marie-Rose Durocher, Virgin, Religious Founder",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Galatians 1: 13-24",
      "reference": "Galatians 1: 13-24",
      "verses": [
        "13 For you have heard of my conversation in time past in the Jews’ religion: how that, beyond measure, I persecuted the church of God, and wasted it.",
        "14 And I made progress in the Jews’ religion above many of my equals in my own nation, being more abundantly zealous for the traditions of my fathers.",
        "15 But when it pleased him, who separated me from my mother’s womb, and called me by his grace,",
        "16 To reveal his Son in me, that I might preach him among the Gentiles, immediately I condescended not to flesh and blood.",
        "17 Neither went I to Jerusalem, to the apostles who were before me: but I went into Arabia, and again I returned to Damascus.",
        "18 Then, after three years, I went to Jerusalem, to see Peter, and I tarried with him fifteen days.",
        "19 But other of the apostles I saw none, saving James the brother of the Lord.",
        "20 Now the things which I write to you, behold, before God, I lie not.",
        "21 Afterwards I came into the regions of Syria and Cilicia.",
        "22 And I was unknown by face to the churches of Judea, which were in Christ:",
        "23 But they had heard only: He, who persecuted us in times past, doth now preach the faith which once he impugned:",
        "24 And they glorified God in me."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 139: 1b-3, 13-14ab, 14c-15",
      "reference": "Psalms 139: 1b-3, 13-14ab, 14c-15",
      "verses": [
        "R. (24b) Guide me, Lord, along the everlasting way.",
        "1 Lord, thou hast proved me, and known me:",
        "2 Thou hast know my sitting down, and my rising up.",
        "3 Thou hast understood my thoughts afar off: my path and my line thou hast searched out.",
        "R. Guide me, Lord, along the everlasting way.",
        "13 For thou hast possessed my reins: thou hast protected me from my mother’s womb.",
        "14ab I will praise thee, for thou art fearfully magnified: wonderful are thy works.",
        "R. Guide me, Lord, along the everlasting way.",
        "14c My soul knoweth right well.",
        "15 My bone is not hidden from thee, which thou hast made in secret: and my substance in the lower parts of the earth.",
        "R. Guide me, Lord, along the everlasting way."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 11: 28",
      "reference": "Luke 11: 28",
      "verses": [
        "R. Alleluia, alleluia.",
        "28 Blessed are those who hear the word of God and observe it.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 10: 38-42",
      "reference": "Luke 10: 38-42",
      "verses": [
        "38 Now it came to pass as they went, that he entered into a certain town: and a certain woman named Martha, received him into her house.",
        "39 And she had a sister called Mary, who sitting also at the Lord’s feet, heard his word.",
        "40 But Martha was busy about much serving. Who stood and said: Lord, hast thou no care that my sister hath left me alone to serve? speak to her therefore, that she help me.",
        "41 And the Lord answering, said to her: Martha, Martha, thou art careful, and art troubled about many things:",
        "42 But one thing is necessary. Mary hath chosen the best part, which shall not be taken away from her."
      ]
    }
  ]
}