{
  "date": "2026-10-21",
  "url": "https://www.catholicgallery.org/mass-reading/211026/",
  "title": "Daily Mass Readings for Wednesday, 21 October 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ephesians 3: 2-12",
      "reference": "Ephesians 3: 2-12",
      "verses": [
        "2 If yet you have heard of the dispensation of the grace of God which is given me towards you:",
        "3 How that, according to revelation, the mystery has been made known to me, as I have written above in a few words;",
        "4 As you reading, may understand my knowledge in the mystery of Christ,",
        "5 Which in other generations was not known to the sons of men, as it is now revealed to his holy apostles and prophets in the Spirit:",
        "6 That the Gentiles should be fellow heirs, and of the same body, and co-partners of his promise in Christ Jesus, by the gospel:",
        "7 Of which I am made a minister, according to the gift of the grace of God, which is given to me according to the operation of his power:",
        "8 To me, the least of all the saints, is given this grace, to preach among the Gentiles, the unsearchable riches of Christ,",
        "9 And to enlighten all men, that they may see what is the dispensation of the mystery which hath been hidden from eternity in God, who created all things:",
        "10 That the manifold wisdom of God may be made known to the principalities and powers in heavenly places through the church,",
        "11 According to the eternal purpose, which he made, in Christ Jesus our Lord:",
        "12 In whom we have boldness and access with confidence by the faith of him."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Isaiah 12: 2-3, 4bcd, 5-6",
      "reference": "Isaiah 12: 2-3, 4bcd, 5-6",
      "verses": [
        "R. (3) You will draw water joyfully from the springs of salvation.",
        "2 Behold, God is my saviour, I will deal confidently, and will not fear: O because the Lord is my strength, and my praise, and he is become my salvation.",
        "3 You shall draw waters with joy out of the saviour’s fountains:",
        "R. You will draw water joyfully from the springs of salvation.",
        "4bcd Praise ye the Lord, and call upon his name: make his works known among the people: remember that his name is high.",
        "R. You will draw water joyfully from the springs of salvation.",
        "5 Sing ye to the Lord, for he hath done great things: shew this forth in all the earth.",
        "6 Rejoice, and praise, O thou habitation of Sion: for great is he that is in the midst of thee, the Holy One of Israel.",
        "R. You will draw water joyfully from the springs of salvation."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 24: 42a, 44",
      "reference": "Matthew 24: 42a, 44",
      "verses": [
        "R. Alleluia, alleluia.",
        "42a, 44 Stay awake! For you do not know when the Son of Man will come.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 12: 39-48",
      "reference": "Luke 12: 39-48",
      "verses": [
        "39 But this know ye, that if the householder did know at what hour the thief would come, he would surely watch, and would not suffer his house to be broken open.",
        "40 Be you then also ready: for at what hour you think not, the Son of man will come.",
        "41 And Peter said to him: Lord, dost thou speak this parable to us, or likewise to all?",
        "42 And the Lord said: Who (thinkest thou) is the faithful and wise steward, whom his lord setteth over his family, to give them their measure of wheat in due season?",
        "43 Blessed is that servant, whom when his lord shall come, he shall find so doing.",
        "44 Verily I say to you, he will set him over all that he possesseth.",
        "45 But if that servant shall say in his heart: My lord is long a coming; and shall begin to strike the menservants and maidservants, and to eat and to drink and be drunk:",
        "46 The lord of that servant will come in the day that he hopeth not, and at the hour that he knoweth not, and shall separate him, and shall appoint him his portion with unbelievers.",
        "47 And that servant who knew the will of his lord, and prepared not himself, and did not according to his will, shall be beaten with many stripes.",
        "48 But he that knew not, and did things worthy of stripes, shall be beaten with few stripes. And unto whomsoever much is given, of him much shall be required: and to whom they have committed much, of him they will demand the more."
      ]
    }
  ]
}