{
  "date": "2026-10-22",
  "url": "https://www.catholicgallery.org/mass-reading/221026/",
  "title": "Daily Mass Readings for Thursday, 22 October 2026",
  "feast": "Ordinary Weekday/ John Paul II, Pope",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ephesians 3: 14-21",
      "reference": "Ephesians 3: 14-21",
      "verses": [
        "14 For this cause I bow my knees to the Father of our Lord Jesus Christ,",
        "15 Of whom all paternity in heaven and earth is named,",
        "16 That he would grant you, according to the riches of his glory, to be strengthened by his Spirit with might unto the inward man,",
        "17 That Christ may dwell by faith in your hearts; that being rooted and founded in charity,",
        "18 You may be able to comprehend, with all the saints, what is the breadth, and length, and height, and depth:",
        "19 To know also the charity of Christ, which surpasseth all knowledge, that you may be filled unto all the fulness of God.",
        "20 Now to him who is able to do all things more abundantly than we desire or understand, according to the power that worketh in us;",
        "21 To him be glory in the church, and in Christ Jesus unto all generations, world without end. Amen."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 33: 1-2, 4-5, 11-12, 18-19",
      "reference": "Psalms 33: 1-2, 4-5, 11-12, 18-19",
      "verses": [
        "R. (5b) The earth is full of the goodness of the Lord.",
        "1 Rejoice in the Lord, O ye just: praise becometh the upright.",
        "2 Give praise to the Lord on the harp; sing to him with the psaltery, the instrument of ten strings.",
        "R. The earth is full of the goodness of the Lord.",
        "4 For the word of the Lord is right, and all his works are done with faithfulness.",
        "5 He loveth mercy and judgment; the earth is full of the mercy of the Lord.",
        "R. The earth is full of the goodness of the Lord.",
        "11 But the counsel of the Lord standeth for ever: the thoughts of his heart to all generations.",
        "12 Blessed is the nation whose God is the Lord: the people whom he hath chosen for his inheritance.",
        "R. The earth is full of the goodness of the Lord.",
        "18 Behold the eyes of the Lord are on them that fear him: and on them that hope in his mercy.",
        "19 To deliver their souls from death; and feed them in famine.",
        "R. The earth is full of the goodness of the Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Philippians 3: 8-9",
      "reference": "Philippians 3: 8-9",
      "verses": [
        "R. Alleluia, alleluia.",
        "8-9 I consider all things so much rubbish that I may gain Christ and be found in him.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 12: 49-53",
      "reference": "Luke 12: 49-53",
      "verses": [
        "49 I am come to cast fire on the earth; and what will I, but that it be kindled?",
        "50 And I have a baptism wherewith I am to be baptized: and how am I straitened until it be accomplished?",
        "51 Think ye, that I am come to give peace on earth? I tell you, no; but separation.",
        "52 For there shall be from henceforth five in one house divided: three against two, and two against three.",
        "53 The father shall be divided against the son, and the son against his father, the mother against the daughter, and the daughter against the mother, the mother in law against her daughter in law, and the daughter in law against her mother in law."
      ]
    }
  ]
}