{
  "date": "2026-10-03",
  "url": "https://www.catholicgallery.org/mass-reading/031026/",
  "title": "Daily Mass Readings for Saturday, 3 October 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Job 42: 1-3, 5-6, 12-17",
      "reference": "Job 42: 1-3, 5-6, 12-17",
      "verses": [
        "1 Then Job answered the Lord, and said:",
        "2 I know that thou canst do all things, and no thought is hid from thee.",
        "3 Who is this that hideth counsel without knowledge? Therefore I have spoken unwisely, and things that above measure exceeded my knowledge.",
        "5 With the hearing of the ear, I have heard thee, but now my eye seeth thee.",
        "6 Therefore I reprehend myself, and do penance in dust and ashes.",
        "12 And the Lord blessed the latter end of Job more than his beginning. And he had fourteen thousand sheep, and six thousand camels, and a thousand yoke of oxen, and a thousand she asses.",
        "13 And he had seven sons, and three daughters.",
        "14 And he called the names of one Dies, and the name of the second Cassia, and the name of the third Cornustibil.",
        "15 And there were not found in all the earth women so beautiful as the daughters of Job: and their father gave them inheritance among their brethren.",
        "16 And Job lived after these things, a hundred and forty years, and he saw his children, and his children’s children, unto the fourth generation,",
        "17 and he died an old man, and full of days."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 119: 66, 71, 75, 91, 125, 130",
      "reference": "Psalms 119: 66, 71, 75, 91, 125, 130",
      "verses": [
        "R. (135) Lord, let your face shine on me.",
        "66 Teach me goodness and discipline and knowledge; for I have believed thy commandments.",
        "R. Lord, let your face shine on me.",
        "71 It is good for me that thou hast humbled me, that I may learn thy justifications.",
        "R. Lord, let your face shine on me.",
        "75 I know, O Lord, that thy judgments are equity: and in thy truth thou hast humbled me.",
        "R. Lord, let your face shine on me.",
        "91 By thy ordinance the day goeth on: for all things serve thee.",
        "R. Lord, let your face shine on me.",
        "125 I am thy servant: give me understanding that I may know thy testimonies.",
        "R. Lord, let your face shine on me.",
        "130 The declaration of thy words giveth light: and giveth understanding to little ones.",
        "R. Lord, let your face shine on me."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 11: 25",
      "reference": "Matthew 11: 25",
      "verses": [
        "R. Alleluia, alleluia.",
        "25 Blessed are you, Father, Lord of heaven and earth, you have revealed to little ones the mysteries of the Kingdom.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 10: 17-24",
      "reference": "Luke 10: 17-24",
      "verses": [
        "17 And the seventy-two returned with joy, saying: Lord, the devils also are subject to us in thy name.",
        "18 And he said to them: I saw Satan like lightning falling from heaven.",
        "19 Behold, I have given you power to tread upon serpents and scorpions, and upon all the power of the enemy: and nothing shall hurt you.",
        "20 But yet rejoice not in this, that spirits are subject unto you; but rejoice in this, that your names are written in heaven.",
        "21 In that same hour, he rejoiced in the Holy Ghost, and said: I confess to thee, O Father, Lord of heaven and earth, because thou hast hidden these things from the wise and prudent, and hast revealed them to little ones. Yea, Father, for so it hath seemed good in thy sight.",
        "22 All things are delivered to me by my Father; and no one knoweth who the Son is, but the Father; and who the Father is, but the Son, and to whom the Son will reveal him.",
        "23 And turning to his disciples, he said: Blessed are the eyes that see the things which you see.",
        "24 For I say to you, that many prophets and kings have desired to see the things that you see, and have not seen them; and to hear the things that you hear, and have not heard them."
      ]
    }
  ]
}