{
  "date": "2026-10-29",
  "url": "https://www.catholicgallery.org/mass-reading/291026/",
  "title": "Daily Mass Readings for Thursday, 29 October 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ephesians 6: 10-20",
      "reference": "Ephesians 6: 10-20",
      "verses": [
        "10 Finally, brethren, be strengthened in the Lord, and in the might of his power.",
        "11 Put you on the armour of God, that you may be able to stand against the deceits of the devil.",
        "12 For our wrestling is not against flesh and blood; but against principalities and power, against the rulers of the world of this darkness, against the spirits of wickedness in the high places.",
        "13 Therefore take unto you the armour of God, that you may be able to resist in the evil day, and to stand in all things perfect.",
        "14 Stand therefore, having your loins girt about with truth, and having on the breastplate of justice,",
        "15 And your feet shod with the preparation of the gospel of peace:",
        "16 In all things taking the shield of faith, wherewith you may be able to extinguish all the fiery darts of the most wicked one.",
        "17 And take unto you the helmet of salvation, and the sword of the Spirit (which is the word of God).",
        "18 By all prayer and supplication praying at all times in the spirit; and in the same watching with all instance and supplication for all the saints:",
        "19 And for me, that speech may be given me, that I may open my mouth with confidence, to make known the mystery of the gospel.",
        "20 For which I am an ambassador in a chain, so that therein I may be bold to speak according as I ought."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 144: 1b, 2, 9-10",
      "reference": "Psalms 144: 1b, 2, 9-10",
      "verses": [
        "R. (1b) Blessed be the Lord, my Rock!",
        "1 Blessed be the Lord my God, who teacheth my hands to fight, and my fingers to war.",
        "R. Blessed be the Lord, my Rock!",
        "2 My mercy, and my refuge: my support, and my deliverer: My protector, and I have hoped in him: who subdueth my people under me.",
        "R. Blessed be the Lord, my Rock!",
        "9 To thee, O God, I will sing a new canticle: on the psaltery and an instrument of ten strings I will sing praises to thee.",
        "10 Who givest salvation to kings: who hast redeemed thy servant David from the malicious sword:",
        "R. Blessed be the Lord, my Rock!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 19: 38; 2:14",
      "reference": "Luke 19: 38; 2:14",
      "verses": [
        "R. Alleluia, alleluia.",
        "19:38, 2:14 Blessed is the king who comes in the name of the Lord. Glory to God in the highest and on earth peace to those on whom his favor rests.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 13: 31-35",
      "reference": "Luke 13: 31-35",
      "verses": [
        "31 The same day, there came some of the Pharisees, saying to him: Depart, and get thee hence, for Herod hath a mind to kill thee.",
        "32 And he said to them: Go and tell that fox, Behold, I cast out devils, and do cures today and tomorrow, and the third day I am consummated.",
        "33 Nevertheless I must walk today and tomorrow, and the day following, because it cannot be that a prophet perish, out of Jerusalem.",
        "34 Jerusalem, Jerusalem, that killest the prophets, and stonest them that are sent to thee, how often would I have gathered thy children as the bird doth her brood under her wings, and thou wouldest not?",
        "35 Behold your house shall be left to you desolate. And I say to you, that you shall not see me till the time come, when you shall say: Blessed is he that cometh in the name of the Lord."
      ]
    }
  ]
}