{
  "date": "2026-10-24",
  "url": "https://www.catholicgallery.org/mass-reading/241026/",
  "title": "Daily Mass Readings for Saturday, 24 October 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary/ Anthony Mary Claret, Bishop, Religious Founder",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ephesians 4: 7-16",
      "reference": "Ephesians 4: 7-16",
      "verses": [
        "7 But to every one of us is given grace, according to the measure of the giving of Christ.",
        "8 Wherefore he saith: Ascending on high, he led captivity captive; he gave gifts to men.",
        "9 Now that he ascended, what is it, but because he also descended first into the lower parts of the earth?",
        "10 He that descended is the same also that ascended above all the heavens, that he might fill all things.",
        "11 And he gave some apostles, and some prophets, and other some evangelists, and other some pastors and doctors,",
        "12 For the perfecting of the saints, for the work of the ministry, for the edifying of the body of Christ:",
        "13 Until we all meet into the unity of faith, and of the knowledge of the Son of God, unto a perfect man, unto the measure of the age of the fulness of Christ;",
        "14 That henceforth we be no more children tossed to and fro, and carried about with every wind of doctrine by the wickedness of men, by cunning craftiness, by which they lie in wait to deceive.",
        "15 But doing the truth in charity, we may in all things grow up in him who is the head, even Christ:",
        "16 From whom the whole body, being compacted and fitly joined together, by what every joint supplieth, according to the operation in the measure of every part, maketh increase of the body, unto the edifying of itself in charity."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 122: 1-2, 3-4ab, 4cd-5",
      "reference": "Psalms 122: 1-2, 3-4ab, 4cd-5",
      "verses": [
        "R. (1) Let us go rejoicing to the house of the Lord.",
        "1 I rejoiced at the things that were said to me: We shall go into the house of the Lord.",
        "2 Our feet were standing in thy courts, O Jerusalem.",
        "R. Let us go rejoicing to the house of the Lord.",
        "3 Jerusalem, which is built as a city, which is compact together.",
        "4ab For thither did the tribes go up, the tribes of the Lord.",
        "R. Let us go rejoicing to the house of the Lord.",
        "4cd The testimony of Israel, to praise the name of the Lord.",
        "5 Because their seats have sat in judgment, seats upon the house of David.",
        "R. Let us go rejoicing to the house of the Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Ezekiel 33: 11",
      "reference": "Ezekiel 33: 11",
      "verses": [
        "R. Alleluia, alleluia.",
        "11 I take no pleasure in the death of the wicked man, says the Lord, but rather in his conversion that he may live.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 13: 1-9",
      "reference": "Luke 13: 1-9",
      "verses": [
        "1 And there were present, at that very time, some that told him of the Galileans, whose blood Pilate had mingled with their sacrifices.",
        "2 And he answering, said to them: Think you that these Galileans were sinners above all the men of Galilee, because they suffered such things?",
        "3 No, I say to you: but unless you shall do penance, you shall all likewise perish.",
        "4 Or those eighteen upon whom the tower fell in Siloe, and slew them: think you, that they also were debtors above all the men that dwelt in Jerusalem?",
        "5 No, I say to you; but except you do penance, you shall all likewise perish.",
        "6 He spoke also this parable: A certain man had a fig tree planted in his vineyard, and he came seeking fruit on it, and found none.",
        "7 And he said to the dresser of the vineyard: Behold, for these three years I come seeking fruit on this fig tree, and I find none. Cut it done therefore: why cumbereth it the ground?",
        "8 But he answering, said to him: Lord, let it alone this year also, until I dig about it, and dung it.",
        "9 And if happily it bear fruit: but if not, then after that thou shalt cut it down."
      ]
    }
  ]
}