{
  "date": "2026-10-11",
  "url": "https://www.catholicgallery.org/mass-reading/111026/",
  "title": "Daily Mass Readings for Sunday, 11 October 2026",
  "feast": "Twenty-Eighth Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 25: 6-10a",
      "reference": "Isaiah 25: 6-10a",
      "verses": [
        "6 And the Lord of hosts shall make unto all people in this mountain, a feast of fat things, a feast of wine, of fat things full of marrow, of wine purified from the lees.",
        "7 And he shall destroy in this mountain the face of the bond with which all people were tied, and the web that he began over all nations.",
        "8 He shall cast death down headlong for ever: and the Lord God shall wipe away tears from every face, and the reproach of his people he shall take away from off the whole earth: for the Lord hath spoken it.",
        "9 And they shall say in that day: Lo, this is our God, we have waited for him, and he will save us: this is the Lord, we have patiently waited for him, we shall rejoice and be joyfull in his salvation.",
        "10a For the hand of the Lord shall rest in this mountain."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 23: 1-3a, 3b-4, 5, 6",
      "reference": "Psalms 23: 1-3a, 3b-4, 5, 6",
      "verses": [
        "R. (6cd) I shall live in the house of the Lord all the days of my life.",
        "1 The Lord ruleth me: and I shall want nothing.",
        "2 He hath set me in a place of pasture. He hath brought me up, on the water of refreshment:",
        "3a He hath converted my soul.",
        "R. I shall live in the house of the Lord all the days of my life.",
        "3b He hath led me on the paths of justice, for his own name’s sake.",
        "4 For though I should walk in the midst of the shadow of death, I will fear no evils, for thou art with me. Thy rod and thy staff, they have comforted me.",
        "R. I shall live in the house of the Lord all the days of my life.",
        "5 Thou hast prepared a table before me against them that afflict me. Thou hast anointed my head with oil; and my chalice which inebriateth me, how goodly is it!",
        "R. I shall live in the house of the Lord all the days of my life.",
        "6 And thy mercy will follow me all the days of my life. And that I may dwell in the house of the Lord unto length of days.",
        "R. I shall live in the house of the Lord all the days of my life."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Philippians 4: 12-14, 19-20",
      "reference": "Philippians 4: 12-14, 19-20",
      "verses": [
        "12 I know both how to be brought low, and I know how to abound: (everywhere, and in all things I am instructed) both to be full, and to be hungry; both to abound, and to suffer need.",
        "13 I can do all these things in him who strengtheneth me.",
        "14 Nevertheless you have done well in communicating to my tribulation.",
        "19 And may my God supply all your want, according to his riches in glory in Christ Jesus.",
        "20 Now to God and our Father be glory world without end. Amen."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Ephesians 1: 17-18",
      "reference": "Ephesians 1: 17-18",
      "verses": [
        "R. Alleluia, alleluia.",
        "17-18 May the Father of our Lord Jesus Christ enlighten the eyes of our hearts, so that we may know what is the hope that belongs to our call.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 22: 1-14",
      "reference": "Matthew 22: 1-14",
      "verses": [
        "1 And Jesus answering, spoke again in parables to them, saying:",
        "2 The kingdom of heaven is likened to a king, who made a marriage for his son.",
        "3 And he sent his servants, to call them that were invited to the marriage; and they would not come.",
        "4 Again he sent other servants, saying: Tell them that were invited, Behold, I have prepared my dinner; my calves and fatlings are killed, and all things are ready: come ye to the marriage.",
        "5 But they neglected, and went their own ways, one to his farm, and another to his merchandise.",
        "6 And the rest laid hands on his servants, and having treated them contumeliously, put them to death.",
        "7 But when the king had heard of it, he was angry, and sending his armies, he destroyed those murderers, and burnt their city.",
        "8 Then he saith to his servants: The marriage indeed is ready; but they that were invited were not worthy.",
        "9 Go ye therefore into the highways; and as many as you shall find, call to the marriage.",
        "10 And his servants going forth into the ways, gathered together all that they found, both bad and good: and the marriage was filled with guests.",
        "11 And the king went in to see the guests: and he saw there a man who had not on a wedding garment.",
        "12 And he saith to him: Friend, how camest thou in hither not having a wedding garment? But he was silent.",
        "13 Then the king said to the waiters: Bind his hands and feet, and cast him into the exterior darkness: there shall be weeping and gnashing of teeth.",
        "14 For many are called, but few are chosen.",
        "Or",
        "1 And Jesus answering, spoke again in parables to them, saying:",
        "2 The kingdom of heaven is likened to a king, who made a marriage for his son.",
        "3 And he sent his servants, to call them that were invited to the marriage; and they would not come.",
        "4 Again he sent other servants, saying: Tell them that were invited, Behold, I have prepared my dinner; my calves and fatlings are killed, and all things are ready: come ye to the marriage.",
        "5 But they neglected, and went their own ways, one to his farm, and another to his merchandise.",
        "6 And the rest laid hands on his servants, and having treated them contumeliously, put them to death.",
        "7 But when the king had heard of it, he was angry, and sending his armies, he destroyed those murderers, and burnt their city.",
        "8 Then he saith to his servants: The marriage indeed is ready; but they that were invited were not worthy.",
        "9 Go ye therefore into the highways; and as many as you shall find, call to the marriage.",
        "10 And his servants going forth into the ways, gathered together all that they found, both bad and good: and the marriage was filled with guests."
      ]
    }
  ]
}