{
  "date": "2026-10-07",
  "url": "https://www.catholicgallery.org/mass-reading/071026/",
  "title": "Daily Mass Readings for Wednesday, 7 October 2026",
  "feast": "Our Lady of the Rosary Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Galatians 2: 1-2, 7-14",
      "reference": "Galatians 2: 1-2, 7-14",
      "verses": [
        "1 Then, after fourteen years, I went up again to Jerusalem with Barnabas, taking Titus also with me.",
        "2 And I went up according to revelation; and communicated to them the gospel, which I preach among the Gentiles, but apart to them who seemed to be some thing: lest perhaps I should run, or had run in vain.",
        "7 But contrariwise, when they had seen that to me was committed the gospel of the uncircumcision, as to Peter was that of the circumcision.",
        "8 (For he who wrought in Peter to the apostleship of the circumcision, wrought in me also among the Gentiles.)",
        "9 And when they had known the grace that was given to me, James and Cephas and John, who seemed to be pillars, gave to me and Barnabas the right hands of fellowship: that we should go unto the Gentiles, and they unto the circumcision:",
        "10 Only that we should be mindful of the poor: which same thing also I was careful to do.",
        "11 But when Cephas was come to Antioch, I withstood him to the face, because he was to be blamed.",
        "12 For before that some came from James, he did eat with the Gentiles: but when they were come, he withdrew and separated himself, fearing them who were of the circumcision.",
        "13 And to his dissimulation the rest of the Jews consented, so that Barnabas also was led by them into that dissimulation.",
        "14 But when I saw that they walked not uprightly unto the truth of the gospel, I said to Cephas before them all: If thou, being a Jew, livest after the manner of the Gentiles, and not as the Jews do, how dost thou compel the Gentiles to live as do the Jews?"
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 117: 1bc, 2",
      "reference": "Psalms 117: 1bc, 2",
      "verses": [
        "R. Go out to all the world, and tell the Good News.",
        "1 O praise the Lord, all ye nations: praise him, all ye people.",
        "R. Go out to all the world, and tell the Good News.",
        "2 For his mercy is confirmed upon us: and the truth of the Lord remaineth for ever.",
        "R. Go out to all the world, and tell the Good News."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Romans 8: 15bc",
      "reference": "Romans 8: 15bc",
      "verses": [
        "R. Alleluia, alleluia.",
        "15bc You have received a spirit of adoption as sons through which we cry: Abba! Father!",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 11: 1-4",
      "reference": "Luke 11: 1-4",
      "verses": [
        "1 And it came to pass, that as he was in a certain place praying, when he ceased, one of his disciples said to him: Lord, teach us to pray, as John also taught his disciples.",
        "2 And he said to them: When you pray, say: Father, hallowed be thy name. Thy kingdom come.",
        "3 Give us this day our daily bread.",
        "4 And forgive us our sins, for we also forgive every one that is indebted to us. And lead us not into temptation."
      ]
    }
  ]
}