{
  "date": "2026-10-04",
  "url": "https://www.catholicgallery.org/mass-reading/041026/",
  "title": "Daily Mass Readings for Sunday, 4 October 2026",
  "feast": "Twenty-Seventh Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 5: 1-7",
      "reference": "Isaiah 5: 1-7",
      "verses": [
        "1 I will sing to my beloved the canticle of my cousin concerning his vineyard. My beloved had a vineyard on a hill in a fruitful place.",
        "2 And he fenced it in, and picked the stones out of it, and planted it with the choicest vines, and built a tower in the midst thereof, and set up a winepress therein: and he looked that it should bring forth grapes, and it broutht forth wild grapes.",
        "3 And now, O ye inhabitants of Jerusalem, and ye men of Juda, judge between me and my vineyard.",
        "4 What is there that I ought to do more to my vineyard, that I have not done to it?",
        "5 And now I will shew you what I will do to my vineyard. I will take away the hedge thereof, and it shall be wasted: I will break down the wall thereof, and it shall be trodden down.",
        "6 And I will make it desolate: it shall not be pruned, and it shall not be digged: but briers and thorns shall come up: and I will command the clouds to rain no rain upon it.",
        "7 For the vineyard of the Lord of hosts is the house of Israel: and the man of Juda, his pleasant plant: and I looked that he should do judgment, and behold iniquity: and do justice, and behold a cry."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 80: 9, 12, 13-14, 15-16, 19-20",
      "reference": "Psalms 80: 9, 12, 13-14, 15-16, 19-20",
      "verses": [
        "R. (Is 5:7a) The vineyard of the Lord is the house of Israel.",
        "9 Thou hast brought a vineyard out of Egypt: thou hast cast cut the Gentiles and planted it.",
        "12 It stretched forth its branches unto the sea, and its boughs unto the river.",
        "R. The vineyard of the Lord is the house of Israel.",
        "13 Why hast thou broken down the hedge thereof, so that all they who pass by the way do pluck it?",
        "14 The boar out of the wood hath laid it waste: and a singular wild beast hath devoured it.",
        "R. The vineyard of the Lord is the house of Israel.",
        "15 Turn again, O God of hosts, look down from heaven, and see, and visit this vineyard:",
        "16 And perfect the same which thy right hand hath planted: and upon the son of man whom thou hast confirmed for thyself.",
        "R. The vineyard of the Lord is the house of Israel.",
        "19 And we depart not from thee, thou shalt quicken us: and we will call upon thy name.",
        "20 O Lord God of hosts, convert us: and shew thy face, and we shall be saved.",
        "R. The vineyard of the Lord is the house of Israel."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Philippians 4: 6-9",
      "reference": "Philippians 4: 6-9",
      "verses": [
        "6 Be nothing solicitous; but in every thing, by prayer and supplication, with thanksgiving, let your petitions be made known to God.",
        "7 And the peace of God, which surpasseth all understanding, keep your hearts and minds in Christ Jesus.",
        "8 For the rest, brethren, whatsoever things are true, whatsoever modest, whatsoever just, whatsoever holy, whatsoever lovely, whatsoever of good fame, if there be any virtue, if any praise of discipline, think on these things.",
        "9 The things which you have both learned, and received, and heard, and seen in me, these do ye, and the God of peace shall be with you."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 15: 16",
      "reference": "John 15: 16",
      "verses": [
        "R. Alleluia, alleluia.",
        "16 I have chosen you from the world, says the Lord, to go and bear fruit that will remain.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 21: 33-43",
      "reference": "Matthew 21: 33-43",
      "verses": [
        "33 Hear ye another parable. There was a man an householder, who planted a vineyard, and made a hedge round about it, and dug in it a press, and built a tower, and let it out to husbandmen; and went into a strange country.",
        "34 And when the time of the fruits drew nigh, he sent his servants to the husbandmen that they might receive the fruits thereof.",
        "35 And the husbandmen laying hands on his servants, beat one, and killed another, and stoned another.",
        "36 Again he sent other servants more than the former; and they did to them in like manner.",
        "37 And last of all he sent to them his son, saying: They will reverence my son.",
        "38 But the husbandmen seeing the son, said among themselves: This is the heir: come, let us kill him, and we shall have his inheritance.",
        "39 And taking him, they cast him forth out of the vineyard, and killed him.",
        "40 When therefore the lord of the vineyard shall come, what will he do to those husbandmen?",
        "41 They say to him: He will bring those evil men to an evil end; and will let out his vineyard to other husbandmen, that shall render him the fruit in due season.",
        "42 Jesus saith to them: Have you never read in the Scriptures: The stone which the builders rejected, the same is become the head of the corner? By the Lord this has been done; and it is wonderful in our eyes.",
        "43 Therefore I say to you, that the kingdom of God shall be taken from you, and shall be given to a nation yielding the fruits thereof."
      ]
    }
  ]
}