{
  "date": "2026-10-20",
  "url": "https://www.catholicgallery.org/mass-reading/201026/",
  "title": "Daily Mass Readings for Tuesday, 20 October 2026",
  "feast": "Ordinary Weekday/ Paul of the Cross, Priest, Religious Founder",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ephesians 2: 12-22",
      "reference": "Ephesians 2: 12-22",
      "verses": [
        "12 That you were at that time without Christ, being aliens from the conversation of Israel, and strangers to the testament, having no hope of the promise, and without God in this world.",
        "13 But now in Christ Jesus, you, who some time were afar off, are made nigh by the blood of Christ.",
        "14 For he is our peace, who hath made both one, and breaking down the middle wall of partition, the enmities in his flesh:",
        "15 Making void the law of commandments contained in decrees; that he might make the two in himself into one new man, making peace;",
        "16 And might reconcile both to God in one body by the cross, killing the enmities in himself.",
        "17 And coming, he preached peace to you that were afar off, and peace to them that were nigh.",
        "18 For by him we have access both in one Spirit to the Father.",
        "19 Now therefore you are no more strangers and foreigners; but you are fellow citizens with the saints, and the domestics of God,",
        "20 Built upon the foundation of the apostles and prophets, Jesus Christ himself being the chief corner stone:",
        "21 In whom all the building, being framed together, groweth up into an holy temple in the Lord.",
        "22 In whom you also are built together into an habitation of God in the Spirit."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 85: 9ab-10, 11-12, 13-14",
      "reference": "Psalms 85: 9ab-10, 11-12, 13-14",
      "verses": [
        "R. (9) The Lord speaks of peace to his people.",
        "9ab I will hear what the Lord God will speak in me: for he will speak peace unto his people.",
        "10 Surely his salvation is near to them that fear him: that glory may dwell in our land.",
        "R. The Lord speaks of peace to his people.",
        "11 Mercy and truth have met each other: justice and peace have kissed.",
        "12 Truth is sprung out of the earth: and justice hath looked down from heaven.",
        "R. The Lord speaks of peace to his people.",
        "13 For the Lord will give goodness: and our earth shall yield her fruit.",
        "14 Justice shall walk before him: and shall set his steps in the way.",
        "R. The Lord speaks of peace to his people."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 21: 36",
      "reference": "Luke 21: 36",
      "verses": [
        "R. Alleluia, alleluia.",
        "36 Be vigilant at all times and pray that you may have the strength to stand before the Son of Man.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 12: 35-38",
      "reference": "Luke 12: 35-38",
      "verses": [
        "35 Let your loins be girt, and lamps burning in your hands.",
        "36 And you yourselves like to men who wait for their lord, when he shall return from the wedding; that when he cometh and knocketh, they may open to him immediately.",
        "37 Blessed are those servants, whom the Lord when he cometh, shall find watching. Amen I say to you, that he will gird himself, and make them sit down to meat, and passing will minister unto them.",
        "38 And if he shall come in the second watch, or come in the third watch, and find them so, blessed are those servants."
      ]
    }
  ]
}