{
  "date": "2026-10-10",
  "url": "https://www.catholicgallery.org/mass-reading/101026/",
  "title": "Daily Mass Readings for Saturday, 10 October 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Galatians 3: 22-29",
      "reference": "Galatians 3: 22-29",
      "verses": [
        "22 But the scripture hath concluded all under sin, that the promise, by the faith of Jesus Christ, might be given to them that believe.",
        "23 But before the faith came, we were kept under the law shut up, unto that faith which was to be revealed.",
        "24 Wherefore the law was our pedagogue in Christ, that we might be justified by faith.",
        "25 But after the faith is come, we are no longer under a pedagogue.",
        "26 For you are all the children of God by faith, in Christ Jesus.",
        "27 For as many of you as have been baptized in Christ, have put on Christ.",
        "28 There is neither Jew nor Greek: there is neither bond nor free: there is neither male nor female. For you are all one in Christ Jesus.",
        "29 And if you be Christ’s, then are you the seed of Abraham, heirs according to the promise."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 105: 2-3, 4-5, 6-7",
      "reference": "Psalms 105: 2-3, 4-5, 6-7",
      "verses": [
        "R. (8a) The Lord remembers his covenant for ever.",
        "or",
        "R. Alleluia.",
        "2 Sing to him, yea sing praises to him: relate all his wondrous works.",
        "3 Glory ye in his holy name: let the heart of them rejoice that seek the Lord.",
        "R. The Lord remembers his covenant for ever.",
        "or",
        "R. Alleluia.",
        "4 Seek ye the Lord, and be strengthened: seek his face evermore.",
        "5 Remember his marvellous works which he hath done; his wonders, and the judgments of his mouth.",
        "R. The Lord remembers his covenant for ever.",
        "or",
        "R. Alleluia.",
        "6 O ye seed of Abraham his servant; ye sons of Jacob his chosen.",
        "7 He is the Lord our God: his judgments are in all the earth.",
        "R. The Lord remembers his covenant for ever.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 11: 28",
      "reference": "Luke 11: 28",
      "verses": [
        "R. Alleluia, alleluia.",
        "28 Blessed are those who hear the word of God and observe it.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 11: 27-28",
      "reference": "Luke 11: 27-28",
      "verses": [
        "27 And it came to pass, as he spoke these things, a certain woman from the crowd, lifting up her voice, said to him: Blessed is the womb that bore thee, and the paps that gave thee suck.",
        "28 But he said: Yea rather, blessed are they who hear the word of God, and keep it."
      ]
    }
  ]
}