{
  "date": "2026-10-23",
  "url": "https://www.catholicgallery.org/mass-reading/231026/",
  "title": "Daily Mass Readings for Friday, 23 October 2026",
  "feast": "Ordinary Weekday/ John of Capistrano, Priest",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ephesians 4: 1-6",
      "reference": "Ephesians 4: 1-6",
      "verses": [
        "1 I therefore, a prisoner in the Lord, beseech you that you walk worthy of the vocation in which you are called,",
        "2 With all humility and mildness, with patience, supporting one another in charity.",
        "3 Careful to keep the unity of the Spirit in the bond of peace.",
        "4 One body and one Spirit; as you are called in one hope of your calling.",
        "5 One Lord, one faith, one baptism.",
        "6 One God and Father of all, who is above all, and through all, and in us all."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 24: 1-2, 3-4ab, 5-6",
      "reference": "Psalms 24: 1-2, 3-4ab, 5-6",
      "verses": [
        "R. (6) Lord, this is the people that longs to see your face.",
        "1 On the first day of the week, The earth is the Lord’s and the fulness thereof: the world, and all they that dwell therein.",
        "2 For he hath founded it upon the seas; and hath prepared it upon the rivers.",
        "R. Lord, this is the people that longs to see your face.",
        "3 Who shall ascend into the mountain of the Lord: or who shall stand in his holy place?",
        "4ab The innocent in hands, and clean of heart, who hath not taken his soul in vain.",
        "R. Lord, this is the people that longs to see your face.",
        "5 He shall receive a blessing from the Lord, and mercy from God his Saviour.",
        "6 This is the generation of them that seek him, of them that seek the face of the God of Jacob.",
        "R. Lord, this is the people that longs to see your face."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 11: 25",
      "reference": "Matthew 11: 25",
      "verses": [
        "R. Alleluia, alleluia.",
        "25 Blessed are you, Father, Lord of heaven and earth; you have revealed to little ones the mysteries of the Kingdom.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 12: 54-59",
      "reference": "Luke 12: 54-59",
      "verses": [
        "54 And he said also to the multitudes: When you see a cloud rising from the west, presently you say: A shower is coming: and so it happeneth:",
        "55 And when ye see the south wind blow, you say: There will be heat: and it cometh to pass.",
        "56 You hypocrites, you know how to discern the face of the heaven and of the earth: but how is it that you do not discern this time?",
        "57 And why even of yourselves, do you not judge that which is just?",
        "58 And when thou goest with thy adversary to the prince, whilst thou art in the way, endeavour to be delivered from him: lest perhaps he draw thee to the judge, and the judge deliver thee to the exacter, and the exacter cast thee into prison.",
        "59 I say to thee, thou shalt not go out thence, until thou pay the very last mite."
      ]
    }
  ]
}