{
  "date": "2026-10-28",
  "url": "https://www.catholicgallery.org/mass-reading/281026/",
  "title": "Daily Mass Readings for Wednesday, 28 October 2026",
  "feast": "Simon and Jude, Apostles Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ephesians 2: 19-22",
      "reference": "Ephesians 2: 19-22",
      "verses": [
        "19 Now therefore you are no more strangers and foreigners; but you are fellow citizens with the saints, and the domestics of God,",
        "20 Built upon the foundation of the apostles and prophets, Jesus Christ himself being the chief corner stone:",
        "21 In whom all the building, being framed together, groweth up into an holy temple in the Lord.",
        "22 In whom you also are built together into an habitation of God in the Spirit."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 19: 2-3, 4-5",
      "reference": "Psalms 19: 2-3, 4-5",
      "verses": [
        "R. (5a) Their message goes out through all the earth.",
        "2 The heavens shew forth the glory of God, and the firmament declareth the work of his hands.",
        "3 Day to day uttereth speech, and night to night sheweth knowledge.",
        "R. Their message goes out through all the earth.",
        "4 There are no speeches nor languages, where their voices are not heard.",
        "5 Their sound hath gone forth into all the earth: and their words unto the ends of the world.",
        "R. Their message goes out through all the earth."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: See Te Deum",
      "reference": "See Te Deum",
      "verses": [
        "R. Alleluia, alleluia.",
        "We praise you, O God, we acclaim you as Lord; the glorious company of Apostles praise you.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 6: 12-16",
      "reference": "Luke 6: 12-16",
      "verses": [
        "12 And it came to pass in those days, that he went out into a mountain to pray, and he passed the whole night in the prayer of God.",
        "13 And when day was come, he called unto him his disciples; and he chose twelve of them (whom also he named apostles).",
        "14 Simon, whom he surnamed Peter, and Andrew his brother, James and John, Philip and Bartholomew,",
        "15 Matthew and Thomas, James the son of Alpheus, and Simon who is called Zelotes,",
        "16 And Jude, the brother of James, and Judas Iscariot, who was the traitor."
      ]
    }
  ]
}