{
  "date": "2026-10-15",
  "url": "https://www.catholicgallery.org/mass-reading/151026/",
  "title": "Daily Mass Readings for Thursday, 15 October 2026",
  "feast": "Teresa of Avila, Virgin, Religious, Doctor Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Ephesians 1: 1-10",
      "reference": "Ephesians 1: 1-10",
      "verses": [
        "1 Paul, an apostle of Jesus Christ, by the will of God, to all the saints who are at Ephesus, and to the faithful in Christ Jesus.",
        "2 Grace be to you, and peace from God the Father, and from the Lord Jesus Christ.",
        "3 Blessed be the God and Father of our Lord Jesus Christ, who hath blessed us with spiritual blessings in heavenly places, in Christ:",
        "4 As he chose us in him before the foundation of the world, that we should be holy and unspotted in his sight in charity.",
        "5 Who hath predestinated us unto the adoption of children through Jesus Christ unto himself: according to the purpose of his will:",
        "6 Unto the praise of the glory of his grace, in which he hath graced us in his beloved son.",
        "7 In whom we have redemption through his blood, the remission of sins, according to the riches of his grace,",
        "8 Which hath superabounded in us in all wisdom and prudence,",
        "9 That he might make known unto us the mystery of his will, according to his good pleasure, which he hath purposed in him,",
        "10 In the dispensation of the fulness of times, to re-establish all things in Christ, that are in heaven and on earth, in him."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 98: 1, 2-3ab, 3cd-4, 5-6",
      "reference": "Psalms 98: 1, 2-3ab, 3cd-4, 5-6",
      "verses": [
        "R. (2a) The Lord has made known his salvation.",
        "1 Sing ye to the Lord a new canticle: because he hath done wonderful things. His right hand hath wrought for him salvation, and his arm is holy.",
        "R. The Lord has made known his salvation.",
        "2 The Lord hath made known his salvation: he hath revealed his justice in the sight of the Gentiles.",
        "3ab He hath remembered his mercy his truth toward the house of Israel.",
        "R. The Lord has made known his salvation.",
        "3cd All the ends of the earth have seen the salvation of our God.",
        "4 Sing joyfully to God, all the earth; make melody, rejoice and sing.",
        "R. The Lord has made known his salvation.",
        "5 Sing praise to the Lord on the harp, on the harp, and with the voice of a psalm:",
        "6 With long trumpets, and sound of comet. Make a joyful noise before the Lord our king:",
        "R. The Lord has made known his salvation."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 6",
      "reference": "John 14: 6",
      "verses": [
        "R. Alleluia, alleluia.",
        "6 I am the way and the truth and the life, says the Lord; no one comes to the Father except through me.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 11: 47-54",
      "reference": "Luke 11: 47-54",
      "verses": [
        "47 Woe to you who build the monuments of the prophets: and your fathers killed them.",
        "48 Truly you bear witness that you consent to the doings of your fathers: for they indeed killed them, and you build their sepulchres.",
        "49 For this cause also the wisdom of God said: I will send to them prophets and apostles; and some of them they will kill and persecute.",
        "50 That the blood of all the prophets which was shed from the foundation of the world, may be required of this generation,",
        "51 From the blood of Abel unto the blood of Zacharias, who was slain between the alter and the temple: Yea I say to you, It shall be required of this generation.",
        "52 Woe to you lawyers, for you have taken away the key of knowledge: you yourselves have not entered in, and those that were entering in, you have hindered.",
        "53 And as he was saying these things to them, the Pharisees and the lawyers began violently to urge him, and to oppress his mouth about many things,",
        "54 Lying in wait for him, and seeking to catch something from his mouth, that they might accuse him."
      ]
    }
  ]
}