{
  "date": "2026-10-25",
  "url": "https://www.catholicgallery.org/mass-reading/251026/",
  "title": "Daily Mass Readings for Sunday, 25 October 2026",
  "feast": "Thirtieth Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Exodus 22: 20-26",
      "reference": "Exodus 22: 20-26",
      "verses": [
        "20 Thou shalt not molest a stranger, nor afflict him: for yourselves also were strangers in the land of Egypt.",
        "21 You shall not hurt a widow or an orphan.",
        "22 If you hurt them they will cry out to me, and I will hear their cry:",
        "23 And my rage shall be enkindled, and I will strike you with the sword, and your wives shall be widows, and your children fatherless.",
        "24 If thou lend money to any of my people that is poor, that dwelleth with thee, thou shalt not be hard upon them as an extortioner, nor oppress them with usuries.",
        "25 If thou take of thy neighbour a garment in pledge, thou shalt give it him again before sunset.",
        "26 For that same is the only thing wherewith he is covered, the clothing of his body, neither hath he any other to sleep in: if he cry to me, I will hear him, because I am compassionate."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 18: 2-3, 3-4, 47, 51",
      "reference": "Psalms 18: 2-3, 3-4, 47, 51",
      "verses": [
        "R. (2) I love you, Lord, my strength.",
        "2 I will love thee, O Lord, my strength:",
        "3ab The Lord is my firmament, my refuge, and my deliverer.",
        "R. I love you, Lord, my strength.",
        "3cd My God is my helper, and in him will I put my trust. My protector and the horn of my salvation, and my support.",
        "4 Praising I will call upon the Lord: and I shall be saved from my enemies.",
        "R. I love you, Lord, my strength.",
        "47 The Lord liveth, and blessed be my God, and let the God of my salvation be exalted:",
        "51 Giving great deliverance to his king, and shewing mercy to David his anointed: and to his seed for ever.",
        "R. I love you, Lord, my strength."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First Thessalonians 1: 5c-10",
      "reference": "First Thessalonians 1: 5c-10",
      "verses": [
        "5c As you know what manner of men we have been among you for your sakes.",
        "6 And you became followers of us, and of the Lord; receiving the word in much tribulation, with joy of the Holy Ghost:",
        "7 So that you were made a pattern to all that believe in Macedonia and in Achaia.",
        "8 For from you was spread abroad the word of the Lord, not only in Macedonia, and in Achaia, but also in every place, your faith which is towards God, is gone forth, so that we need not to speak any thing.",
        "9 For they themselves relate of us, what manner of entering in we had unto you; and how you turned to God from idols, to serve the living and true God.",
        "10 And to wait for his Son from heaven (whom he raised up from the dead,) Jesus, who hath delivered us from the wrath to come."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 23",
      "reference": "John 14: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Whoever loves me will keep my word, says the Lord, and my Father will love him and we will come to him.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 22: 34-40",
      "reference": "Matthew 22: 34-40",
      "verses": [
        "34 But the Pharisees hearing that he had silenced the Sadducees, came together:",
        "35 And one of them, a doctor of the law, asking him, tempting him:",
        "36 Master, which is the greatest commandment in the law?",
        "37 Jesus said to him: Thou shalt love the Lord thy God with thy whole heart, and with thy whole soul, and with thy whole mind.",
        "38 This is the greatest and the first commandment.",
        "39 And the second is like to this: Thou shalt love thy neighbour as thyself.",
        "40 On these two commandments dependeth the whole law and the prophets."
      ]
    }
  ]
}