{
  "date": "2026-12-06",
  "url": "https://www.catholicgallery.org/mass-reading/061226/",
  "title": "Daily Mass Readings for Sunday, 6 December 2026",
  "feast": "Second Sunday of Advent",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 40: 1-5, 9-11",
      "reference": "Isaiah 40: 1-5, 9-11",
      "verses": [
        "1 Be comforted, be comforted, my people, saith your God.",
        "2 Speak ye to the heart of Jerusalem, and call to her: for her evil is come to an end, her iniquity is forgiven: she hath received of the hand of the Lord double for all her sins.",
        "3 The voice of one crying in the desert: Prepare ye the way of the Lord, make straight in the wilderness the paths of our God.",
        "4 Every valley shall be exalted, and every mountain and hill shall be made low, and the crooked shall become straight, and the rough ways plain.",
        "5 And the glory of the Lord shall be revealed, and all flesh together shall see, that the mouth of the Lord hath spoken.",
        "9 Get thee up upon a high mountain, thou that bringest good tidings to Sion: lift up thy voice with strength, thou that bringest good tidings to Jerusalem: lift it up, fear not. Say to the cities of Juda: Behold your God:",
        "10 Behold the Lord God shall come with strength, and his arm shall rule: Behold his reward is with him and his work is before him.",
        "11 He shall feed his flock like a shepherd: he shall gather together the lambs with his arm, and shall take them up in his bosom, and he himself shall carry them that are with young."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 85: 9-10, 11-12, 13-14",
      "reference": "Psalms 85: 9-10, 11-12, 13-14",
      "verses": [
        "R. (8) Lord, let us see your kindness, and grant us your salvation.",
        "9 I will hear what the Lord God will speak in me: for he will speak peace unto his people: And unto his saints: and unto them that are converted to the heart.",
        "10 Surely his salvation is near to them that fear him: that glory may dwell in our land.",
        "R. Lord, let us see your kindness, and grant us your salvation.",
        "11 Mercy and truth have met each other: justice and peace have kissed.",
        "12 Truth is sprung out of the earth: and justice hath looked down from heaven.",
        "R. Lord, let us see your kindness, and grant us your salvation.",
        "13 For the Lord will give goodness: and our earth shall yield her fruit.",
        "14 Justice shall walk before him: and shall set his steps in the way.",
        "R. Lord, let us see your kindness, and grant us your salvation."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Second Peter 3: 8-14",
      "reference": "Second Peter 3: 8-14",
      "verses": [
        "8 But of this one thing be not ignorant, my beloved, that one day with the Lord is as a thousand years, and a thousand years as one day.",
        "9 The Lord delayeth not his promise, as some imagine, but dealeth patiently for your sake, not willing that any should perish, but that all should return to penance.",
        "10 But the day of the Lord shall come as a thief, in which the heavens shall pass away with great violence, and the elements shall be melted with heat, and the earth and the works which are in it, shall be burnt up.",
        "11 Seeing then that all these things are to be dissolved, what manner of people ought you to be in holy conversation and godliness?",
        "12 Looking for and hasting unto the coming of the day of the Lord, by which the heavens being on fire shall be dissolved, and the elements shall melt with the burning heat?",
        "13 But we look for new heavens and a new earth according to his promises, in which justice dwelleth.",
        "14 Wherefore, dearly beloved, waiting for these things, be diligent that you may be found before him unspotted and blameless in peace."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 3: 4, 6",
      "reference": "Luke 3: 4, 6",
      "verses": [
        "R. Alleluia, alleluia.",
        "4, 6 Prepare the way of the Lord, make straight his paths: All flesh shall see the salvation of God.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 1: 1-8",
      "reference": "Mark 1: 1-8",
      "verses": [
        "1 The beginning of the gospel of Jesus Christ, the Son of God.",
        "2 As it is written in Isaias the prophet: Behold I send my angel before thy face, who shall prepare the way before thee.",
        "3 A voice of one crying in the desert: Prepare ye the way of the Lord, make straight his paths.",
        "4 John was in the desert baptizing, and preaching the baptism of penance, unto remission of sins.",
        "5 And there went out to him all the country of Judea, and all they of Jerusalem, and were baptized by him in the river of Jordan, confessing their sins.",
        "6 And John was clothed with camel’s hair, and a leathern girdle about his loins; and he ate locusts and wild honey.",
        "7 And he preached, saying: There cometh after me one mightier than I, the latchet of whose shoes I am not worthy to stoop down and loose.",
        "8 I have baptized you with water; but he shall baptize you with the Holy Ghost."
      ]
    }
  ]
}