{
  "date": "2026-12-26",
  "url": "https://www.catholicgallery.org/mass-reading/261226/",
  "title": "Daily Mass Readings for Saturday, 26 December 2026",
  "feast": "Stephen, Protomartyr Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Acts 6: 8-10; 7: 54-59",
      "reference": "Acts 6: 8-10; 7: 54-59",
      "verses": [
        "8 And Stephen, full of grace and fortitude, did great wonders and signs among the people.",
        "9 Now there arose some of that which is called the synagogue of the Libertines, and of the Cyrenians, and of the Alexandrians, and of them that were of Cilicia and Asia, disputing with Stephen.",
        "10 And they were not able to resist the wisdom and the spirit that spoke.",
        "7:54 Now hearing these things, they were cut to the heart, and they gnashed with their teeth at him.",
        "55 But he, being full of the Holy Ghost, looking up steadfastly to heaven, saw the glory of God, and Jesus standing on the right hand of God.",
        "56 And he said: Behold, I see the heavens opened, and the Son of man standing on the right hand of God.",
        "57 And they crying out with a loud voice, stopped their ears, and with one accord ran violently upon him.",
        "58 And casting him forth without the city, they stoned him; and the witnesses laid down their garments at the feet of a young man, whose name was Saul.",
        "59 And they stoned Stephen, invoking, and saying: Lord Jesus, receive my spirit."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 31: 3cd-4, 6 and 8ab, 16bc and 17",
      "reference": "Psalms 31: 3cd-4, 6 and 8ab, 16bc and 17",
      "verses": [
        "R. (6) Into your hands, O Lord, I commend my spirit.",
        "3cd Be thou unto me a God, a protector, and a house of refuge, to save me.",
        "4 For thou art my strength and my refuge; and for thy name’s sake thou wilt lead me, and nourish me.",
        "R. Into your hands, O Lord, I commend my spirit.",
        "6 Into thy hands I commend my spirit: thou hast redeemed me, O Lord, the God of truth.",
        "8ab I will be glad and rejoice in thy mercy.",
        "R. Into your hands, O Lord, I commend my spirit.",
        "16bc Deliver me out of the hands of my enemies; and from them that persecute me.",
        "17 Make thy face to shine upon thy servant; save me in thy mercy.",
        "R. Into your hands, O Lord, I commend my spirit."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Psalms 118: 26a, 27a",
      "reference": "Psalms 118: 26a, 27a",
      "verses": [
        "R. Alleluia, alleluia.",
        "26a, 27a Blessed is he who comes in the name of the LORD: the LORD is God and has given us light.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 10: 17-22",
      "reference": "Matthew 10: 17-22",
      "verses": [
        "17 But beware of men. For they will deliver you up in councils, and they will scourge you in their synagogues.",
        "18 And you shall be brought before governors, and before kings for my sake, for a testimony to them and to the Gentiles:",
        "19 But when they shall deliver you up, take no thought how or what to speak: for it shall be given you in that hour what to speak.",
        "20 For it is not you that speak, but the Spirit of your Father that speaketh in you.",
        "21 The brother also shall deliver up the brother to death, and the father the son: and the children shall rise up against their parents, and shall put them to death.",
        "22 And you shall be hated by all men for my name’s sake: but he that shall persevere unto the end, he shall be saved."
      ]
    }
  ]
}