{
  "date": "2026-12-27",
  "url": "https://www.catholicgallery.org/mass-reading/271226/",
  "title": "Daily Mass Readings for Sunday, 27 December 2026",
  "feast": "Holy Family Feast",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Genesis 15: 1-6; 21: 1-3 or Sirach 3: 2-6, 12-14",
      "reference": "Genesis 15: 1-6; 21: 1-3 or Sirach 3: 2-6, 12-14",
      "verses": [
        "1 Now when these things were done, the word of the Lord came to Abram by a vision, saying: Fear not, Abram, I am thy protector, and thy reward exceeding great.",
        "2 And Abram said: Lord God, what wilt thou give me? I shall go without children: and the son of the steward of my house is this Damascus Eliezer.",
        "3 And Abram added: But to me thou hast not given seed: and lo my servant, born in my house, shall be my heir.",
        "4 And immediately the word of the Lord came to him, saying: He shall not be thy heir: but he that shall come out of thy bowels, him shalt thou have for thy heir.",
        "5 And he brought him forth abroad, and said to him: Look up to heaven and number the stars, if thou canst. And he said to him: So shall thy seed be.",
        "6 Abram believed God, and it was reputed to him unto justice.",
        "21:1 And the Lord visited Sara, as he had promised: and fulfilled what he had spoken.",
        "2 And she conceived and bore a son in her old age, at the time that God had foretold her.",
        "3 And Abraham called the name of his son, whom Sara bore him, Isaac.",
        "Or",
        "2 For God hath made the father honourable to the children: and seeking the judgment of the mothers, hath confirmed it upon the children.",
        "3 He that loveth God, shall obtain pardon for his sins by prayer, and shall refrain himself from them, and shall be heard in the prayer of days.",
        "4 And he that honoureth his mother is as one that layeth up a treasure.",
        "5 He that honoureth his father shall have joy in his own children, and in the day of his prayer he shall be heard.",
        "6 He that honoureth his father shall enjoy a long life: and he that obeyeth the father, shall be a comfort to his mother.",
        "12 Son, support the old age of thy father, and grieve him not in his life;",
        "13 And if his understanding fail, have patience with him, and despise him not when thou art in thy strength: for the relieving of the father shall not be forgotten.",
        "14 For good shall be repaid to thee for the sin of thy mother."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 105: 1-2, 3-4, 5-6, 8-9 or Psalms 128: 1-2, 3, 4-5",
      "reference": "Psalms 105: 1-2, 3-4, 5-6, 8-9 or Psalms 128: 1-2, 3, 4-5",
      "verses": [
        "R. (7a , 8a) The Lord remembers his covenant for ever.",
        "1 Alleluia. Give glory to the Lord, and call upon his name: declare his deeds among the Gentiles.",
        "2 Sing to him, yea sing praises to him: relate all his wondrous works.",
        "R. The Lord remembers his covenant for ever.",
        "3 Glory ye in his holy name: let the heart of them rejoice that seek the Lord.",
        "4 Seek ye the Lord, and be strengthened: seek his face evermore.",
        "R. The Lord remembers his covenant for ever.",
        "5 Remember his marvellous works which he hath done; his wonders, and the judgments of his mouth.",
        "6 O ye seed of Abraham his servant; ye sons of Jacob his chosen.",
        "R. The Lord remembers his covenant for ever.",
        "8 He hath remembered his covenant for ever: the word which he commanded to a thousand generations.",
        "9 Which he made to Abraham; and his oath to Isaac:",
        "R. The Lord remembers his covenant for ever.",
        "Or",
        "R. (1) Blessed are those who fear the Lord and walk in his ways.",
        "1 Blessed are all they that fear the Lord: that walk in his ways.",
        "2 For thou shalt eat the labours of thy hands: blessed art thou, and it shall be well with thee.",
        "R. Blessed are those who fear the Lord and walk in his ways.",
        "3 Thy wife as a fruitful vine, on the sides of thy house.",
        "R. Blessed are those who fear the Lord and walk in his ways.",
        "4 Behold, thus shall the man be blessed that feareth the Lord.",
        "5 May the Lord bless thee out of Sion: and mayest thou see the good things of Jerusalem all the days of thy life.",
        "R. Blessed are those who fear the Lord and walk in his ways."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Hebrews 11: 8, 11-12, 17-19 or Colossians 3: 12-21",
      "reference": "Hebrews 11: 8, 11-12, 17-19 or Colossians 3: 12-21",
      "verses": [
        "8 By faith he that is called Abraham, obeyed to go out into a place which he was to receive for an inheritance; and he went out, not knowing whither he went.",
        "11 By faith also Sara herself, being barren, received strength to conceive seed, even past the time of age; because she believed that he was faithful who had promised,",
        "12 For which cause there sprung even from one (and him as good as dead) as the stars of heaven in multitude, and as the sand which is by the sea shore innumerable.",
        "17 By faith Abraham, when he was tried, offered Isaac: and he that had received the promises, offered up his only begotten son;",
        "18 (To whom it was said: In Isaac shall thy seed be called.)",
        "19 Accounting that God is able to raise up even from the dead. Whereupon also he received him for a parable.",
        "Or",
        "12 Put ye on therefore, as the elect of God, holy, and beloved, the bowels of mercy, benignity, humility, modesty, patience:",
        "13 Bearing with one another, and forgiving one another, if any have a complaint against another: even as the Lord hath forgiven you, so do you also.",
        "14 But above all these things have charity, which is the bond of perfection:",
        "15 And let the peace of Christ rejoice in your hearts, wherein also you are called in one body: and be ye thankful.",
        "16 Let the word of Christ dwell in you abundantly, in all wisdom: teaching and admonishing one another in psalms, hymns, and spiritual canticles, singing in grace in your hearts to God.",
        "17 All whatsoever you do in word or in work, do all in the name of the Lord Jesus Christ, giving thanks to God and the Father by him.",
        "18 Wives, be subject to your husbands, as it behoveth in the Lord.",
        "19 Husbands, love your wives, and be not bitter towards them.",
        "20 Children, obey your parents in all things: for this is well pleasing to the Lord.",
        "21 Fathers, provoke not your children to indignation, lest they be discouraged."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Hebrews 1: 1-2 or Colossians 3: 15a, 16a",
      "reference": "Hebrews 1: 1-2 or Colossians 3: 15a, 16a",
      "verses": [
        "R. Alleluia, alleluia.",
        "1-2 In the past God spoke to our ancestors through the prophets; in these last days, he has spoken to us through the Son.",
        "R. Alleluia, alleluia.",
        "Or",
        "R. Alleluia, alleluia.",
        "15a, 16a Let the peace of Christ control your hearts; let the word of Christ dwell in you richly.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 2: 22-40 or Luke 2: 22, 39-40",
      "reference": "Luke 2: 22-40 or Luke 2: 22, 39-40",
      "verses": [
        "22 And after the days of her purification, according to the law of Moses, were accomplished, they carried him to Jerusalem, to present him to the Lord:",
        "23 As it is written in the law of the Lord: Every male opening the womb shall be called holy to the Lord:",
        "24 And to offer a sacrifice, according as it is written in the law of the Lord, a pair of turtledoves, or two young pigeons:",
        "25 And behold there was a man in Jerusalem named Simeon, and this man was just and devout, waiting for the consolation of Israel; and the Holy Ghost was in him.",
        "26 And he had received an answer from the Holy Ghost, that he should not see death, before he had seen the Christ of the Lord.",
        "27 And he came by the Spirit into the temple. And when his parents brought in the child Jesus, to do for him according to the custom of the law,",
        "28 He also took him into his arms, and blessed God, and said:",
        "29 Now thou dost dismiss thy servant, O Lord, according to thy word in peace;",
        "30 Because my eyes have seen thy salvation,",
        "31 Which thou hast prepared before the face of all peoples:",
        "32 A light to the revelation of the Gentiles, and the glory of thy people Israel.",
        "33 And his father and mother were wondering at those things which were spoken concerning him.",
        "34 And Simeon blessed them, and said to Mary his mother: Behold this child is set for the fall, and for the resurrection of many in Israel, and for a sign which shall be contradicted;",
        "35 And thy own soul a sword shall pierce, that, out of many hearts, thoughts may be revealed.",
        "36 And there was one Anna, a prophetess, the daughter of Phanuel, of the tribe of Aser; she was far advanced in years, and had lived with her husband seven years from her virginity.",
        "37 And she was a widow until fourscore and four years; who departed not from the temple, by fastings and prayers serving night and day.",
        "38 Now she, at the same hour, coming in, confessed to the Lord; and spoke of him to all that looked for the redemption of Israel.",
        "39 And after they had performed all things according to the law of the Lord, they returned into Galilee, to their city Nazareth.",
        "40 And the child grew, and waxed strong, full of wisdom; and the grace of God was in him.",
        "Or",
        "22 And after the days of her purification, according to the law of Moses, were accomplished, they carried him to Jerusalem, to present him to the Lord:",
        "39 And after they had performed all things according to the law of the Lord, they returned into Galilee, to their city Nazareth.",
        "40 And the child grew, and waxed strong, full of wisdom; and the grace of God was in him."
      ]
    }
  ]
}