{
  "date": "2026-12-21",
  "url": "https://www.catholicgallery.org/mass-reading/211226/",
  "title": "Daily Mass Readings for Monday, 21 December 2026",
  "feast": "Advent Weekday (O Oriens)/ Peter Canisius, Priest, Doctor",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Songs 2: 8-14 or Zephaniah 3: 14-18a",
      "reference": "Songs 2: 8-14 or Zephaniah 3: 14-18a",
      "verses": [
        "8 The voice of my beloved, behold he cometh leaping upon the mountains, skipping over the hills.",
        "9 My beloved is like a roe, or a young hart. Behold he standeth behind our wall, looking through the windows, looking through the lattices.",
        "10 Behold my beloved speaketh to me: Arise, make haste, my love, my dove, my beautiful one, and come.",
        "11 For winter is now past, the rain is over and gone.",
        "12 The flowers have appeared in our land, the time of pruning is come: the voice of the turtle is heard in our land:",
        "13 The fig tree hath put forth her green figs: the vines in flower yield their sweet smell. Arise, my love, my beautiful one, and come:",
        "14 My dove in the clefts of the rock, in the hollow places of the wall, shew me thy face, let thy voice sound in my ears: for thy voice is sweet, and thy face comely.",
        "Or",
        "14 Give praise, O daughter of Sion: shout, O Israel: be glad, and rejoice with all thy heart, O daughter of Jerusalem.",
        "15 The Lord hath taken away thy judgment, he hath turned away thy enemies: the king of Israel the Lord is in the midst of thee, thou shalt fear evil no more.",
        "16 In that day it shall be said to Jerusalem: Fear not: to Sion: Let not thy hands be weakened.",
        "17, 18a The Lord thy God in the midst of thee is mighty, he will save: he will rejoice over thee with gladness, he will be silent in his love, he will be joyful over thee in praise."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 33: 2-3, 11-12, 20-21",
      "reference": "Psalms 33: 2-3, 11-12, 20-21",
      "verses": [
        "R. (1a, 3a) Exult, you just, in the Lord! Sing to him a new song.",
        "2 Give praise to the Lord on the harp; sing to him with the psaltery, the instrument of ten strings.",
        "3 Sing to him a new canticle, sing well unto him with a loud noise.",
        "R. Exult, you just, in the Lord! Sing to him a new song.",
        "11 But the counsel of the Lord standeth for ever: the thoughts of his heart to all generations.",
        "12 Blessed is the nation whose God is the Lord: the people whom he hath chosen for his inheritance.",
        "R. Exult, you just, in the Lord! Sing to him a new song.",
        "20 Our soul waiteth for the Lord: for he is our helper and protector.",
        "21 For in him our heart shall rejoice: and in his holy name we have trusted.",
        "R. Exult, you just, in the Lord! Sing to him a new song."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia",
      "reference": "",
      "verses": [
        "R. Alleluia, alleluia.",
        "O Emmanuel, our King and Giver of Law: come to save us, Lord our God!",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 1: 39-45",
      "reference": "Luke 1: 39-45",
      "verses": [
        "39 And Mary rising up in those days, went into the hill country with haste into a city of Juda.",
        "40 And she entered into the house of Zachary, and saluted Elizabeth.",
        "41 And it came to pass, that when Elizabeth heard the salutation of Mary, the infant leaped in her womb. And Elizabeth was filled with the Holy Ghost:",
        "42 And she cried out with a loud voice, and said: Blessed art thou among women, and blessed is the fruit of thy womb.",
        "43 And whence is this to me, that the mother of my Lord should come to me?",
        "44 For behold as soon as the voice of thy salutation sounded in my ears, the infant in my womb leaped for joy.",
        "45 And blessed art thou that hast believed, because those things shall be accomplished that were spoken to thee by the Lord."
      ]
    }
  ]
}