{
  "date": "2026-12-03",
  "url": "https://www.catholicgallery.org/mass-reading/031226/",
  "title": "Daily Mass Readings for Thursday, 3 December 2026",
  "feast": "Francis Xavier, Priest, Missionary Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 26: 1-6",
      "reference": "Isaiah 26: 1-6",
      "verses": [
        "1 In that day shall this canticle be sung the land of Juda. Sion the city of our strength a saviour, a wall and a bulwark shall be set therein.",
        "2 Open ye the gates, and let the just nation, that keepeth the truth, enter in.",
        "3 The old error is passed away: thou wilt keep peace: peace, because we have hoped in thee.",
        "4 You have hoped in the Lord for evermore, in the Lord God mighty for ever.",
        "5 For he shall bring down them that dwell on high, the high city he shall lay low. He shall bring it down even to the ground, he shall pull it down even to the dust.",
        "6 The foot shall tread it down, the feet of the poor, the steps of the needy."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 118: 1 and 8-9, 19-21, 25-27a",
      "reference": "Psalms 118: 1 and 8-9, 19-21, 25-27a",
      "verses": [
        "R. (26a) Blessed is he who comes in the name of the Lord.",
        "or",
        "R. Alleluia.",
        "1 Give praise to Lord, for he is good: for his mercy endureth for ever.",
        "8 It is good to confide in the Lord, rather than to have confidence in man.",
        "9 It is good to trust in the Lord, rather than to trust in princes.",
        "R. Blessed is he who comes in the name of the Lord.",
        "or",
        "R. Alleluia.",
        "19 Open ye to me the gates of justice: I will go into them, and give praise to the Lord.",
        "20 This is the gate of the Lord, the just shall enter into it.",
        "21 I will give glory to thee because thou hast heard me: and art become my salvation.",
        "R. Blessed is he who comes in the name of the Lord.",
        "or",
        "R. Alleluia.",
        "25 O Lord, save me: O Lord, give good success.",
        "26 Blessed be he that cometh in the name Lord. We have blessed you out of the house of the Lord.",
        "27a The Lord is God, and he hath shone upon us.",
        "R. Blessed is he who comes in the name of the Lord.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Isaiah 55: 6",
      "reference": "Isaiah 55: 6",
      "verses": [
        "R. Alleluia, alleluia.",
        "6 Seek the LORD while he may be found; call him while he is near.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 7: 21, 24-27",
      "reference": "Matthew 7: 21, 24-27",
      "verses": [
        "21 Not every one that saith to me, Lord, Lord, shall enter into the kingdom of heaven: but he that doth the will of my Father who is in heaven, he shall enter into the kingdom of heaven.",
        "24 Every one therefore that heareth these my words, and doth them, shall be likened to a wise man that built his house upon a rock,",
        "25 And the rain fell, and the floods came, and the winds blew, and they beat upon that house, and it fell not, for it was founded on a rock.",
        "26 And every one that heareth these my words, and doth them not, shall be like a foolish man that built his house upon the sand,",
        "27 And the rain fell, and the floods came, and the winds blew, and they beat upon that house, and it fell, and great was the fall thereof."
      ]
    }
  ]
}