{
  "date": "2026-12-23",
  "url": "https://www.catholicgallery.org/mass-reading/231226/",
  "title": "Daily Mass Readings for Wednesday, 23 December 2026",
  "feast": "Advent Weekday (O Emmanuel)/ John of Kanty, Priest",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Malachi 3: 1-4, 4: 5-6",
      "reference": "Malachi 3: 1-4, 4: 5-6",
      "verses": [
        "1 Behold I send my angel, and he shall prepare the way before my face. And presently the Lord, whom you seek, and the angel of the testament, whom you desire, shall come to his temple. Behold he cometh, saith the Lord of hosts.",
        "2 And who shall be able to think of the day of his coming? and who shall stand to see him? for he is like a refining fire, and like the fuller’s herb:",
        "3 And he shall sit refining and cleansing the silver, and he shall purify the sons of Levi, and shall refine them as gold, and as silver, and they shall offer sacrifices to the Lord in justice.",
        "4 And the sacrifice of Juda and of Jerusalem shall please the Lord, as in the days of old, and in the ancient years.",
        "4:5 Behold I will send you Elias the prophet, before the coming of the great and dreadful day of the Lord.",
        "6 And he shall turn the heart of the fathers to the children, and the heart of the children to their fathers: lest I come, and strike the earth with anathema."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 25: 4-5ab, 8-9, 10 and 14",
      "reference": "Psalms 25: 4-5ab, 8-9, 10 and 14",
      "verses": [
        "R. (Luke 21:28) Lift up your heads and see; your redemption is near at hand.",
        "4 Let all them be confounded that act unjust things without cause. shew, O Lord, thy ways to me, and teach me thy paths.",
        "5ab Direct me in thy truth, and teach me; for thou art God my Saviour.",
        "R. Lift up your heads and see; your redemption is near at hand.",
        "8 The Lord is sweet and righteous: therefore he will give a law to sinners in the way.",
        "9 He will guide the mild in judgment: he will teach the meek his ways.",
        "R. Lift up your heads and see; your redemption is near at hand.",
        "10 All the ways of the Lord are mercy and truth, to them that seek after his covenant and his testimonies.",
        "14 The Lord is a firmament to them that fear him: and his covenant shall be made manifest to them.",
        "R. Lift up your heads and see; your redemption is near at hand."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia",
      "reference": "",
      "verses": [
        "R. Alleluia, alleluia.",
        "O King of all nations and keystone of the Church; come and save man, whom you formed from the dust!",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 1: 57-66",
      "reference": "Luke 1: 57-66",
      "verses": [
        "57 Now Elizabeth’s full time of being delivered was come, and she brought forth a son.",
        "58 And her neighbours and kinsfolks heard that the Lord had shewed his great mercy towards her, and they congratulated with her.",
        "59 And it came to pass, that on the eighth day they came to circumcise the child, and they called him by his father’s name Zachary.",
        "60 And his mother answering, said: Not so; but he shall be called John.",
        "61 And they said to her: There is none of thy kindred that is called by this name.",
        "62 And they made signs to his father, how he would have him called.",
        "63 And demanding a writing table, he wrote, saying: John is his name. And they all wondered.",
        "64 And immediately his mouth was opened, and his tongue loosed, and he spoke, blessing God.",
        "65 And fear came upon all their neighbours; and all these things were noised abroad over all the hill country of Judea.",
        "66 And all they that had heard them laid them up in their heart, saying: What an one, think ye, shall this child be? For the hand of the Lord was with him."
      ]
    }
  ]
}