{
  "date": "2026-12-14",
  "url": "https://www.catholicgallery.org/mass-reading/141226/",
  "title": "Daily Mass Readings for Monday, 14 December 2026",
  "feast": "John of the Cross, Priest, Doctor Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Numbers 24: 2-7, 15-17",
      "reference": "Numbers 24: 2-7, 15-17",
      "verses": [
        "2 And lifting up his eyes, he saw Israel abiding in their tents by their tribes: and the spirit of God rushing upon him,",
        "3 He took up his parable and said: Balaam the son of Beor hath said: The man hath said, whose eye ire stopped up:",
        "4 The hearer of the words of God hath said, he that hath beheld the vision of the Almighty, he that falleth, and so his eyes are opened:",
        "5 How beautiful are thy tabernacles, O Jacob, and thy tents, O Israel!",
        "6 As woody valleys, as watered gardens near the rivers, as tabernacles which the Lord hath pitched, as cedars by the waterside.",
        "7 Water shall flow out of his bucket, and his seed shall be in many waters. For Agag his king shall be removed, and his kingdom shall be taken awry.",
        "15 Therefore taking up his parable, again he said: Balaam the son of Beor hath said: The man whose eye is stopped up, hath said:",
        "16 The hearer of the words of God hath said, who knoweth the doctrine of the Highest, and seeth the visions of the Almighty, who falling hath his eyes opened:",
        "17 I shall see him, but not now: I shall behold him, but not near. A STAR SHALL RISE out of Jacob and a sceptre shall spring up from Israel."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 25: 4-5ab, 6 and 7bc, 8-9",
      "reference": "Psalms 25: 4-5ab, 6 and 7bc, 8-9",
      "verses": [
        "R. (4) Teach me your ways, O Lord.",
        "4 Let all them be confounded that act unjust things without cause. shew, O Lord, thy ways to me, and teach me thy paths.",
        "5ab Direct me in thy truth, and teach me; for thou art God my Saviour.",
        "R. Teach me your ways, O Lord.",
        "6 Remember, O Lord, thy bowels of compassion; and thy mercies that are from the beginning of the world.",
        "7bc According to thy mercy remember thou me: for thy goodness’ sake, O Lord.",
        "R. Teach me your ways, O Lord.",
        "8 The Lord is sweet and righteous: therefore he will give a law to sinners in the way.",
        "9 He will guide the mild in judgment: he will teach the meek his ways.",
        "R. Teach me your ways, O Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Psalms 85: 8",
      "reference": "Psalms 85: 8",
      "verses": [
        "R. Alleluia, alleluia.",
        "8 Show us, LORD, your love, and grant us your salvation.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 21: 23-27",
      "reference": "Matthew 21: 23-27",
      "verses": [
        "23 And when he was come into the temple, there came to him, as he was teaching, the chief priests and ancients of the people, saying: By what authority dost thou these things? and who hath given thee this authority?",
        "24 Jesus answering, said to them: I also will ask you one word, which if you shall tell me, I will also tell you by what authority I do these things.",
        "25 The baptism of John, whence was it? from heaven or from men? But they thought within themselves, saying:",
        "26 If we shall say, from heaven, he will say to us: Why then did you not believe him? But if we shall say, from men, we are afraid of the multitude: for all held John as a prophet.",
        "27 And answering Jesus, they said: We know not. He also said to them: Neither do I tell you by what authority I do these things."
      ]
    }
  ]
}