{
  "date": "2026-12-01",
  "url": "https://www.catholicgallery.org/mass-reading/011226/",
  "title": "Daily Mass Readings for Tuesday, 1 December 2026",
  "feast": "Advent Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 11: 1-10",
      "reference": "Isaiah 11: 1-10",
      "verses": [
        "1 And there shall come forth a rod out of the root of Jesse, and a flower shall rise up out of his root.",
        "2 And the spirit of the Lord shall rest upon him: the spirit of wisdom, and of understanding, the spirit of counsel, and of fortitude, the spirit of knowledge, and of godliness.",
        "3 And he shall be filled with the spirit of the fear of the Lord. He shall not judge according to the sight of the eyes, nor reprove according to the hearing of the ears.",
        "4 But he shall judge the poor with justice, and shall reprove with equity for the meek of the earth: land he shall strike the earth with the rod of his mouth, and with the breath of his lips he shall slay the wicked.",
        "5 And justice shall be the girdle of his loins: and faith the girdle of his reins.",
        "6 The wolf shall dwell with the lamb: and the leopard shall lie down with the kid: the calf and the lion, and the sheep shall abide together, and a little child shall lead them.",
        "7 The calf and the bear shall feed: their young ones shall rest together: and the lion shall eat straw like the ox.",
        "8 And the sucking child shall play on the hole of the asp: and the weaned child shall thrust his hand into the den of the basilisk.",
        "9 They shall not hurt, nor shall they kill in all my holy mountain, for the earth is filled with the knowledge of the Lord, as the covering waters of the sea.",
        "10 In that day the root of Jesse, who standeth for an ensign of the people, him the Gentiles shall beseech, and his sepulchre shall be glorious."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 72: 1-2, 7-8, 12-13, 17",
      "reference": "Psalms 72: 1-2, 7-8, 12-13, 17",
      "verses": [
        "R. (7) Justice shall flourish in his time, and fullness of peace for ever.",
        "2 Give to the king thy judgment, O God: and to the king’s son thy justice: To judge thy people with justice, and thy poor with judgment.",
        "R. Justice shall flourish in his time, and fullness of peace for ever.",
        "7 In his days shall justice spring up, and abundance of peace, till the moon be taken sway.",
        "8 And he shall rule from sea to sea, and from the river unto the ends of the earth.",
        "R. Justice shall flourish in his time, and fullness of peace for ever.",
        "12 For he shall deliver the poor from the mighty: and the needy that had no helper.",
        "13 He shall spare the poor and needy: and he shall save the souls of the poor.",
        "R. Justice shall flourish in his time, and fullness of peace for ever.",
        "17 Let his name be blessed for evermore: his name continueth before the sun. And in him shall all the tribes of the earth be blessed: all nations shall magnify him.",
        "R. Justice shall flourish in his time, and fullness of peace for ever."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia",
      "reference": "",
      "verses": [
        "R. Alleluia, alleluia.",
        "Behold, our Lord shall come with power; he will enlighten the eyes of his servants.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Luke 10: 21-24",
      "reference": "Luke 10: 21-24",
      "verses": [
        "21 In that same hour, he rejoiced in the Holy Ghost, and said: I confess to thee, O Father, Lord of heaven and earth, because thou hast hidden these things from the wise and prudent, and hast revealed them to little ones. Yea, Father, for so it hath seemed good in thy sight.",
        "22 All things are delivered to me by my Father; and no one knoweth who the Son is, but the Father; and who the Father is, but the Son, and to whom the Son will reveal him.",
        "23 And turning to his disciples, he said: Blessed are the eyes that see the things which you see.",
        "24 For I say to you, that many prophets and kings have desired to see the things that you see, and have not seen them; and to hear the things that you hear, and have not heard them."
      ]
    }
  ]
}