{
  "date": "2026-12-04",
  "url": "https://www.catholicgallery.org/mass-reading/041226/",
  "title": "Daily Mass Readings for Friday, 4 December 2026",
  "feast": "Advent Weekday/ John of Damascus, Priest, Religious, Doctor",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 29: 17-24",
      "reference": "Isaiah 29: 17-24",
      "verses": [
        "17 Is it not yet a very little while, and Libanus shall be turned into charmel, and charmel shall be esteemed as a forest?",
        "18 And in that day the deaf shall hear the words of the book, and out of darkness and obscurity the eyes of the blind shall see.",
        "19 And the meek shall increase their joy in the Lord, and the poor men shall rejoice in the Holy One of Israel.",
        "20 For he that did prevail hath failed, the scorner is consumed, and they are all cut off that watched for iniquity:",
        "21 That made men sin by word, and supplanted him that reproved them in the gate, and declined in vain from the just.",
        "22 Therefore thus saith the Lord to the house of Jacob, he that redeemed Abraham: Jacob shall not now be confounded, neither shall his countenance now be ashamed:",
        "23 But when he shall see his children, the work of my hands in the midst of him sanctifying my name, and they shall sanctify the Holy One of Jacob, and shall glorify the God of Israel:",
        "24 And they that erred in spirit, shall know understanding, and they that murmured, shall learn the law."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 27: 1, 4, 13-14",
      "reference": "Psalms 27: 1, 4, 13-14",
      "verses": [
        "R. (1a) The Lord is my light and my salvation.",
        "1 The psalm of David before he was anointed. The Lord is my light and my salvation, whom shall I fear? The Lord is the protector of my life: of whom shall I be afraid?",
        "R. The Lord is my light and my salvation.",
        "4 One thing I have asked of the Lord, this will I seek after; that I may dwell in the house of the Lord all the days of my life. That I may see the delight of the Lord, and may visit his temple.",
        "R. The Lord is my light and my salvation.",
        "13 I believe to see the good things of the Lord in the land of the living.",
        "14 Expect the Lord, do manfully, and let thy heart take courage, and wait thou for the Lord.",
        "R. The Lord is my light and my salvation."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia",
      "reference": "",
      "verses": [
        "R. Alleluia, alleluia.",
        "Behold, our Lord shall come with power; he will enlighten the eyes of his servants.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 9: 27-31",
      "reference": "Matthew 9: 27-31",
      "verses": [
        "27 And as Jesus passed from thence, there followed him two blind men crying out and saying, Have mercy on us, O Son of David.",
        "28 And when he was come to the house, the blind men came to him. And Jesus saith to them, Do you believe, that I can do this unto you? They say to him, Yea, Lord.",
        "29 Then he touched their eyes, saying, According to your faith, be it done unto you.",
        "30 And their eyes were opened, and Jesus strictly charged them, saying, See that no man know this.",
        "31 But they going out, spread his fame abroad in all that country."
      ]
    }
  ]
}