{
  "date": "2026-02-08",
  "url": "https://www.catholicgallery.org/mass-reading/080226/",
  "title": "Daily Mass Readings for Sunday, 8 February 2026",
  "feast": "Fifth Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Isaiah 58: 7-10",
      "reference": "Isaiah 58: 7-10",
      "verses": [
        "7 Deal thy bread to the hungry, and bring the needy and the harbourless into thy house: when thou shalt see one naked, cover him, and despise not thy own flesh.",
        "8 Then shall thy light break forth as the morning, and thy health shall speedily arise, and thy justice shall go before thy face, and the glory of the Lord shall gather thee up.",
        "9 Then shalt thou call, and the Lord shall hear: thou shalt cry, and he shall say, Here I am. If thou wilt take away the chain out of the midst of thee, and cease to stretch out the finger, and to speak that which profiteth not.",
        "10 When thou shalt pour out thy soul to the hungry, and shalt satisfy the afflicted soul then shall thy light rise up in darkness, and thy darkness shall be as the noonday."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 112: 4-5, 6-7, 8-9",
      "reference": "Psalms 112: 4-5, 6-7, 8-9",
      "verses": [
        "R. (4a) The just man is a light in darkness to the upright.",
        "or",
        "R. Alleluia.",
        "4 To the righteous a light is risen up in darkness: he is merciful, and compassionate and just.",
        "5 Acceptable is the man that sheweth mercy and lendeth: he shall order his words with judgment:",
        "R. The just man is a light in darkness to the upright.",
        "or",
        "R. Alleluia.",
        "6 Because he shall not be moved for ever.",
        "7 The just shall be in everlasting remembrance: he shall not hear the evil hearing. His heart is ready to hope in the Lord:",
        "R. The just man is a light in darkness to the upright.",
        "or",
        "R. Alleluia.",
        "8 His heart is strengthened, he shall not be moved until he look over his enemies.",
        "9 He hath distributed, he hath given to the poor: his justice remaineth for ever and ever: his horn shall be exalted in glory.",
        "R. The just man is a light in darkness to the upright.",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First Corinthians 2: 1-5",
      "reference": "First Corinthians 2: 1-5",
      "verses": [
        "1 And I, brethren, when I came to you, came not in loftiness of speech or of wisdom, declaring unto you the testimony of Christ.",
        "2 For I judged not myself to know anything among you, but Jesus Christ, and him crucified.",
        "3 And I was with you in weakness, and in fear, and in much trembling.",
        "4 And my speech and my preaching was not in the persuasive words of human wisdom, but in shewing of the Spirit and power;",
        "5 That your faith might not stand on the wisdom of men, but on the power of God."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 8: 12",
      "reference": "John 8: 12",
      "verses": [
        "R. Alleluia, alleluia.",
        "12 I am the light of the world, says the Lord; whoever follows me will have the light of life.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 5: 13-16",
      "reference": "Matthew 5: 13-16",
      "verses": [
        "13 You are the salt of the earth. But if the salt lose its savour, wherewith shall it be salted? It is good for nothing any more but to be cast out, and to be trodden on by men.",
        "14 You are the light of the world. A city seated on a mountain cannot be hid.",
        "15 Neither do men light a candle and put it under a bushel, but upon a candlestick, that it may shine to all that are in the house.",
        "16 So let your light shine before men, that they may see your good works, and glorify your Father who is in heaven."
      ]
    }
  ]
}