{
  "date": "2026-02-05",
  "url": "https://www.catholicgallery.org/mass-reading/050226/",
  "title": "Daily Mass Readings for Thursday, 5 February 2026",
  "feast": "Agatha, Virgin, Martyr Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Kings 2: 1-4, 10-12",
      "reference": "First Kings 2: 1-4, 10-12",
      "verses": [
        "1 And the days of David drew nigh that he should die, and he charged his son Solomon, saying:",
        "2 I am going the way of all flesh: take thou courage, and shew thyself a man.",
        "3 And keep the charge of the Lord thy God, to walk in his ways, and observe his ceremonies, and his precepts, and judgments, and testimonies, as it is written in the law of Moses: that thou mayest understand all thou dost, and whithersoever thou shalt turn thyself:",
        "4 That the Lord may confirm his words, which he hath spoken of me, saying: If thy children shall take heed to their ways, and shall walk before me in truth, with all their heart, and with all their soul, there shall not be taken away from thee a man on the throne of Israel.",
        "10 So David slept with his fathers, and was buried in the city of David.",
        "11 And the days that David reigned in Israel, were forty years: in Hebron he reigned seven years, in Jerusalem thirty-three.",
        "12 And Solomon sat upon the throne of his father David, and his kingdom was strengthened exceedingly."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: First Chronicles 29: 10, 11ab, 11d-12a, 12bcd",
      "reference": "First Chronicles 29: 10, 11ab, 11d-12a, 12bcd",
      "verses": [
        "R. (12b) Lord, you are exalted over all.",
        "10 Blessed art thou, O Lord the God of Israel, our father from eternity to eternity.",
        "R. Lord, you are exalted over all.",
        "11ab Thine, O Lord, is magnificence, and power, and glory, and victory.",
        "R. Lord, you are exalted over all.",
        "11d O Lord, and thou art above all princes.",
        "12a Thine are riches, and thine is glory, thou hast dominion over all.",
        "R. Lord, you are exalted over all.",
        "12bcd In thy hand is power and might: in thy hand greatness, and the empire of all things.",
        "R. Lord, you are exalted over all."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Mark 1: 15",
      "reference": "Mark 1: 15",
      "verses": [
        "R. Alleluia, alleluia.",
        "15 The Kingdom of God is at hand; repent and believe in the Gospel.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 6: 7-13",
      "reference": "Mark 6: 7-13",
      "verses": [
        "7 And he called the twelve; and began to send them two and two, and gave them power over unclean spirits.",
        "8 And he commanded them that they should take nothing for the way, but a staff only: no scrip, no bread, nor money in their purse,",
        "9 But to be shod with sandals, and that they should not put on two coats.",
        "10 And he said to them: Wheresoever you shall enter into an house, there abide till you depart from that place.",
        "11 And whosoever shall not receive you, nor hear you; going forth from thence, shake off the dust from your feet for a testimony to them.",
        "12 And going forth they preached that men should do penance:",
        "13 And they cast out many devils, and anointed with oil many that were sick, and healed them."
      ]
    }
  ]
}