{
  "date": "2026-02-01",
  "url": "https://www.catholicgallery.org/mass-reading/010226/",
  "title": "Daily Mass Readings for Sunday, 1 February 2026",
  "feast": "Fourth Sunday in Ordinary Time",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Zephaniah 2: 3; Zephaniah 3: 12-13",
      "reference": "Zephaniah 2: 3; Zephaniah 3: 12-13",
      "verses": [
        "3 Seek the Lord, all ye meek of the earth, you that have wrought his judgment: seek the just, seek the meek: if by any means you may be hid in the day of the Lord’s indignation.",
        "12 And I will leave in the midst of thee a poor and needy people: and they shall hope in the name of the Lord.",
        "13 The remnant of Israel shall not do iniquity, nor speak lies, nor shall a deceitful tongue be found in their mouth: for they shall feed, and shall lie down, and there shall be none to make them afraid."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 146: 6-7, 8-9a, 9bc-10",
      "reference": "Psalms 146: 6-7, 8-9a, 9bc-10",
      "verses": [
        "R. (Mat 5:3) Blessed are the poor in spirit; the kingdom of heaven is theirs!",
        "or",
        "R. Alleluia.",
        "6-7 The Lord keepeth truth for ever: who executeth judgment for them that suffer wrong: who giveth food to the hungry. The Lord looseth them that are fettered.",
        "R. Blessed are the poor in spirit; the kingdom of heaven is theirs!",
        "or",
        "R. Alleluia.",
        "8 The Lord enlighteneth the blind. The Lord lifteth up them that are cast down: the Lord loveth the just.",
        "9a The Lord keepeth the strangers.",
        "R. Blessed are the poor in spirit; the kingdom of heaven is theirs!",
        "or",
        "R. Alleluia.",
        "9bc The Lord will support the fatherless and the widow: and the ways of sinners he will destroy.",
        "10 The Lord shall reign for ever: thy God, O Sion, unto generation and generation.",
        "R. Blessed are the poor in spirit; the kingdom of heaven is theirs!",
        "or",
        "R. Alleluia."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: First Corinthians 1: 26-31",
      "reference": "First Corinthians 1: 26-31",
      "verses": [
        "26 For see your vocation, brethren, that there are not many wise according to the flesh, not many mighty, not many noble:",
        "27 But the foolish things of the world hath God chosen, that he may confound the wise; and the weak things of the world hath God chosen, that he may confound the strong.",
        "28 And the base things of the world, and the things that are contemptible, hath God chosen, and things that are not, that he might bring to nought things that are:",
        "29 That no flesh should glory in his sight.",
        "30 But of him are you in Christ Jesus, who of God is made unto us wisdom, and justice, and sanctification, and redemption:",
        "31 That, as it is written: He that glorieth, may glory in the Lord."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 5: 12a",
      "reference": "Matthew 5: 12a",
      "verses": [
        "R. Alleluia, alleluia.",
        "12 Rejoice and be glad; your reward will be great in heaven.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 5: 1-12a",
      "reference": "Matthew 5: 1-12a",
      "verses": [
        "1 And seeing the multitudes, he went up into a mountain, and when he was set down, his disciples came unto him.",
        "2 And opening his mouth, he taught them, saying:",
        "3 Blessed are the poor in spirit: for theirs is the kingdom of heaven.",
        "4 Blessed are the meek: for they shall possess the land.",
        "5 Blessed are they that mourn: for they shall be comforted.",
        "6 Blessed are they that hunger and thirst after justice: for they shall have their fill.",
        "7 Blessed are the merciful: for they shall obtain mercy.",
        "8 Blessed are the clean of heart: for they shall see God.",
        "9 Blessed are the peacemakers: for they shall be called children of God.",
        "10 Blessed are they that suffer persecution for justice’ sake: for theirs is the kingdom of heaven.",
        "11 Blessed are ye when they shall revile you, and persecute you, and speak all that is evil against you, untruly, for my sake:",
        "12a Be glad and rejoice, for your reward is very great in heaven."
      ]
    }
  ]
}