{
  "date": "2026-02-09",
  "url": "https://www.catholicgallery.org/mass-reading/090226/",
  "title": "Daily Mass Readings for Monday, 9 February 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Kings 8: 1-7, 9-13",
      "reference": "First Kings 8: 1-7, 9-13",
      "verses": [
        "1 Then all the ancients of Israel with the princes of the tribes, and the heads of the families of the children of Israel were assembled to king Solomon in Jerusalem: that they might carry the ark of the covenant of the Lord out of the city of David, that is, out of Sion.",
        "2 And all Israel assembled themselves to king Solomon on the festival day in the month of Ethanim, the same is the seventh month.",
        "3 And all the ancients of Israel came, and the priests took up the ark,",
        "4 And carried the ark of the Lord, and the tabernacle of the covenant, and all the vessels of the sanctuary, that were in the tabernacle: and the priests and the Levites carried them.",
        "5 And king Solomon, and all the multitude of Israel, that were assembled unto him went with him before the ark, and they sacrificed sheep and oxen that could not be counted or numbered.",
        "6 And the priests brought in the ark of the covenant of the Lord into its place, into the oracle of the temple, into the holy of holies under the wings of the cherubims.",
        "7 For the cherubims spread forth their wings over the place of the ark, and covered the art, and the staves thereof above.",
        "9 Now in the ark there was nothing else but the two tables of stone, which Moses put there at Horeb, when the Lord made a covenant with the children of Israel, when they came out of the land of Egypt.",
        "10 And it came to pass, when the priests were come out of the sanctuary, that a cloud filled the house of the Lord,",
        "11 And the priests could not stand to minister because of the cloud: for the glory of the Lord had filled the house of the Lord.",
        "12 Then Solomon said: The Lord said that he would dwell in a cloud.",
        "13 Building I have built a house for thy dwelling, to be thy most firm throne for ever."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 132: 6-7, 8-10",
      "reference": "Psalms 132: 6-7, 8-10",
      "verses": [
        "R. (8a) Lord, go up to the place of your rest!",
        "6 Behold we have heard of it in Ephrata: we have found it in the fields of the wood.",
        "7 We will go into his tabernacle: We will adore in the place where his feet stood.",
        "R. Lord, go up to the place of your rest!",
        "8 Arise, O Lord, into thy resting place: thou and the ark, which thou hast sanctified.",
        "9 Let thy priests be clothed with justice: and let thy saints rejoice.",
        "10 For thy servant David’s sake, turn not away the face of thy anointed.",
        "R. Lord, go up to the place of your rest!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 4: 23",
      "reference": "Matthew 4: 23",
      "verses": [
        "R. Alleluia, alleluia.",
        "23 Jesus preached the Gospel of the Kingdom and cured every disease among the people.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 6: 53-56",
      "reference": "Mark 6: 53-56",
      "verses": [
        "53 And when they had passed over, they came into the land of Genezareth, and set to the shore.",
        "54 And when they were gone out of the ship, immediately they knew him:",
        "55 And running through that whole country, they began to carry about in beds those that were sick, where they heard he was.",
        "56 And whithersoever he entered, into towns or into villages or cities, they laid the sick in the streets, and besought him that they might touch but the hem of his garment: and as many as touched him were made whole."
      ]
    }
  ]
}