{
  "date": "2026-02-07",
  "url": "https://www.catholicgallery.org/mass-reading/070226/",
  "title": "Daily Mass Readings for Saturday, 7 February 2026",
  "feast": "Ordinary Weekday/ Optional Memorial of the Blessed Virgin Mary",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Kings 3: 4-13",
      "reference": "First Kings 3: 4-13",
      "verses": [
        "4 He went therefore to Gabaon, to sacrifice there: for that was the great high place: a thousand victims for holocausts did Solomon offer upon that altar in Gabaon.",
        "5 And the Lord appeared to Solomon in a dream by night, saying: Ask what thou wilt that I should give thee.",
        "6 And Solomon said: Thou hast shewn great mercy to thy servant David my father, even at, he walked before thee in truth, and justice, and an upright heart with thee: and thou hast kept thy great mercy for him, and hast given him a son to sit on his throne, as it is this day.",
        "7 And now, O Lord God, thou hast made thy servant king instead of David my father: and I am but a child, and know not how to go out and come in.",
        "8 And thy servant is in the midst of the people which thou hast chosen, an immense people, which cannot be numbered nor counted for multitude.",
        "9 Give therefore to thy servant an understanding heart, to judge thy people, and discern between good and evil. For who shall be able to judge this people, thy people which is so numerous?",
        "10 And the word was pleasing to the Lord that Solomon had asked such a thing.",
        "11 And the Lord said to Solomon: Because thou hast asked this thing, and hast not asked for thyself long life or riches, nor the lives of thy enemies, but hast asked for thyself wisdom to discern judgment,",
        "12 Behold I have done for thee according to thy words, and have given thee a wise and understanding heart, insomuch that there hath been no one like thee before thee, nor shall arise after thee.",
        "13 Yea and the things also which thou didst not ask, I have given thee: to wit riches and glory, as that no one hath been like thee among the kings in all days heretofore."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 119: 9, 10, 11, 12, 13, 14",
      "reference": "Psalms 119: 9, 10, 11, 12, 13, 14",
      "verses": [
        "R. (12b) Lord, teach me your statutes.",
        "9 By what doth a young man correct his way? by observing thy words.",
        "R. Lord, teach me your statutes.",
        "10 With my whole heart have I sought after thee: let me not stray from thy commandments.",
        "R. Lord, teach me your statutes.",
        "11 Thy words have I hidden in my heart, that I may not sin against thee.",
        "R. Lord, teach me your statutes.",
        "12 Blessed art thou, O Lord: teach me thy justifications.",
        "R. Lord, teach me your statutes.",
        "13 With my lips I have pronounced all the judgments of thy mouth.",
        "R. Lord, teach me your statutes.",
        "14 I have been delighted in the way of thy testimonies, as in all riches.",
        "R. Lord, teach me your statutes."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 10: 27",
      "reference": "John 10: 27",
      "verses": [
        "R. Alleluia, alleluia.",
        "27 My sheep hear my voice, says the Lord; I know them, and they follow me.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 6: 30-34",
      "reference": "Mark 6: 30-34",
      "verses": [
        "30 And the apostles coming together unto Jesus, related to him all things that they had done and taught.",
        "31 And he said to them: Come apart into a desert place, and rest a little. For there were many coming and going: and they had not so much as time to eat.",
        "32 And going up into a ship, they went into a desert place apart.",
        "33 And they saw them going away, and many knew: and they ran flocking thither on foot from all the cities, and were there before them.",
        "34 And Jesus going out saw a great multitude: and he had compassion on them, because they were as sheep not having a shepherd, and he began to teach them many things."
      ]
    }
  ]
}