{
  "date": "2026-02-26",
  "url": "https://www.catholicgallery.org/mass-reading/260226/",
  "title": "Daily Mass Readings for Thursday, 26 February 2026",
  "feast": "Lenten Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Esther C: 12, 14-16, 23-25",
      "reference": "Esther C: 12, 14-16, 23-25",
      "verses": [
        "12 Queen Esther also, fearing the danger that was at hand, had recourse to the Lord.",
        "14 And she prayed to the Lord the God of Israel, saying: O my Lord, who alone art our king, help me a desolate woman, and who have no other helper but thee.",
        "15 My danger is in my hands.",
        "16 I have heard of my father that thou, O Lord, didst take Israel from among all nations, and our fathers from all their predecessors, to possess them as an everlasting inheritance, and thou hast done to them as thou hast promised.",
        "23 Remember, O Lord, and shew thyself to us in the time of our tribulation, and give me boldness, O Lord, king of gods, and of all power:",
        "24 Give me a well ordered speech in my mouth in the presence of the lion, and turn his heart to the hatred of our enemy, that both he himself may perish, and the rest that consent to him.",
        "25 But deliver us by thy hand, and help me, who have no other helper, but thee, O Lord, who hast the knowledge of all things."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 138: 1-2ab, 2cde-3, 7c-8",
      "reference": "Psalms 138: 1-2ab, 2cde-3, 7c-8",
      "verses": [
        "R. (3a) Lord, on the day I called for help, you answered me.",
        "1 I will praise thee, O lord, with my whole heart: for thou hast heard the words of my mouth. I will sing praise to thee in the sight of his angels:",
        "2ab I will worship towards thy holy temple, and I will give glory to thy name.",
        "R. Lord, on the day I called for help, you answered me.",
        "2cde For thy mercy, and for thy truth: for thou hast magnified thy holy name above all.",
        "3 In what day soever I shall call upon thee, hear me: thou shall multiply strength in my soul.",
        "R. Lord, on the day I called for help, you answered me.",
        "7c Thy right hand hath saved me.",
        "8 The Lord will repay for me: thy mercy, O Lord, endureth for ever: O despise not the work of thy hands.",
        "R. Lord, on the day I called for help, you answered me."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Verse Before the Gospel: Psalms 51: 12a,14a",
      "reference": "Verse Before the Gospel: Psalms 51: 12a,14a",
      "verses": [
        "12a, 14a A clean heart create for me, O God; give me back the joy of your salvation."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 7: 7-12",
      "reference": "Matthew 7: 7-12",
      "verses": [
        "7 Ask, and it shall be given you: seek, and you shall find: knock, and it shall be opened to you.",
        "8 For every one that asketh, receiveth: and he that seeketh, findeth: and to him that knocketh, it shall be opened.",
        "9 Or what man is there among you, of whom if his son shall ask bread, will he reach him a stone?",
        "10 Or if he shall ask him a fish, will he reach him a serpent?",
        "11 If you then being evil, know how to give good gifts to your children: how much more will your Father who is in heaven, give good things to them that ask him?",
        "12 All things therefore whatsoever you would that men should do to you, do you also to them. For this is the law and the prophets."
      ]
    }
  ]
}