{
  "date": "2026-02-10",
  "url": "https://www.catholicgallery.org/mass-reading/100226/",
  "title": "Daily Mass Readings for Tuesday, 10 February 2026",
  "feast": "Scholastica, Virgin, Religious Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Kings 8: 22-23, 27-30",
      "reference": "First Kings 8: 22-23, 27-30",
      "verses": [
        "22 And Solomon stood before the altar of the Lord in the sight of the assembly of Israel, and spread forth his hands towards heaven;",
        "23 And said: Lord God of Israel, there is no God like thee in heaven above, or on earth beneath: who keepest covenant and mercy with thy servants that have walked before thee with all their heart.",
        "27 Is it then to be thought that God should indeed dwell upon earth? for if heaven, and the heavens of heavens cannot contain thee, how much less this house which I have built?",
        "28 But have regard to the prayer of thy servant, and to his supplications, O Lord my God: hear the hymn and the prayer, which thy servant prayeth before thee this day:",
        "29 That thy eyes may be open upon this house night and day: upon the house of which thou hast said: My name shall be there: that thou mayest hearken to the prayer, which thy servant prayeth in this place to thee.",
        "30 That thou mayest hearken to the supplication of thy servant and of thy people Israel, whatsoever they shall pray for in this place, and hear them in the place of thy dwelling in heaven; and when thou hearest, shew them mercy."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 84: 3, 4, 5 and 10, 11",
      "reference": "Psalms 84: 3, 4, 5 and 10, 11",
      "verses": [
        "R. (2) How lovely is your dwelling place, Lord, mighty God!",
        "3 My soul longeth and fainteth for the courts of the Lord. My heart and my flesh have rejoiced in the living God.",
        "R. How lovely is your dwelling place, Lord, mighty God!",
        "4 For the sparrow hath found herself a house, and the turtle a nest for herself where she may lay her young ones: Thy altars, O Lord of hosts, my king and my God.",
        "R. How lovely is your dwelling place, Lord, mighty God!",
        "5 Blessed are they that dwell in thy house, O Lord: they shall praise thee for ever and ever.",
        "10 Behold, O God our protector: and look on the face of thy Christ.",
        "R. How lovely is your dwelling place, Lord, mighty God!",
        "11 For better is one day in thy courts above thousands. I have chosen to be an abject in the house of my God, rather than to dwell in the tabernacles of sinners.",
        "R. How lovely is your dwelling place, Lord, mighty God!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Psalms 119: 36, 29b",
      "reference": "Psalms 119: 36, 29b",
      "verses": [
        "R. Alleluia, alleluia.",
        "36, 29b Incline my heart, O God, to your decrees; and favor me with your law.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 7: 1-13",
      "reference": "Mark 7: 1-13",
      "verses": [
        "1 And there assembled together unto him the Pharisees and some of the scribes, coming from Jerusalem.",
        "2 And when they had seen some of his disciples eat bread with common, that is, with unwashed hands, they found fault.",
        "3 For the Pharisees, and all the Jews eat not without often washing their hands, holding the tradition of the ancients:",
        "4 And when they come from the market, unless they be washed, they eat not: and many other things there are that have been delivered to them to observe, the washings of cups and of pots, and of brazen vessels, and of beds.",
        "5 And the Pharisees and scribes asked him: Why do not thy disciples walk according to the tradition of the ancients, but they eat bread with common hands?",
        "6 But he answering, said to them: Well did Isaias prophesy of you hypocrites, as it is written: This people honoureth me with their lips, but their heart is far from me.",
        "7 And in vain do they worship me, teaching doctrines and precepts of men.",
        "8 For leaving the commandment of God, you hold the tradition of men, the washing of pots and of cups: and many other things you do like to these.",
        "9 And he said to them: Well do you make void the commandment of God, that you may keep your own tradition.",
        "10 For Moses said: Honour thy father and thy mother; and He that shall curse father or mother, dying let him die.",
        "11 But you say: If a man shall say to his father or mother, Corban, (which is a gift,) whatsoever is from me, shall profit thee.",
        "12 And further you suffer him not to do any thing for his father or mother,",
        "13 Making void the word of God by your own tradition, which you have given forth. And many other such like things you do."
      ]
    }
  ]
}