{
  "date": "2026-02-14",
  "url": "https://www.catholicgallery.org/mass-reading/140226/",
  "title": "Daily Mass Readings for Saturday, 14 February 2026",
  "feast": "Cyril and Methodius, Bishops Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Kings 12: 26-32; 13: 33-34",
      "reference": "First Kings 12: 26-32; 13: 33-34",
      "verses": [
        "26 And Jeroboam said in his heart: Now shall the kingdom return to the house of David,",
        "27 If this people go up to offer sacrifices in the house of the Lord at Jerusalem: and the heart of this people will turn to their lord Roboam the king of Juda, and they will kill me, and return to him.",
        "28 And finding out a device he made two golden calves, and said to them: Go ye up no more to Jerusalem: Behold thy gods, O Israel, who brought thee out of the land of Egypt.",
        "29 And he set the one in Bethel, and the other in Dan:",
        "30 And this thing became an occasion of sin: for the people went to adore the calf as far as Dan.",
        "31 And he made temples in the high places, and priests of the lowest of the people, who were not of the sons of Levi.",
        "32 And he appointed a feast in the eighth month, on the fifteenth day of the month, after the manner of the feast that was celebrated in Juda. And going up to the altar, he did in like manner in Bethel, to sacrifice to the calves, which he had made: and he placed in Bethel priests of the high places, which he had made.",
        "13:33 After these words Jeroboam came not back from his wicked way: but on the contrary he made of the meanest of the people priests of the high places: whosoever would, he filled his hand, and he was made a priest of the high places.",
        "34 And for this cause did the house of Jeroboam sin, and was cut off and destroyed from the face of the earth."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 106: 6-7ab, 19-20, 21-22",
      "reference": "Psalms 106: 6-7ab, 19-20, 21-22",
      "verses": [
        "R. (4a) Remember us, O Lord, as you favor your people.",
        "6 We have sinned with our fathers: we have acted unjustly, we have wrought iniquity.",
        "7ab Our fathers understood not thy wonders in Egypt.",
        "R. Remember us, O Lord, as you favor your people.",
        "19 They made also a calf in Horeb: and they adored the graven thing.",
        "20 And they changed their glory into the likeness of a calf that eateth grass.",
        "R. Remember us, O Lord, as you favor your people.",
        "21 They forgot God, who saved them, who had done great things in Egypt,",
        "22 Wondrous works in the land of Cham: terrible things in the Red Sea.",
        "R. Remember us, O Lord, as you favor your people."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Matthew 4: 4b",
      "reference": "Matthew 4: 4b",
      "verses": [
        "R. Alleluia, alleluia.",
        "4b One does not live on bread alone, but on every word that comes forth from the mouth of God.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 8: 1-10",
      "reference": "Mark 8: 1-10",
      "verses": [
        "1 In those days again, when there was a great multitude, and had nothing to eat; calling his disciples together, he saith to them:",
        "2 I have compassion on the multitude, for behold they have now been with me three days, and have nothing to eat.",
        "3 And if I shall send them away fasting to their home, they will faint in the way; for some of them came from afar off.",
        "4 And his disciples answered him: From whence can any one fill them here with bread in the wilderness?",
        "5 And he asked them: How many loaves have ye? Who said: Seven.",
        "6 And taking the seven loaves, giving thanks, he broke, and gave to his disciples for to set before them; and they set them before the people.",
        "7 And they had a few little fishes; and he blessed them, and commanded them to be set before them.",
        "8 And they did eat and were filled; and they took up that which was left of the fragments, seven baskets.",
        "9 And they that had eaten were about four thousand; and he sent them away.",
        "10 And immediately going up into a ship with his disciples, he came into the parts of Dalmanutha."
      ]
    }
  ]
}