{
  "date": "2026-02-11",
  "url": "https://www.catholicgallery.org/mass-reading/110226/",
  "title": "Daily Mass Readings for Wednesday, 11 February 2026",
  "feast": "Ordinary Weekday/ Our Lady of Lourdes",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Kings 10: 1-10",
      "reference": "First Kings 10: 1-10",
      "verses": [
        "1 And the queen of Saba, having; heard of the fame of Solomon in the name of the Lord, came to try him with hard questions.",
        "2 And entering into Jerusalem with a great train, and riches, and camels that carried spices, and an immense quantity of gold, and precious stones, she came to king Solomon, and spoke to him all that she had in her heart.",
        "3 And Solomon informed her of all the things she proposed to him: there was not any word the king was ignorant of, and which he could not answer her.",
        "4 And when the queen of Saba saw all the wisdom of Solomon, and the house which he had built,",
        "5 And the meat of his table, and the apartments of his servants, and the order of his ministers, and their apparel, and the cupbearers, and the holocausts, which he offered in the house of the Lord: she had no longer any spirit in her,",
        "6 And she said to the king: The report is true, which I heard in my own country,",
        "7 Concerning thy words, and concerning thy wisdom. And I did not believe them that told me, till I came myself, and saw with my own eyes, and have found that the half hath not been told me: thy wisdom and thy works, exceed the fame which I heard.",
        "8 Blessed are thy men, and blessed are thy servants, who stand before thee always, and hear thy wisdom.",
        "9 Blessed be the Lord thy God, whom thou hast pleased, and who hath set thee upon the throne of Israel, because the Lord hath loved Israel for ever, and hath appointed thee king, to do judgment and justice.",
        "10 And she gave the king a hundred and twenty talents of gold, and of spices a very great store, and precious stones: there was brought no more such abundance of spices as these which the queen of Saba gave to king Solomon."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 37: 5-6, 30-31, 39-40",
      "reference": "Psalms 37: 5-6, 30-31, 39-40",
      "verses": [
        "R. (30a) The mouth of the just murmurs wisdom.",
        "5 Commit thy way to the Lord, and trust in him, and he will do it.",
        "6 And he will bring forth thy justice as the light, and thy judgment as the noonday.",
        "R. The mouth of the just murmurs wisdom.",
        "30 The mouth of the just shall meditate wisdom: and his tongue shall speak judgment.",
        "31 The law of his God is in his heart, and his steps shall not be supplanted.",
        "R. The mouth of the just murmurs wisdom.",
        "39 But the salvation of the just is from the Lord, and he is their protector in the time of trouble.",
        "40 And the Lord will help them and deliver them: and he will rescue them from the wicked, and save them, because they have hoped in him.",
        "R. The mouth of the just murmurs wisdom."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 17: 17b, 17a",
      "reference": "John 17: 17b, 17a",
      "verses": [
        "R. Alleluia, alleluia.",
        "17b, 17a Your word, O Lord, is truth: consecrate us in the truth.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 7: 14-23",
      "reference": "Mark 7: 14-23",
      "verses": [
        "14 And calling again the multitude unto him, he said to them: Hear ye me all, and understand.",
        "15 There is nothing from without a man that entering into him, can defile him. But the things which come from a man, those are they that defile a man.",
        "16 If any man have ears to hear, let him hear.",
        "17 And when he was come into the house from the multitude, his disciples asked him the parable.",
        "18 And he saith to them: So are you also without knowledge? understand you not that every thing from without, entering into a man cannot defile him:",
        "19 Because it entereth not into his heart, but goeth into the belly, and goeth out into the privy, purging all meats?",
        "20 But he said that the things which come out from a man, they defile a man.",
        "21 For from within out of the heart of men proceed evil thoughts, adulteries, fornications, murders,",
        "22 Thefts, covetousness, wickedness, deceit, lasciviousness, an evil eye, blasphemy, pride, foolishness.",
        "23 All these evil things come from within, and defile a man."
      ]
    }
  ]
}