{
  "date": "2026-02-22",
  "url": "https://www.catholicgallery.org/mass-reading/220226/",
  "title": "Daily Mass Readings for Sunday, 22 February 2026",
  "feast": "First Sunday of Lent",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Genesis 2: 7-9; 3: 1-7",
      "reference": "Genesis 2: 7-9; 3: 1-7",
      "verses": [
        "7 And the Lord God formed man of the slime of the earth: and breathed into his face the breath of life, and man became a living soul.",
        "8 And the Lord God had planted a paradise of pleasure from the beginning: wherein he placed man whom he had formed.",
        "9 And the Lord God brought forth of the ground all manner of trees, fair to behold, and pleasant to eat of: the tree of life also in the midst of paradise: and the tree of knowledge of good and evil.",
        "3:1 Now the serpent was more subtle than any of the beasts of the earth which the Lord God had made. And he said to the woman: Why hath God commanded you, that you should not eat of every tree of paradise?",
        "2 And the woman answered him, saying: Of the fruit of the trees that are in paradise we do eat:",
        "3 But of the fruit of the tree which is in the midst of paradise, God hath commanded us that we should not eat; and that we should not touch it, lest perhaps we die.",
        "4 And the serpent said to the woman: No, you shall not die the death.",
        "5 For God doth know that in what day soever you shall eat thereof, your eyes shall be opened: and you shall be as Gods, knowing good and evil.",
        "6 And the woman saw that the tree was good to eat, and fair to the eyes, and delightful to behold: and she took of the fruit thereof, and did eat, and gave to her husband who did eat.",
        "7 And the eyes of them both were opened: and when they perceived themselves to be naked, they sewed together fig leaves, and made themselves aprons."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 51: 3-4, 5-6, 12-13, 14 and 17",
      "reference": "Psalms 51: 3-4, 5-6, 12-13, 14 and 17",
      "verses": [
        "R. (3a) Be merciful, O Lord, for we have sinned.",
        "3 Have mercy on me, O God, according to thy great mercy. And according to the multitude of thy tender mercies blot out my iniquity.",
        "4 Wash me yet more from my iniquity, and cleanse me from my sin.",
        "R. Be merciful, O Lord, for we have sinned.",
        "5 For I know my iniquity, and my sin is always before me.",
        "6 To thee only have I sinned, and have done evil before thee: that thou mayst be justified in thy words and mayst overcome when thou art judged.",
        "R. Be merciful, O Lord, for we have sinned.",
        "12 Create a clean heart in me, O God: and renew a right spirit within my bowels.",
        "13 Cast me not away from thy face; and take not thy holy spirit from me.",
        "R. Be merciful, O Lord, for we have sinned.",
        "14 Restore unto me the joy of thy salvation, and strengthen me with a perfect spirit.",
        "17 O Lord, thou wilt open my lips: and my mouth shall declare thy praise.",
        "R. Be merciful, O Lord, for we have sinned."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Romans 5: 12-19 or 5: 12, 17-19",
      "reference": "Romans 5: 12-19 or 5: 12, 17-19",
      "verses": [
        "12 Wherefore as by one man sin entered into this world, and by sin death; and so death passed upon all men, in whom all have sinned.",
        "13 For until the law sin was in the world; but sin was not imputed, when the law was not.",
        "14 But death reigned from Adam unto Moses, even over them also who have not sinned after the similitude of the transgression of Adam, who is a figure of him who was to come.",
        "15 But not as the offence, so also the gift. For if by the offence of one, many died; much more the grace of God, and the gift, by the grace of one man, Jesus Christ, hath abounded unto many.",
        "16 And not as it was by one sin, so also is the gift. For judgment indeed was by one unto condemnation; but grace is of many offences, unto justification.",
        "17 For if by one man’s offence death reigned through one; much more they who receive abundance of grace, and of the gift, and of justice, shall reign in life through one, Jesus Christ.",
        "18 Therefore, as by the offence of one, unto all men to condemnation; so also by the justice of one, unto all men to justification of life.",
        "19 For as by the disobedience of one man, many were made sinners; so also by the obedience of one, many shall be made just.",
        "Or",
        "12 Wherefore as by one man sin entered into this world, and by sin death; and so death passed upon all men, in whom all have sinned.",
        "17 For if by one man’s offence death reigned through one; much more they who receive abundance of grace, and of the gift, and of justice, shall reign in life through one, Jesus Christ.",
        "18 Therefore, as by the offence of one, unto all men to condemnation; so also by the justice of one, unto all men to justification of life.",
        "19 For as by the disobedience of one man, many were made sinners; so also by the obedience of one, many shall be made just."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Verse Before the Gospel: Matthew 4: 4b",
      "reference": "Verse Before the Gospel: Matthew 4: 4b",
      "verses": [
        "4b One does not live on bread alone, but on every word that comes forth from the mouth of God."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 4:1-11",
      "reference": "Matthew 4:1-11",
      "verses": [
        "1 Then Jesus was led by the spirit into the desert, to be tempted by the devil.",
        "2 And when he had fasted forty days and forty nights, afterwards he was hungry.",
        "3 And the tempter coming said to him: If thou be the Son of God, command that these stones be made bread.",
        "4 Who answered and said: It is written, Not in bread alone doth man live, but in every word that proceedeth from the mouth of God.",
        "5 Then the devil took him up into the holy city, and set him upon the pinnacle of the temple,",
        "6 And said to him: If thou be the Son of God, cast thyself down, for it is written: That he hath given his angels charge over thee, and in their hands shall they bear thee up, lest perhaps thou dash thy foot against a stone.",
        "7 Jesus said to him: It is written again: Thou shalt not tempt the Lord thy God.",
        "8 Again the devil took him up into a very high mountain, and shewed him all the kingdoms of the world, and the glory of them,",
        "9 And said to him: All these will I give thee, if falling down thou wilt adore me.",
        "10 Then Jesus saith to him: Begone, Satan: for it is written, The Lord thy God shalt thou adore, and him only shalt thou serve.",
        "11 Then the devil left him; and behold angels came and ministered to him."
      ]
    }
  ]
}