{
  "date": "2026-02-13",
  "url": "https://www.catholicgallery.org/mass-reading/130226/",
  "title": "Daily Mass Readings for Friday, 13 February 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: First Kings 11: 29-32; 12: 19",
      "reference": "First Kings 11: 29-32; 12: 19",
      "verses": [
        "29 So it came to pass at that time, that Jeroboam went out of Jerusalem, and the prophet Ahias the Silonite, clad with a new garment, found him in the way: and they two were alone in the held.",
        "30 And Ahias taking his new garment, wherewith he was clad, divided it into twelve parts:",
        "31 And he said to Jeroboam: Take to thee ten pieces: for thus saith the Lord the God of Israel: Behold I will rend the kingdom out of the hand of Solomon, and will give thee ten tribes.",
        "32 But one tribe shall remain to him for the sake of my servant David, and Jerusalem the city, which I have chosen out of all the tribes of Israel:",
        "12:19 And Israel revolted from the house of David, unto this day."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 81: 10-11ab, 12-13, 14-15",
      "reference": "Psalms 81: 10-11ab, 12-13, 14-15",
      "verses": [
        "R. (11a and 9a) I am the Lord, your God: hear my voice.",
        "10 There shall be no new god in thee: neither shalt thou adore a strange god.",
        "11ab For I am the Lord thy God, who brought thee out of the land of Egypt.",
        "R. I am the Lord, your God: hear my voice.",
        "12 But my people heard not my voice: and Israel hearkened not to me.",
        "13 So I let them go according to the desires of their heart: they shall walk in their own inventions.",
        "R. I am the Lord, your God: hear my voice.",
        "14 If my people had heard me: if Israel had walked in my ways:",
        "15 I should soon have humbled their enemies, and laid my hand on them that troubled them.",
        "R. I am the Lord, your God: hear my voice."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Acts 16: 14b",
      "reference": "Acts 16: 14b",
      "verses": [
        "R. Alleluia, alleluia.",
        "14b Open our hearts, O Lord, to listen to the words of your Son.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 7: 31-37",
      "reference": "Mark 7: 31-37",
      "verses": [
        "31 And again going out of the coasts of Tyre, he came by Sidon to the sea of Galilee, through the midst of the coasts of Decapolis.",
        "32 And they bring to him one deaf and dumb; and they besought him that he would lay his hand upon him.",
        "33 And taking him from the multitude apart, he put his fingers into his ears, and spitting, he touched his tongue:",
        "34 And looking up to heaven, he groaned, and said to him: Ephpheta, which is, Be thou opened.",
        "35 And immediately his ears were opened, and the string of his tongue was loosed, and he spoke right.",
        "36 And he charged them that they should tell no man. But the more he charged them, so much the more a great deal did they publish it.",
        "37 And so much the more did they wonder, saying: He hath done all things well; he hath made both the deaf to hear, and the dumb to speak."
      ]
    }
  ]
}