{
  "date": "2026-02-06",
  "url": "https://www.catholicgallery.org/mass-reading/060226/",
  "title": "Daily Mass Readings for Friday, 6 February 2026",
  "feast": "Paul Miki, Priest, Martyr, and Companions, Martyrs Obligatory Memorial",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Sirach 47: 2-11",
      "reference": "Sirach 47: 2-11",
      "verses": [
        "2 And as the fat taken away from the flesh, so was David chosen from among the children of Israel.",
        "3 He played with lions as with lambs: and with bears he did in like manner as with the lambs of the flock, in his youth.",
        "4 Did not he kill the giant, and take away reproach from his people? In lifting up his hand, with the stone in the sling he beat down the boasting of Goliath:",
        "5 For he called upon the Lord the Almighty, and he gave strength in his right hand, to take away the mighty warrior, and to set up the horn of his nation.",
        "6 So in ten thousand did he glorify him, and praised him in the blessings of the Lord, in offering to him a crown of glory:",
        "7 For he destroyed the enemies on every side, and extirpated the Philistines the adversaries unto this day: he broke their horn for ever.",
        "8 In all his works he gave thanks to the holy one, and to the most High, with words of glory. With his whole heart he praised the Lord, and loved God that made him: and he gave him power against his enemies:",
        "9 And he set singers before the altar, and by their voices he made sweet melody. And to the festivals he added beauty, and set in order the solemn times even to the end of his life,",
        "10 That they should praise the holy name of the Lord, and magnify the holiness of God in the morning.",
        "11 The Lord took away his sins, and exalted his horn for ever: and he gave him a covenant of the kingdom, and a throne of glory in Israel."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 18: 31, 47 and 50, 51",
      "reference": "Psalms 18: 31, 47 and 50, 51",
      "verses": [
        "R. (47b) Blessed be God my salvation!",
        "31 As for my God, his way is undefiled: the words of the Lord are fire tried: he is the protector of all that trust in him.",
        "R. Blessed be God my salvation!",
        "47 The Lord liveth, and blessed be my God, and let the God of my salvation be exalted:",
        "50 Therefore will I give glory to thee, O Lord, among the nations, and I will sing a psalm to thy name.",
        "R. Blessed be God my salvation!",
        "51 Giving great deliverance to his king, and shewing mercy to David his anointed: and to his seed for ever.",
        "R. Blessed be God my salvation!"
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: Luke 8: 15",
      "reference": "Luke 8: 15",
      "verses": [
        "R. Alleluia, alleluia.",
        "15 Blessed are they who have kept the word with a generous heart, and yield a harvest through perseverance.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 6: 14-29",
      "reference": "Mark 6: 14-29",
      "verses": [
        "14 And king Herod heard, (for his name was made manifest,) and he said: John the Baptist is risen again from the dead, and therefore mighty works shew forth themselves in him.",
        "15 And others said: It is Elias. But others said: It is a prophet, as one of the prophets.",
        "16 Which Herod hearing, said: John whom I beheaded, he is risen again from the dead.",
        "17 For Herod himself had sent and apprehended John, and bound him in prison for the sake of Herodias the wife of Philip his brother, because he had married her.",
        "18 For John said to Herod: It is not lawful for thee to have thy brother’s wife.",
        "19 Now Herodias laid snares for him: and was desirous to put him to death, and could not.",
        "20 For Herod feared John, knowing him to be a just and holy man: and kept him, and when he heard him, did many things: and he heard him willingly.",
        "21 And when a convenient day was come, Herod made a supper for his birthday, for the princes, and tribunes, and chief men of Galilee.",
        "22 And when the daughter of the same Herodias had come in, and had danced, and pleased Herod, and them that were at table with him, the king said to the damsel: Ask of me what thou wilt, and I will give it thee.",
        "23 And he swore to her: Whatsoever thou shalt ask I will give thee, though it be the half of my kingdom.",
        "24 Who when she was gone out, said to her mother, What shall I ask? But she said: The head of John the Baptist.",
        "25 And when she was come in immediately with haste to the king, she asked, saying: I will that forthwith thou give me in a dish, the head of John the Baptist.",
        "26 And the king was struck sad. Yet because of his oath, and because of them that were with him at table, he would not displease her:",
        "27 But sending an executioner, he commanded that his head should be brought in a dish.",
        "28 And he beheaded him in the prison, and brought his head in a dish: and gave it to the damsel, and the damsel gave it to her mother.",
        "29 Which his disciples hearing came, and took his body, and laid it in a tomb."
      ]
    }
  ]
}