{
  "date": "2026-02-18",
  "url": "https://www.catholicgallery.org/mass-reading/180226/",
  "title": "Daily Mass Readings for Wednesday, 18 February 2026",
  "feast": "Ash Wednesday. Begin Lenten Preparation for the Easter Triduum. Not a Holy Day of Obligation. Day of Fast (ages 18-59) and Abstinence from Meat (age 14 and up)",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: Joel 2: 12-18",
      "reference": "Joel 2: 12-18",
      "verses": [
        "12 Now therefore saith the Lord: Be converted to me with all your heart, in fasting, and in weeping, and in mourning.",
        "13 And rend your hearts, and not your garments, and turn to the Lord your God: for he is gracious and merciful, patient and rich in mercy, and ready to repent of the evil.",
        "14 Who knoweth but he will return, and forgive, and leave a blessing behind him, sacrifice and libation to the Lord your God?",
        "15 Blow the trumpet in Sion, sanctify a fast, call a solemn assembly,",
        "16 Gather together the people, sanctify the church, assemble the ancients, gather together the little ones, and them that suck at the breasts: let the bridegroom go forth from his bed, and the bride out of her bride chamber.",
        "17 Between the porch and the altar the priests the Lord’s ministers shall weep, and shall say: Spare, O Lord, spare thy people: and give not thy inheritance to reproach, that the heathen should rule over them. Why should they say among the nations: Where is their God?",
        "18 The Lord hath been zealous for his land, and hath spared his people."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 51: 3-4, 5-6ab, 12-13, 14 and 17",
      "reference": "Psalms 51: 3-4, 5-6ab, 12-13, 14 and 17",
      "verses": [
        "R. (3a) Be merciful, O Lord, for we have sinned.",
        "3 Have mercy on me, O God, according to thy great mercy. And according to the multitude of thy tender mercies blot out my iniquity.",
        "4 Wash me yet more from my iniquity, and cleanse me from my sin.",
        "R. Be merciful, O Lord, for we have sinned.",
        "5 For I know my iniquity, and my sin is always before me.",
        "6ab To thee only have I sinned, and have done evil before thee.",
        "R. Be merciful, O Lord, for we have sinned.",
        "12 Create a clean heart in me, O God: and renew a right spirit within my bowels.",
        "13 Cast me not away from thy face; and take not thy holy spirit from me.",
        "R. Be merciful, O Lord, for we have sinned.",
        "14 Restore unto me the joy of thy salvation, and strengthen me with a perfect spirit.",
        "17 O Lord, thou wilt open my lips: and my mouth shall declare thy praise.",
        "R. Be merciful, O Lord, for we have sinned."
      ]
    },
    {
      "type": "Second Reading",
      "heading": "Second Reading: Second Corinthians 5: 20 – 6:2",
      "reference": "Second Corinthians 5: 20 – 6:2",
      "verses": [
        "20 For Christ therefore we are ambassadors, God as it were exhorting by us. For Christ, we beseech you, be reconciled to God.",
        "21 Him, who knew no sin, he hath made sin for us, that we might be made the justice of God in him.",
        "6:1 And we helping do exhort you, that you receive not the grace of God in vain.",
        "2 For he saith: In an accepted time have I heard thee; and in the day of salvation have I helped thee. Behold, now is the acceptable time; behold, now is the day of salvation."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Verse Before the Gospel: Psalms 95: 8",
      "reference": "Verse Before the Gospel: Psalms 95: 8",
      "verses": [
        "8 If today you hear his voice, harden not your hearts."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Matthew 6: 1-6, 16-18",
      "reference": "Matthew 6: 1-6, 16-18",
      "verses": [
        "1 Take heed that you do not your justice before men, to be seen by them: otherwise you shall not have a reward of your Father who is in heaven.",
        "2 Therefore when thou dost an almsdeed, sound not a trumpet before thee, as the hypocrites do in the synagogues and in the streets, that they may be honoured by men. Amen I say to you, they have received their reward.",
        "3 But when thou dost alms, let not thy left hand know what thy right hand doth.",
        "4 That thy alms may be in secret, and thy Father who seeth in secret will repay thee.",
        "5 And when ye pray, you shall not be as the hypocrites, that love to stand and pray in the synagogues and corners of the streets, that they may be seen by men: Amen I say to you, they have received their reward.",
        "6 But thou when thou shalt pray, enter into thy chamber, and having shut the door, pray to thy Father in secret: and thy Father who seeth in secret will repay thee.",
        "16 And when you fast, be not as the hypocrites, sad. For they disfigure their faces, that they may appear unto men to fast. Amen I say to you, they have received their reward.",
        "17 But thou, when thou fastest anoint thy head, and wash thy face;",
        "18 That thou appear not to men to fast, but to thy Father who is in secret: and thy Father who seeth in secret, will repay thee."
      ]
    }
  ]
}