{
  "date": "2026-02-16",
  "url": "https://www.catholicgallery.org/mass-reading/160226/",
  "title": "Daily Mass Readings for Monday, 16 February 2026",
  "feast": "Ordinary Weekday",
  "readings": [
    {
      "type": "First Reading",
      "heading": "First Reading: James 1: 1-11",
      "reference": "James 1: 1-11",
      "verses": [
        "1 James the servant of God, and of our Lord Jesus Christ, to the twelve tribes which are scattered abroad, greeting.",
        "2 My brethren, count it all joy, when you shall fall into divers temptations;",
        "3 Knowing that the trying of your faith worketh patience.",
        "4 And patience hath a perfect work; that you may be perfect and entire, failing in nothing.",
        "5 But if any of you want wisdom, let him ask of God, who giveth to all men abundantly, and upbraideth not; and it shall be given him.",
        "6 But let him ask in faith, nothing wavering. For he that wavereth is like a wave of the sea, which is moved and carried about by the wind.",
        "7 Therefore let not that man think that he shall receive any thing of the Lord.",
        "8 A double minded man is inconstant in all his ways.",
        "9 But let the brother of low condition glory in his exaltation:",
        "10 And the rich, in his being low; because as the flower of the grass shall he pass away.",
        "11 For the sun rose with a burning heat, and parched the grass, and the flower thereof fell off, and the beauty of the shape thereof perished: so also shall the rich man fade away in his ways."
      ]
    },
    {
      "type": "Responsorial Psalm",
      "heading": "Responsorial Psalm: Psalms 119: 67, 68, 71, 72, 75, 76",
      "reference": "Psalms 119: 67, 68, 71, 72, 75, 76",
      "verses": [
        "R. (77a) Be kind to me, Lord, and I shall live.",
        "67 Before I was humbled I offended; therefore have I kept thy word.",
        "R. Be kind to me, Lord, and I shall live.",
        "68 Thou art good; and in thy goodness teach me thy justifications.",
        "R. Be kind to me, Lord, and I shall live.",
        "71 It is good for me that thou hast humbled me, that I may learn thy justifications.",
        "R. Be kind to me, Lord, and I shall live.",
        "72 The law of thy mouth is good to me, above thousands of gold and silver.",
        "R. Be kind to me, Lord, and I shall live.",
        "75 I know, O Lord, that thy judgments are equity: and in thy truth thou hast humbled me.",
        "R. Be kind to me, Lord, and I shall live.",
        "76 O! let thy mercy be for my comfort, according to thy word unto thy servant.",
        "R. Be kind to me, Lord, and I shall live."
      ]
    },
    {
      "type": "Alleluia",
      "heading": "Alleluia: John 14: 6",
      "reference": "John 14: 6",
      "verses": [
        "R. Alleluia, alleluia.",
        "6 I am the way and the truth and the life, says the Lord; no one comes to the Father except through me.",
        "R. Alleluia, alleluia."
      ]
    },
    {
      "type": "Gospel",
      "heading": "Gospel: Mark 8: 11-13",
      "reference": "Mark 8: 11-13",
      "verses": [
        "11 And the Pharisees came forth, and began to question with him, asking him a sign from heaven, tempting him.",
        "12 And sighing deeply in spirit, he saith: Why doth this generation seek a sign? Amen, I say to you, a sign shall not be given to this generation.",
        "13 And leaving them, he went up again into the ship, and passed to the other side of the water."
      ]
    }
  ]
}